freebsd/freebsd-src/sbin/tunefs/tunefs.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)tunefs.8	8.2 (Berkeley) 12/11/93
.\" $FreeBSD$
.\"
.Dd May 18, 2002
.Dt TUNEFS 8
.Os
.Sh NAME
.Nm tunefs
.Nd tune up an existing filesystem
.Sh SYNOPSIS
.Nm
.Op Fl A
.Op Fl a Ar maxcontig
.Op Fl e Ar maxbpg
.Op Fl f Ar avgfilesize
.Op Fl m Ar minfree
.Bk -words
.Op Fl n Ar enable | disable
.Op Fl o Ar space | time
.Op Fl p
.Op Fl s Ar avgfpdir
.Ek
.Ar special | Ar filesystem
.Sh DESCRIPTION
.Nm Tunefs
is designed to change the dynamic parameters of a filesystem
which affect the layout policies.
The
.Nm
program cannot be run on an active filesystem.
To change an active filesystem,
you must either downgrade the filesystem to read-only
or unmount it.
.Pp
The parameters which are to be changed are indicated by the flags
given below:
.Bl -tag -width indent
.It Fl A
The filesystem has several backups of the super-block.  Specifying
this option will cause all backups to be modified as well as the
primary super-block.  This is potentially dangerous - use with caution.
.It Fl a Ar maxcontig
Specify the maximum number of contiguous blocks that will
be laid out before allowing a rotational delay.
The default value is 16.
.It Fl e Ar maxbpg
Indicate the maximum number of blocks any single file can
allocate out of a cylinder group before it is forced to begin
allocating blocks from another cylinder group.
Typically this value is set to about one quarter of the total blocks
in a cylinder group.
The intent is to prevent any single file from using up all the
blocks in a single cylinder group,
thus degrading access times for all files subsequently allocated
in that cylinder group.
The effect of this limit is to cause big files to do long seeks
more frequently than if they were allowed to allocate all the blocks
in a cylinder group before seeking elsewhere.
For filesystems with exclusively large files,
this parameter should be set higher.
.It Fl f Ar avgfilezsize
Specify the expected average file size.
.It Fl m Ar minfree
Specify the percentage of space held back
from normal users; the minimum free space threshold.
The default value used is 8%.
Note that lowering the threshold can adversely affect performance:
.Pp
.Bl -bullet
.It
Settings of 5% and less force space optimization to
always be used which will greatly increase the overhead for file
writes.
.It
The filesystem's ability to avoid fragmentation will be reduced
when the total free space, including the reserve, drops below 15%.
As free space approaches zero, throughput can degrade by up to a
factor of three over the performance obtained at a 10% threshold.
.El
.Pp
If the value is raised above the current usage level,
users will be unable to allocate files until enough files have
been deleted to get under the higher threshold.
.It Fl n Ar enable | disable
Turn on/off soft updates.
.It Fl o Ar space | time
The filesystem can either try to minimize the time spent
allocating blocks, or it can attempt to minimize the space
fragmentation on the disk.
Optimization for space has much
higher overhead for file writes.
The kernel normally changes the preference automatically as
the percent fragmentation changes on the filesystem.
.It Fl p
Show a summary of what the current tunable settings
are on the selected filesystem.  More detailed information can be
obtained from the
.Xr dumpfs 8
or
.Xr ffsinfo 8
programs.
.It Fl s Ar avgfpdir
Specify the expected number of files per directory.
.El
.Pp
At least one of the above flags is required.
.Sh FILES
.Bl -tag -width ".Pa /etc/fstab"
.It Pa /etc/fstab
read this to determine the device file for a
specified mount point.
.El
.Sh SEE ALSO
.Xr fs 5 ,
.Xr dumpfs 8 ,
.Xr ffsinfo 8 ,
.Xr newfs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T "A Fast File System for UNIX"
.%J "ACM Transactions on Computer Systems 2"
.%N 3
.%P pp 181-197
.%D August 1984
.%O "(reprinted in the BSD System Manager's Manual, SMM:5)"
.Re
.Sh BUGS
This program should work on active filesystems.
.\" Take this out and a Unix Daemon will dog your steps from now until
.\" the time_t's wrap around.
.Pp
You can tune a filesystem, but you can't tune a fish.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
