freebsd/freebsd-src/usr.sbin/pkg_install/info/pkg_info.1
.\"
.\" FreeBSD install - a package for the installation and maintainance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" Jordan K. Hubbard
.\"
.\"
.\"     @(#)pkg_info.1
.\"
.TH pkg_info 1 "July 18, 1993" "" "FreeBSD"

.SH NAME
pkg_info - a utility for getting information on software package distributions.
.SH SYNOPSIS
.na
.B pkg_info
.RB [options]
.RB "pkg-file|pkg-name\ [.. pkg-file|pkg-name]"

.SH DESCRIPTION
The
.B pkg_info
command is used to dump out information for packages, either packed up in
files or already installed on the system
with the
.B pkg_create
command.

.SH OPTIONS
.TP
The following command line options are supported.
.TP
.B \-a
Show all currently installed packages.
.TP
.B \-v
Turns on verbose output.
.TP
.B \-p
Show the installation prefix for each package.
.TP
.B \-c
Show the comment (one liner) field for each package.
.TP
.B \-d
Show the long description field for each package.
.TP
.B \-i
Show the install script (if any) for each package.
.TP
.B \-k
Show the de-install script (if any) for each package.
.TP
.B \-r
Show the requirements script (if any) for each package.
.TP
.BI "\-e\ " pkg-name
If the package identified by
.I pkg-name
is currently installed, return 0, otherwise return 1.  This option
allows you to easily test for the presence of another (perhaps
prerequisite) package from a script.
.TP
.BI "\-l\ " str
Prefix each catagory of information shown with
.I str.
This is primarily of use to front-end programs who want to request a
lot of different information fields at once for a package, but don't
necessary want the output intermingled in such a way that they can't
organize it.  This lets you add a special token to the start of
each field.
.BI "\-t\ " template
Use
.I template
as the input to mktemp(3).  By default, this is the string
.B /tmp/instmp.XXXXXX
, but it may be necessary to override it in the situation where
space in your
.B /tmp
directory is limited. Be sure to leave some number of `X' characters
for mktemp(3) to fill in with a unique ID.
Note:  This should really not be necessary with pkg_info,
since very little information is extracted from each package
and one would have to have a very small /tmp indeed to overflow
it.
.PP
.SH "TECHNICAL DETAILS"
Package info is either extracted from files supplied on the
command line, or from already installed package information
in /var/db/pkg/<pkg-name>.
.SH BUGS
Sure to be some.
.SH "SEE ALSO"
.BR pkg_add "(" 1 "),"
.BR pkg_create "(" 1 "),"
.BR pkg_delete "(" 1 "),"
.SH AUTHORS
Jordan Hubbard

