<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $Id$
     $FreeBSD$
     Original revision: 1.287
-->

<articleinfo>
  <title>&os;/&arch; &release.current; notes de version</title>

  <pubdate>$FreeBSD$</pubdate>

  <corpauthor>Le Projet FreeBSD</corpauthor>

  <copyright>
    <year>2000</year>
    <year>2001</year>
    <year>2002</year>
    <holder role="mailto:doc@FreeBSD.org">Projet de Documentation de 
    FreeBSD</holder>
  </copyright>

  <abstract>
  <para>Les notes de version pour &os; &release.current;
  contiennent un r&eacute;sum&eacute; des changements r&eacute;alis&eacute;s dans le
  syst&egrave;me &os; de base depuis &release.prev;. Les
  changements concernant le noyau et les programmes
  utilisateurs sont mentionn&eacute;s ainsi que les avis de
  s&eacute;curit&eacute; applicables au syst&egrave;me de base qui ont &eacute;t&eacute;
  d&eacute;couverts depuis la derni&egrave;re version. Ces notes
  contiennent &eacute;galement quelques br&egrave;ves remarques sur la
  mise &agrgave; jour.</para>
  </abstract>
</articleinfo>

<sect1>
  <title>Introduction</title>
        <para>Ce document contient les notes de version pour &os;
        &release.current; sur plate-forme &arch.print;. Il d&eacute;crit les 
	nouvelles fonctions de &os; qui ont &eacute;t&eacute; ajout&eacute;es 
	(ou modifi&eacute;es) depuis &release.prev;. Il contient &eacute;galement 
	quelques notes sur la mise &agrgave; jour depuis la version 
	pr&eacute;c&eacute;dente de &os;.</para>
<![ %release.type.snapshot [

        <para>La distribution snapshot &agrgave; laquelle s'applique ces notes
        de version repr&eacute;sente une &eacute;tape sur la branche de
        d&eacute;veloppement &release.branch; entre &release.prev; et la future
        &release.next;. Quelques distributions binaires pr&eacute;-compil&eacute;es
        de la version snapshot pour cette branche sont pr&eacute;sentes
        sur <ulink url="&release.url;"></ulink>.</para>

]]>


<![ %release.type.release [



  <para>Cette distribution de &os; &release.current; est uune distribution
  de type &release.type;. Elle est disponible a <ulink
  url="&release.url;"></ulink> 
  ou sur un des mirroirs. Pour plus d'informations sur la façon d'obtenir 
  cette (ou une autre) distribution &release.type;  de &os; voyez 
  le chapitre <ulink
  url="http://www.FreeBSD.org/handbook/mirrors.html"><quote>Obtenire
  FreeBSD</quote></ulink> du <ulink url="http://www.FreeBSD.org/handbook/">
  guide de r&eacute;f&eacute;rence de FreeBSD</ulink>.</para>

]]>
</sect1>

<!--
	The "What's New" section of the release notes. 

	Guidelines for new entries:

	1.  If there is some obvious "keyword" associated with an
	entry (such as a manpage entry or an application name), try to
	put it at the start of the sentence.

	2.  Within each subsection (i.e. kernel, security, userland),
	list items in alphabetical order by these keywords.

	Some entries will have no obvious keywords to help with
	ordering.  In sections containing these entries, put those
	containing (e.g.) manpage references first, then some
	suitable SGML comment line as a demarc, then the remaining
	entries.

-->

<sect1>
  <title>Les nouveaut&eacute;s</title>

        <para>Cette section d&eacute;crit les fonctions nouvelles ou les
        modifications les plus visibles pour l'utilisateur sous
        &os; depuis la version &release.prev;. Il s'agit
        typiquement de nouveaux gestionnaires de p&eacute;riph&eacute;riques ou
        du support de mat&eacute;riels, de nouvelles commandes ou options,
        de corrections de bugs majeurs, ou de mise &agrgave; jour de
        logiciels. Les avis de s&eacute;curit&eacute; pour le syst&egrave;me de base
        d&eacute;couverts apr&egrave;s la &release.prev; sont &eacute;galements
        mentionn&eacute;s.</para>

        <para>De nombreux changements suppl&eacute;mentaires apport&eacute;s &agrgave;
        &os; ne sont pas mentionn&eacute;s ici par faute de place. Par
        exemple, la documentation a &eacute;t&eacute; corrig&eacute;e et am&eacute;lior&eacute;e, 
	des bugs mineurs ont &eacute;t&eacute; corrig&eacute;s, du code potentiellement 
	dangereux pour la s&eacute;curit&eacute; a &eacute;t&eacute; audit&eacute; et corrig&eacute; 
	et le code source a &eacute;t&eacute; remis au propre.</para>

  <sect2 id="kernel">
    <title>**Changements concernant le noyau</title>

    <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;rique &man.amdpm.4; 
    a &eacute;t&eacute; ajout&eacute; pour permettre d'acc&eacute;der aux fonctions du 
    syst&egrave;me de surveillance des puces AMD 756 chipset. &merged;</para>

    <para>Le gestionnaire de p&eacute;riph&eacute;rique &man.agp.4; pour les
    p&eacute;riph&eacute;riques AGS a &eacute;t&eacute; ajout&eacute;. &merged;</para>

    <para>Une nouvelle commande <command>show pcpu</command> ajout&eacute;e a 
    &man.ddb.4;, permet d'obtenir la liste des donn&eacute;es par 
    processeur.</para>

    <para>Deux nouvelles commandes a &man.ddb.4; , <command>hwatch</command> et
    <command>dhwatch</command>, ont &eacute;t&eacute; introduites.  Parall&egrave;lement a 
    <command>watch</command> et <command>dwatch</command>, elles permettent
    d'installer des points de v&eacute;rification mat&eacute;riels (en opposition aux
    point de v&eacute;rification logiciels) si l'architecture mat&eacute;rielle le 
    supporte. &merged;</para>

    <para>&man.devfs.5;, permet de cr&eacute;er automatiquement les entr&eacute;es 
    n&eacute;cessaires dans le r&eacute;pertoire <filename>/dev</filename> et le 
    support des p&eacute;riph&eacute;riques a attachement variable, a &eacute;t&eacute; 
    longuement revu. &man.devfs.5; est maintenant activ&eacute; par d&eacute;faut 
    et peut etre d&eacute;sactiv&eacute; par l'option du noyau 
    <literal>NODEVFS</literal> .</para>

    <para>Le gestionnaire de p&eacute;riph&eacute;rique dgm a &eacute;t&eacute; retir&eacute; 
    en faveur du gestionnaire digi.</para>

    <para>Un nouveau gestionnaire de p&eacute;riph&eacute;rique digi a &eacute;t&eacute; 
    ajout&eacute; pour supporter les cartes Digiboard PCI Xr et ISA Xem. Un 
    nouveau programme, &man.digictl.8;, permet de r&eacute;-initialiser les 
    cartes qui ont des modules de ports externes attach&eacute;s comme les 
    PC/Xem.</para>

    <para>Un nouvel appel syst&egrave;me &man.eaccess.2; a &eacute;t&eacute; ajout&eacute;, 
    similaire &agrgave; &man.access.2; except&eacute; qu'il utilise les identit&eacute;s 
    effective au lieu des identit&eacute;s r&eacute;elles.</para>

    <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;rique &man.ichsmb.4; 
    pour les cartes controleur Intel 82801AA (ICH) SMBus et compatibles a 
    &eacute;t&eacute; ajout&eacute;. &merged;</para>

    <para>Chaque environnement &man.jail.2; peut maintenant tourner dans 
    son niveau de s&eacute;curit&eacute; personnel.</para>

    <para>Les variables sysctl pour&man.jail.2; ont &eacute;t&eacute; d&eacute;plac&eacute;es
     de la hi&eacute;rarchie <varname>jail.*</varname> a 
     <varname>security.*</varname>.  Les autres variable sysctl ayant un 
     rapport avec la s&eacute;curit&eacute; ont &eacute;t&eacute; d&eacute;plac&eacute;es de la 
     hi&eacute;rarchie <varname>kern.security.*</varname> a 
     <varname>security.*</varname>.</para>

    <para>La variable <varname>kern.maxvnodes</varname> limite maintenant 
    propremement le nombre de vnodes utilis&eacute;s. Pr&eacute;c&eacute;demment 
    uniquement les vnodes n'utilisant pas les pages de cache pouvaient etre 
    lib&eacute;r&eacute;s; cela pouvait conduire a un nombre croissant de vnodes sans 
    limitation m&eacute;moire sur des machines acc&eacute;dant a beaucoup de petits 
    fichiers. Un thread noyau, <literal>vnlru</literal>, permet d'aider a 
    lib&eacute;rer et r&eacute;utiliser les vnodes &merged;</para>

    <para>Le tambon des messages noyau est maintenant accessible (de façon
    ind&eacute;pendante de l'architecture) via la variable sysctl 
    <varname>kern.msgbuf</varname> ; &man.dmesg.8; n'a plus besoin d'etre
    SGID <groupname>kmem</groupname>. &merged;</para>

    <para>L'appel syst&egrave;me &man.kqueue.2; a &eacute;t&eacute; ajout&eacute; au noyau
     &os;. C'est une nouvelle interface qui remplace 
     &man.poll.2;/&man.select.2;, qui offre de mailleurs performances ainsi
      que la possiblit&eacute; de rapporter diff&eacute;rents type d'&eacute;v&eacute;nements.
       Il supporte la supervision des changements dans les sockets, les pipes,
        les fifos, les fichiers, les signaux et les processus. &merged;</para>

    <para arch="i386">une nouvelle option du noyau
     <varname>KVA_SPACE</varname> permet de reconfigurer la taille de l'espace
     adressable virtuel du noyau. &merged;</para>

    <para>Le gestionnaire de p&eacute;riph&eacute;rique &man.labpc.4; a &eacute;t&eacute; 
    retirer du a <quote>bitrot</quote>.</para>

    <para>Le chargeur et le linker du noyau v&eacute;rifient via la pr&eacute;sence
    du fichier <filename>linker.hints</filename> dans chaque r&eacute;pertoire 
    des modules chargeables par le noyau du nom du module et de la version 
    du fichier KLD. L'utilitaire &man.kldxref.8; permet de g&eacute;n&eacute;rer ces
     fichiers.</para>


    <para>L'&eacute;mulation Linux supporte maintenant les fonctionnalit&eacute;s 
    noyau n&eacute;cessaires au port 
    <filename role="package">emulators/linux_base-7</filename> 
    (&eacute;mulation RedHat 7.X). &merged;</para>

    <para>L'&eacute;mulation linux n&eacute;cessite maintenant l'option 
    <literal>options SYSVSEM</literal> dans le fichier de configuration 
    du noyau. &merged;</para>

    <para>**&man.lomac.4;, a Low-Watermark Mandatory Access Control
    security facility, has been added as a kernel module.  It provides
    a drop-in security mechanism in addition to the traditional
    UID-based security facilities, requiring no additional
    configuration from the administrator.  Work on this feature was
    sponsored by DARPA and NAI Labs.</para>

    <para>La variable de configuration du noyau <varname>maxusers</varname> 
    est maintenant param&eacute;trable au moment du d&eacute;marrage. Les autres
     param&egrave;tres d&eacute;pendant de <varname>maxusers</varname> sont maintenant
      modifiables au d&eacute;marrage. Le param&egrave;tre <varname>hz</varname> est
       lui aussi modifiable. &merged;</para>

    <para>Une valeur de <literal>0</literal> 
    pour la variable noyau <varname>maxusers</varname> indique de calculer
    ,au moment du d&eacute;marrage, une valeur apropri&eacute;e (entre 32 et 384, en
     fonction de la quantit&eacute; de m&eacute;moire). C'est la valeur par d&eacute;faut
      du  noyau <filename>GENERIC</filename>. &merged;</para>

    <para arch="alpha">L'option noyau <varname>MAXMEM</varname> ,
    coupl&eacute;e a la variable <varname>hw.physmem</varname> permet de
    r&eacute;duire, de façon articielle, la quantit&eacute; de m&eacute;moire 
    pr&eacute;sente sur une machine pour les tests (ou d'autres choses).
    &merged;</para>

    <para>Les parametres noyau
    <varname>MAXTSIZ</varname>, <varname>DFLDSIZ</varname>,
    <varname>MAXDSIZ</varname>, <varname>DFLSSIZ</varname>,
    <varname>MAXSSIZ</varname>, et <varname>SGROWSIZ</varname> 
    sont maintenant des variable modifiables (<varname>kern.maxtsiz</varname>,
    <varname>kern.maxdfldsiz</varname>, etc.). &merged;</para>

    <para arch="i386">Les options de configuration du noyau
     <literal>NCPU</literal>, <literal>NAPIC</literal>,
    <literal>NBUS</literal>, et <literal>NINTR</literal>,
    permettant de configurer les noyaux SMP, ont &eacute;t&eacute; retir&eacute;s.
    L'option <literal>NCPU</literal> est maintenant fix&eacute;e a 16 et 
    les autres options sus-mentionn&eacute;es sont dynamiques. &merged;</para>

    <para>Un gestionnaire de p&eacute;riph&eacute;rique null-modem, &man.nmdm.4; a
     &eacute;t&eacute; ajout&eacute;. &merged;</para>

    <para>L'option <literal>O_DIRECT</literal> a &eacute;t&eacute; ajout&eacute;e a
    &man.open.2; et &man.fcntl.2;. L'ajout de cette option au moment
    de l'ouverture de fichiers tente de minimiser les effects du cache
    en lecture et en &eacute;criture &merged;</para>

    <para>Le gestionnaire de p&eacute;riph&eacute;rique &man.orm.4; a &eacute;t&eacute; 
    ajout&eacute; permettant d'utiliser la ROM optionnel dans l'espace 
    m&eacute;moire ISA des I/O, cela permet de pr&eacute;venir d'autres gestionnaires
     de p&eacute;riph&eacute;riques de r&eacute;clamer cette espace m&eacute;moire et donc 
     d'entrer en conflit avec.&merged;</para>

    <para arch="i386">Le support PECOFF (format d'&eacute;x&eacute;cution Win32) a
     &eacute;t&eacute; ajout&eacute;.</para>

    <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;rique pcm supporte 
    maintenant la gestion d'&eacute;nergie de the NEC PC-98NOTE.. &merged;</para>

    <para>Les objets de m&eacute;moire partag&eacute;s POSIX.1b sont maintenant	
    support&eacute;s. L'impl&eacute;mentation utilise des fichiers, mais active 
    automatiquement l'option MAP_NOSYNC lorsqu'ils sont &man.mmap.2;-ed.
     &merged;</para>

    <para>Les diff&eacute;rentes options <literal>PQ_*CACHE</literal> ont 
    &eacute;t&eacute; remplac&eacute;es par une seul option 
    <literal>PQ_CACHESIZE</literal> permettant de fixer la taille du 
    cache en kilobytes. Les anciennes options sont toujours support&eacute;es 
    pour la compatibilit&eacute;.&merged;</para>

    <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;rique &man.puc.4; 
    (PCI <quote>Universal</quote> Communications) a &eacute;t&eacute; ajout&eacute;, 
    permettant de connecter les ports s&eacute;ries PCI au 
    gestionnaire &man.sio.4;.</para>

    <para>Le gestionnaire de p&eacute;riph&eacute;rique &man.random.4; a &eacute;t&eacute; 
    r&eacute;&eacute;crit pour utiliser l'algorithme <application>Yarrow</application>.
    Il permet d'obtenir une meilleur entropy, depuis diff&eacute;rentes sources,
     incluant la console, les interfaces r&eacute;seaux Ethernet et PPP, et les
      p&eacute;riph&eacute;riques de stockage. L'entropy de  &man.random.4; est
       maintenant p&eacute;riodiquement sauvegard&eacute; dans des fichiers dans le 
       r&eacute;pertoire <filename>/var/db/entropy</filename>, ainsi que au moment
        de l'arret du syst&egrave;me. La s&eacute;mantique de 
	<filename>/dev/random</filename> a chang&eacute;; il ne bloque plus
	en attendant des bits d'entropy, mais g&eacute;n&eacute;re un flux de pseudo
	donn&eacute;es al&eacute;atoires exactement comme
	 <filename>/dev/urandom</filename>.</para>

    <para>Une nouvelle option du noyau, <literal>options REGRESSION</literal>,
    active les interfaces et les fonctionnalit&eacute;s utiles lors des phases de
    regression et de correction.</para>

    <para arch="i386">Un gestionnaire de p&eacute;riodiquement &man.spic.4;, 
    permettant d'acc&eacute;der au p&eacute;riph&eacute;rique d'appel de certains
    portable Sony, a &eacute;t&eacute; ajout&eacute;..</para>

    <para>Le gestionnaire de p&eacute;riph&eacute;rique &man.syscons.4; supporte 
    maintenant le copier-coller via le clavier, par d&eacute;faut via les 
    touches <keycap>Shift</keycap>-<keycap>Insert</keycap>.</para>

    <para>Le support des p&eacute;riph&eacute;riques USB a &eacute;t&eacute; ajout&eacute; au 
    noyau <filename>GENERIC</filename> et au programme d'installation pour
    permettre de supporte les p&eacute;riph&eacute;riques USB par d&eacute;faut. Notez 
    que SRM ne supporte pas tous les p&eacute;riph&eacute;riques USB actuellement, 
    et donc vous devez utilisez un clavier AT si vous n'utilisez pas 
    une console s&eacute;rie. &merged;</para>

    <para arch="i386">Un gestionnaire de p&eacute;riph&eacute;riques umodem pour
    les modems USB a &eacute;t&eacute; ajout&eacute;. Il supporte les modems 3Com 5605 et
     Metricom Ricochet GS wireless USB modems. &merged;</para>

    <para arch="i386">Un gestionnaire de p&eacute;riph&eacute;riques &man.uscanner.4;
     permettant le support basique de scanner USB utilisant SANE a &eacute;t&eacute; 
     ajout&eacute;. R&eacute;f&eacute;rez vous a
    <ulink
    url="http://www.mostang.com/sane/">la page SANE</ulink> pour la liste
    des scanners support&eacute;s Les scanners HP ScanJet 4100C, 5200C et 6300C 
    sont support&eacute;s. &merged;</para>

    <para>L'option du noyau <literal>USER_LDT</literal> est maintenant 
    activ&eacute;e par d&eacute;faut.</para>

    <para>Un gestionnaire de p&eacute;riph&eacute;riques VESA S3 linear framebuffer 
    a &eacute;t&eacute; ajout&eacute;.</para>

    <!-- Above this line, kernel changes ordered by manpage/variable name -->

    <para>**Write combining for crashdumps has been implemented.  This
    feature is useful when write caching is disabled on both SCSI and
    IDE disks, where large memory dumps could take up to an hour to
    complete. &merged;</para>

    <para>Les tr&egrave;s grands swap (&gt;67 GB) ne panique plus le 
    syst&egrave;me.</para>

    <para arch="alpha">Le support pour les threads en &eacute;mulation Linux a 
    &eacute;t&eacute; ajout&eacute;.</para>

    <para>La cible <maketarget>buildkernel</maketarget> prend en compte
    la variable <varname>KERNCONF</varname> et non plus 
    <varname>KERNEL</varname> pour savoir quel fichier du noyau cr&eacute;er. 
    Il n'est plus n&eacute;cessaire, dans certains cas, de faire pr&eacute;c&eacute;der
     un <maketarget>buildkernel</maketarget> par un 
     <maketarget>buildworld</maketarget>. 
     (Un <maketarget>buildworld</maketarget> est n&eacute;cessaire pour la 
     mise &agrgave; jour lors des version majeures, ou de la mise a jour
    de <application>binutil</application> et lors de changements dans 
    &man.config.8;.) &merged;</para>


    <para>Le code de terminaison des processus lorsqu'il n'y a plus
    de swap commence maintenant a terminer plus tot les processus, pour 
    empecher les deadlocks; il prend en compte la quantit&eacute; d'espace
    de swap utilis&eacute; par les processus lors du calcul de la taille des 
    processus.&merged;</para>

    <para>Les d&eacute;finitions du linker sont maintenant inclues par d&eacute;faut; 
    &man.gensetdefs.8; n'est donc plus n&eacute;cessaire et a donc &eacute;t&eacute; 
    retir&eacute;.</para>

    <para>Un vertain nombre de changements SMP a &eacute;t&eacute; effectu&eacute; au 
    niveau de l'allocation des mbuf du noyau.</para>

    <para>Le clonage de p&eacute;riph&eacute;rique r&eacute;seau a &eacute;t&eacute; 
    impl&eacute;ment&eacute;, et le p&eacute;riph&eacute;rique &man.gif.4; a &eacute;t&eacute; 
    modifi&eacute; pour en tirer parti. Donc maintenant au lieu de sp&eacute;cifi&eacute; 
    le nombre d'interfaces &man.gif.4; disponibles dans le fichier de 
    configuration du noyau, L'option <option>create</option> de 
    &man.ifconfig.8; doit etre utilis&eacute;e lorsqu'une autre instance de 
    p&eacute;riph&eacute;rique est d&eacute;sir&eacute;e. &merged;</para>

    <para>Il est maintenant possible de rajouter des variables d'environnement
    directement dans le noyau au moment de la compilation en utilisant la 
    directive<literal>ENV</literal> de &man.config.8; .</para>

   <para>**Idle zeroing of pages can be enabled with the
    <varname>vm.zeroidle_enable</varname> sysctl variable.</para>

    <para arch="i386">Les adresses de chargement du noyau sont maintenant 
    export&eacute;es dans une table de symboles et diff&eacute;rentes constantes 
    anciennement cod&eacute;es en dur ont &eacute;t&eacute; retir&eacute;es, ce qui permet 
    a certains programmes, comme &man.ps.1;, de fonctionner avec des noyaux 
    compil&eacute;s a diff&eacute;rentes adresses. &merged;</para>

    <para>Le vidage de m&eacute;moire des gros processus (ou d'un nombre important
    de processus) ne bloque plus la machine pour un long moment. 
    &merged;</para>

    <para>Le noyau prend en compte maintenant le concept que il y a
    des unit&eacute;s plus petites que un processus a g&eacute;rer (mais il ne peut
    avoir plus d'un thread par processus autoris&eacute; a un moment pr&eacute;cis).
    </para>

    <para>Le noyau supporte maintenant plusieurs p&eacute;riph&eacute;riques 
    bas-niveau pour la console. Le nouvel utilitaire &man.conscontrol.8; 
    permet de g&eacute;rer ces diff&eacute;rentes consoles..</para>

    <para arch="alpha">Le gestionnaire de p&eacute;riph&eacute;riques des console 
    supporte maintenant les cartes graphiques de type TGA.</para>

    <para>Le noyau se trouvant sur les CDs d'installation est maintenant
    s&eacute;par&eacute; de l'image <filename>mfsroot</filename>. Cela permet 
    d'utiliser un noyau complet lors de l'installation sur des machines 
    permettantde d&eacute;marrer sur les CDs (plutot que d'avoir le noyau 
    restreint utilis&eacute; sur les disquettes). &merged;</para>

    <para>**The system load average computation now adds some jitter to
    the timing of samples, in order to avoid synchronization with
    processes that run periodically. &merged;</para>

    <para>Si vous cr&eacute;ez un noyau de d&eacute;boggage (en utilisant par ex 
    <literal>makeoptions DEBUG=-g</literal>),les modules chargeables
    a la demande seront aussi compiler avec le support de d&eacute;boggage. Le
    seul probl&egrave;me engendr&eacute; sera que les modules construits avec un noyau
    de d&eacute;boggage prendront plus de place disque de pr&eacute;cedemment. 
    &merged;</para>

    <para>Le p&eacute;riph&eacute;rique de dump noyau peut maintenant etre activ&eacute;
    via le module chargeur <varname>dumpdev</varname>. Cela permet 
    dor&eacute;navant d'obtenir des informations sur les crashs du a des panic 
    aux derniers moments d'initialisation du noyau (avant que le syst&egrave;me 
    ne passe en mode mono-utilisateur). &merged;</para>

    <sect3>
      <title>Support des cartes m&egrave;res et des processeurs</title>

      <para>Le support multi-processeur SMP a &eacute;t&eacute; largement revu, et 
      le code de BSD/OS 5.0 a &eacute;t&eacute; incorpor&eacute;. Une des 
      fonctionnalit&eacute;s importantes de SNMPng ((<quote>SMP Next 
      Generation</quote>) est de permettre a plus de processus de fonctionner
       en mode noyau, tout en ne n&eacute;cessitant pas de "spin locks" qui 
       r&eacute;duisent &eacute;norm&eacute;ment l'utilit&eacute; des syst&egrave;mes 
       multi-processeurs. Les "handlers" d'interruptions ont maintenant 
       leur propre contexte, ce qui permet de les bloquer et donc qui permet
       de r&eacute;duire le besoin de poser des "locks" sur les interruptions.
       </para>

      <para arch="i386">Le support des processeurs 80386 a &eacute;t&eacute; retir&eacute;
      du noyau <filename>GENERIC</filename> car ce code r&eacute;duisait 
      la performance sur les autres processeurs IA32</para>

      <para arch="i386">L'option noyau<literal>I386_CPU</literal> permettant
      le support des processeurs 80386 est maintenant exclusive par rapport au 
      support des autres processeurs IA32; cela devrait s&eacute;rieusement 
      augmenter la performance sur les 80386 du a l'&eacute;limination des 
      v&eacute;rifications du type de processeur au moment de 
      l'&eacute;x&eacute;cution.</para>

      <para arch="i386">Les noyaux devant tourn&eacute;s sur des 80386 peuvent etre
      construits en ne rajoutant dans les options CPU du noyau uniquement
      <literal>I386_CPU</literal>.</para>

      <para arch="alpha">Les serveurs AlphaServer 1200 (<quote>Tincup</quote>) 
      ont &eacute;t&eacute; test&eacute;s et fonctionnent. Pour l'instant il n'est pas 
      possible de d&eacute;marrer depuis un CD ou un lecteur de disquette, mais
       en prenant un disque venant d'un autre server Alpha cela 
       fonctionne.&merged;</para>

      <para arch="alpha">La carte m&egrave;re API UP1100 est valid&eacute;e .</para>

      <para arch="alpha">Les serveurs API CS20 1U sont valid&eacute;s.</para>

      <para arch="alpha">Le support pour les s&eacute;ries DEC3000 a &eacute;t&eacute; 
      retir&eacute; de l'image mfsroot disquette, cela permet d'obtenir une image
       sur une disquette 1.44 Mbyte. Comme le DEC300 est actuellement 
       uniquement utilisable sans disque, cela ne devrait pas poser de
        probl&egrave;mes.</para>

      <para arch="alpha">Le support pour les AlphaServer 2100A 
      (<quote>Lynx</quote>) a &eacute;t&eacute; ajout&eacute;.</para>

      <para arch="alpha">Du code dans le noyau a &eacute;t&eacute; ajout&eacute; pour
       permettre a de vieilles g&eacute;n&eacute;rations de processeurs Alpha
       (EV4 et EV5) d'&eacute;muler les instructions pour les nouvelles 
       g&eacute;n&eacute;rations de processeurs Alphas. Cela permet d'utiliser 
       certains programmes, disponibles uniquement en binaire, comme 
       <application>Adobe Acrobat 4</application> sur des processeurs 
       EV4 et EV5.</para>

      <para arch="alpha">Le support SMP sur Alpha est maintenant 
      op&eacute;rationnel.</para>

      <para arch="i386">La d&eacute;tection des nouveaux processeurs, comme
      FC-PGA2 Pentium III (Tualatin), Transmeta Crusoe, et Transmeta
      Crusoe LongRun, a &eacute;t&eacute; ajout&eacute;. &merged;</para>

      <para arch="alpha">Le support du mat&eacute;riel suivant a &eacute;t&eacute; retirer
       du noyau d'installation pour permettre d'obtenir une disquette 1.44.Mb:
        Multia, NoName, PC64, EB64, Aspen Alpine, sa (SCSI tape), amr, support
	 du port parallel,  vx (3c590, 3c595), pcn (AMD Am79C97x PCI 10/100),
	  sf (Adaptec AIC-6915), sis (SiS 900/SiS 7016), ste (Sundance ST201
	  (D-Link DFE-550TX)), wb (Winbond W89C840F).</para>

      <para arch="i386">Le support pour Streaming <acronym>SIMD</acronym>
      Extensions (<acronym>SSE</acronym>) a &eacute;t&eacute; introduit. L'option du
       noyau <literal>CPU_ENABLE_SSE</literal> controle l'int&eacute;gration dans
        le noyau.&merged;</para>


    </sect3>

    <sect3>
      <title>Gestionnaire de d&eacute;marrage</title>

      <para arch="i386">Un nouvel utilitaire <filename>cdboot</filename> 
      pour les CDROMs donne une meilleur compatibilit&eacute; avec certains BIOS 
      qui ne respectait pas totalement l'impl&eacute;mentation standard des CDROM 
      bootable El Torito . Le nouveau gestionnaire de d&eacute;marrage supporte
      le mode <quote>no emulation</quote> de d&eacute;marrage qui permet 
      d'&eacute;liminer le besoin d'&eacute;mulation d'une image m&eacute;moire d'une 
      disquette pour un CDROM bootable. &merged;</para>

      <para arch="i386">Le gestionnaire de d&eacute;marrage i386 supporte 
      maintenant un nouveau type de console,<literal>nullconsole</literal>, 
      permettant d'utiliser un syst&egrave;me sans carte vid&eacute;o et sans port
      s&eacute;rie. &merged;</para>

      <para arch="i386">Le programme &man.loader.8; dispose maintenant du 
      support optionnel (activer a la compilation, d&eacute;sactiv&eacute; par 
      d&eacute;faut) pour charger des noyaux et des modules compress&eacute;s 
      en <application>bzip2</application>. &merged;</para>

      <para arch="i386">Le support Intel's Wired for Management 2.0 (PXE) a
       &eacute;t&eacute; ajout&eacute; au gestionnaire de d&eacute;marrage de &os;. Du a des 
       diff&eacute;rences d'API, l'ancienne version de PXI n'est plus 
       support&eacute;e. Cela permet de d&eacute;marrer en r&eacute;seau en utilisant le
        DHCP.&merged;</para>

      <!-- Above this line, order bootloader changes by keyword-->

      <para arch="i386">Le gestionnaire de d&eacute;marrage de &os; contient 
      maintenant un correctif permettant de supporte le d&eacute;marrage sur un
       CDROM sur certains BIOS IBM qui s'attendaient a ce que le premier
        secteur de l'&eacute;mulation des disquette contiennt un BPB MS-DOS 
	valide pour qu'ils puissent le modifier. &merged;</para>

      <para arch="i386">Le gestionnaire de d&eacute;marrage de &os; dispose 
      maintenant d'une option <option>-p</option> permettant de forcer le 
      noyau a faire une pause entre chaque ligne d'affichage au moment de la 
      phase de  d&eacute;tection. &merged;</para>

      <para arch="alpha,i386">Le gestionnaire de d&eacute;marrage de &os; est 
      maintenant capable de d&eacute;marrer depuis des syst&egrave;mes de fichier 
      ayant des tailles de block de plus de 8K.&merged;</para>

      <para>Le noyau et les modules ont &eacute;t&eacute; d&eacute;plac&eacute;s dans le 
      r&eacute;pertoire <filename>/boot/kernel</filename>, pour permettre de les 
      manipuler ensemble de façon plus simple. Le gestionnaire de 
      d&eacute;marrage a &eacute;t&eacute; mise &agrgave; jour pour refl&eacute;ter ce 
      changement.</para>

<!-- Above this line, order boot loader changes by manpage/variable name-->

    </sect3>

    <sect3>
      <title>Support des interfaces r&eacute;seau</title>
<!-- Above this line, order network driver changes by manpage/variable name-->

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.an.4; pour les cartes
       Cisco Aironet supporte maintenant le chiffrement "Wired Equivalent 
       Privacy" (WEP), et est controlable via &man.ancontrol.8;.&merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.an.4; supporte 
      maintenant les s&eacute;ries Cisco Aironet 350. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.an.4; supporte le 
      mode <quote>monitor</quote> controlable via l'option 
      <option>-M</option> de &man.ancontrol.8;. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.an.4; supporte 
      maintenant Cisco LEAP aussi bien que les clefs WEP. Les utilitaires 
      Aironet Linux sont support&eacute;s sous l'&eacute;mulation. &merged;</para>

      <para arch="i386">Le support g&eacute;n&eacute;rique pour les r&eacute;seaux &agrgave;
       jetons de type ARCNET a &eacute;t&eacute; ajout&eacute;. &merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.bge.4; 
      a &eacute;t&eacute; ajout&eacute; et permet de g&eacute;rer les cartes de la famille
       des controleurs Gigabit Ethernet Broadcom BCM570x, cela inclut les 
       cartes 3Com 3c996-T, SysKonnect SK-9D21 et SK-9D41, et les cartes 
       Gigabit Ethernet des serveurs Dell PowerEdge 2550. Les "jumbo frames", 
       le marquage des VLAN et le controle de sortie "TCP/IP offload" sont 
       support&eacute;s, tout comme la moderation des interruptions.&merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques cm a &eacute;t&eacute; 
      ajout&eacute; et permet de supporter les cartes ARCNET SMC COM90cx6 
      ARCNET. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.dc.4; supporte 
      d&eacute;sormais les cartes &agrgave; base de composants Xircom 3201 et 
      Conexant LANfinity RS7112.</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.dc.4; supporte 
      maintenant les VLAN.</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.de.4; effectue 
      maintenant une arbitration &agrgave; base de "round-robin" entre les 
      r&eacute;ceptions et les transmissions du 21143 &agrgave; la place de donner 
      la priorit&eacute; a l'unit&eacute; de reception. Cela permet de gagner 
      10&ndash;15% de performances lors des gros transferts. &merged;</para>

      <para arch="alpha">Le gestionnaire de p&eacute;riph&eacute;riques &man.ed.4; 
      est support&eacute;.</para>

      <para arch="i386">Les cartes Fast Ethernet Linksys PCCARD support&eacute;s 
      viale gestionnaire de p&eacute;riph&eacute;riques &man.ed.4; n&eacute;cessite 
      maintenant l'ajout du drapeau <literal>0x80000</literal> &agrgave; la 
      ligne de configuration de &man.pccard.conf.5;. Ce drapeau n'est pas 
      optionnel. Les cartes Linksys ne serait pas reconnues sans 
      lui. &merged;</para>

      <para>Un probl&egrave;me avec le gestionnaire de p&eacute;riph&eacute;riques 
      &man.ed.4; qui pouvait r&eacute;sulter en un "panic" du syst&egrave;me avec 
      les tr&egrave;s petits paquets et les BPF ou le pontage activ&eacute; a 
      &eacute;t&eacute; fix&eacute;. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ed.4; supporte 
      maintenant les composants D-Link DL10022 chips, n&eacute;cessaires pour
      certaines cartes dont la carte NetGear FA-410TX. Le gestionnaire 
      <literal>miibus</literal> est maintenant n&eacute;cessaire dans la 
      configuration du noyau pour le gestionnaire de p&eacute;riph&eacute;riques 
      &man.ed.4;. &merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.el.4; 
      peut maintenant etre charg&eacute; en module.</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.em.4; 
      supporte maintenant les cartes bas&eacute;es sur les composants controleurs 
      Gigabit Ethernet Intel 82544, 82542, et 82543. Le gestionnaire supporte
       les "jumbo frames" et les "checksum offload"  en 
       &eacute;mission/r&eacute;ception sur les cartes bas&eacute;es sur les composants 
       82543 et 82544. &merged;</para>

      <para>Le p&eacute;riph&eacute;rique &man.faith.4; est maintenant chargeable, 
      d&eacute;chargeable et clonable. &merged;</para>

      <para arch="i386">Le support des cartes Ethernet Fujitsu 
      MB86960A/MB86965A PC-Cards a &eacute;t&eacute; de nouveau rajout&eacute; au 
      gestionnaire de p&eacute;riph&eacute;riques &man.fe.4;. &merged;</para>

      <para arch="alpha">Le gestionnaire de p&eacute;riph&eacute;riques &man.fpa.4; 
      supporte maintenant les cartes DEFPA FDDI Digital sur les architectures 
      Alpha. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.fxp.4; n&eacute;cessite 
      maintenant l'entr&eacute;e <literal>device miibus</literal> dans le 
      fichier de configuration du noyau. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.fxp.4; contient 
      maintenant un correctif pour la violation de protocole PCI caus&eacute; sur 
      certains syst&egrave;mes bas&eacute;s sur des composants Intel ICH2/ICH2-M. Le
       correctif consiste &agrgave; l&eacute;criture dans l'EEPROM de l'interface a 
       d&eacute;sactiver pour le mode "Dynamic Standby"; une fois l'EEPROM 
       modifi&eacute;e, le syst&egrave;me doit etre red&eacute;marr&eacute; pour que les 
       modifications soient prises en compte. &merged;</para>

       <para>**The &man.fxp.4; driver now supports Intel's loadable
      microcode to implement receive-side interrupt coalescing and
      packet bundling, on NICs that support these features.  This
      support can be activated by the use of the
      <option>link0</option> option to &man.ifconfig.8;. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.gx.4; a &eacute;t&eacute; 
      ajout&eacute; et permet de g&eacute;rer les cartes bas&eacute;es sur les controleurs
       Gigabit Ethernet Intel 82542 et 82543. Les versions fibres et cuivre
       sont support&eacute;es. Les deux cartes supportent  l'insertion de VLAN et
       le taggage de VLAN, les cartes 82543 supportent un plus les "checksum
        offload" TCP/IP. &merged;</para>

      <para>The &man.lge.4; driver has been added to support the Level
      1 LXT1001 NetCellerator Gigabit Ethernet controller chip. This
      device is used on some fiber optic GigE cards from SMC, D-Link
      and Addtron.  Jumbograms and TCP/IP checksum offload on receive
      are supported, although hardware VLAN filtering is not. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.nge.4; a &eacute;t&eacute; ajout&eacute; et supporte
      les cartes PCI Gigabit Ethernet bas&eacute;es sur les controleurs National Semiconductor DP83820
      et DP83821, incluant les controleurs D-Link DGE-500T, SMC EZ Card 1000 (SMC9462TX), Asante
      FriendlyNet GigaNIC 1000TA et 1000TPC et Addtron
      AEG320T. Ce gestionnaire de p&eacute;riph&eacute;riques supporte le d&eacute;chargement des sommes
      de controle en &eacute;mission et en r&eacute;ception. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.pcn.4; a &eacute;t&eacute; ajout&eacute; et supporte 
      les cartes AMD PCnet/FAST, PCnet/FAST+, PCnet/FAST III, PCnet/PRO, 
      PCnet/Home, et HomePNA. Ces cartes sont toujours support&eacute;es par le 
      gestionnaire &man.lnc.4;, le gestionnaire &man.pcn.4; permet de 
      faire fonctionner ces composants en mode 32bits et utilise la fonction
      d'alignement RX pour permettre de recevoir sans effectuer de copie.
      Ce gestionnaire est ind&eacute;pendant de l'architecture, il fonctionne donc
      aussi bien sur I386 que sur Alpha. Le gestionnaire &man.lnc.4; 
      continue a etre n&eacute;cessaire pour les cartes non PCI. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ray.4;, supportant
      les cartes r&eacute;seau sans-fil Webgear Aviator a &eacute;t&eacute; ajout&eacute;. Les 
      op&eacute;ration sur l'interfaces &man.ray.4; s'effectue via 
      &man.raycontrol.8;. &merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques sbni, permettant
      de supporter les interfaces de comunications Granch
      SBNI12,  point a point ISA et PCI a &eacute;t&eacute; ajout&eacute;. Le port 
      <filename role="package">sysutils/sbniconfig</filename> contenu
      dans la collection des ports de &os; peut etre utilis&eacute; pour configurer
      ces p&eacute;riph&eacute;riques.&merged;</para>

      <para>Le support des cartes PCI Ethernet bas&eacute;es sur les controleurs
      SiS 900 et SiS 7016 Fast Ethernet (par exemple, les composants
      se trouvant sur les cartes m&egrave;res SiS 635 and 735), et les composants
      National Semiconductor DP83815 (incluant  NetGear
      FA311-TX et FA312-TX) a &eacute;t&eacute; ajout&eacute; via le gestionnaire de p&eacute;riph&eacute;riques &man.sis.4;.
      Ce gestionnaire supporte les VLANs. &merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques snc pour les controleurs
      de cartes Ethernet National Semiconductor
      DP8393X (SONIC) a &eacute;t&eacute; ajout&eacute;. Actuellement ce gestionnaire est uniquement
      utilis&eacute; sur les architectures PC-98.. &merged;</para>

      <para>Le p&eacute;riph&eacute;rique &man.stf.4; est maintenant clonable.</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.tap.4;, un gestionnaire de
      p&eacute;riph&eacute;riques virtuel Ethernet n&eacute;cessaire pour les configuration en point, a &eacute;t&eacute;
      ajout&eacute;. Ce p&eacute;riph&eacute;rique est clonable.  &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ti.4; supporte maintenant
      les cartes Gigabit Ethernet Alteon AceNIC
      1000baseT et Netgear GA620T 1000baseT . &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ti.4; masque maintenant
      correctement le marquage de VLAN. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.txp.4; a &eacute;t&eacute; ajout&eacute; et supporte
      les cartes bas&eacute;es sur le composant 3Com 3XP Typhoon/Sidewinder (3CR990). &merged;</para>

      <para>Le p&eacute;riph&eacute;rique &man.vlan.4; est maintenant chargeable, d&eacute;chargeable et
      clonable. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.xl.4; supporte maintenant 
      les cartes 3Com 3C556 and 3C556B MiniPCI utilis&eacute;es sur cecrtains
      ordinateurs portables. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.xl.4; supporte maintenant les
      trames de VLAN marqu&eacute;s en r&eacute;ception(sur les cartes a base de composant
       <quote>Cyclone</quote> ou plus r&eacute;cents). &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.xl.4; supporte maintenant
      le d&eacute;chargement des sommes de controles TCP/IP en r&eacute;ception et en &eacute;mission
      sur les cartes impl&eacute;mentant cette fonctionnalit&eacute;, comme les cartes 
       3C905B, 3C905C, et 3C980C. &merged;</para>

      <para>Un probl&egrave;me dans le gestionnaire &man.xl.4;, relatif a un d&eacute;bordement 
      de statistiques lors de la gestion des interruptions, pouvant causer des 
      ralentissements lors de taux de traitements plus ou moins importants de paquets
      , a &eacute;t&eacute; r&eacute;solu. &merged;</para>

      <para>La structure de donn&eacute;es <varname>ifnet</varname> d'une interface, peut
      maintenant indiquer les fonctions support&eacute;es par une carte r&eacute;seau, et 
      lesquelles sont activ&eacute;es.  &man.ifconfig.8; d'obtenir ces informations. &merged;</para>

      <para>Les performances pour les serveurs ayant un grand nombre d'alias
      IP ont &eacute;t&eacute; augment&eacute;es, en remplacant la liste lin&eacute;aire
      <varname>if_inaddr</varname> par un tableau de hashage. &merged;</para>

      <para>Les p&eacute;riph&eacute;riques r&eacute;seaux apparaissent maintenant automatiquement
      comme des fichiers sp&eacute;ciaux dans <filename>/dev/net</filename>. Des
      ioctls mat&eacute;riels su les interfaces ( en excluant le protocol ou 
      le routage) peut etre effectu&eacute; sur ces p&eacute;riph&eacute;riques. L'ioctl
      <varname>SIOCGIFCONF</varname> peut etre effectu&eacute; sur le fichier
      <filename>/dev/network</filename>.</para>

      <para>Certains gestionnaires de p&eacute;riph&eacute;riques impl&eacute;mentent maintenant
      un mode semi-interrogation, qui permet aux syst&egrave;mes d'etre plus robustes
      aux attaques et surcharges. Pour activer l'interrogation, les options suivantes
      sont n&eacute;cessaires dans le fichier de configuration du noyau:

      <programlisting>options DEVICE_POLLING
options HZ=1000 # pas obligatoire, mais fortemment recommand&eacute;</programlisting>

      La variable  sysctl <varname>kern.polling.enable</varname> activera ensuite
	le mode d'interrogation; la variable sysctl <varname>kern.polling.user_frac</varname>
	indiquant le pourcentage de temps CPU &agrgave; reserver dans le mode utilisateur. Les 
	gestionnaires supportant cette fonctionnalit&eacute; sont  &man.dc.4;, &man.fxp.4;, et
	&man.sis.4;.  Plus de d&eacute;tails peuvent etre trouv&eacute; a la page de manuel de &man.polling.4;. &merged;</para>

      <para arch="i386">La perfomance de certains gestionnaires de p&eacute;riph&eacute;riques
      r&eacute;seaux (sp&eacute;cifiquement &man.dc.4; et &man.sis.4;) a &eacute;t&eacute; am&eacute;lior&eacute;e
      par l'&eacute;limination d'inutiles copies de tampons.&merged;</para>

    </sect3>

    <sect3>
      <title>Protocoles r&eacute;seau</title>

      <para>Le fonctionnalit&eacute; noyau &man.accept.filter.9;, permettant de r&eacute;duire
      le temps d'acceptation et de lecture sur les nouvelles connexions sur
      les sockets en attente a &eacute;t&eacute; ajout&eacute;e. &merged;</para>

      <para>La valeur <literal>proxy</literal> de l'option
      <option>-d</option> de &man.arp.8; a &eacute;t&eacute; renomm&eacute; en 
      <literal>pub</literal>, pour la coh&eacute;rence avec l'option
      <option>-s</option>.  Le mot clef <literal>only</literal> a &eacute;t&eacute; 
      ajout&eacute; a l'option <option>-s</option> et l'option
      <option>-S</option>, pour permettre de cr&eacute;er des entr&eacute;es publi&eacute;es
      en <quote>proxy-only</quote>. &merged;</para>

      <para>La fonctionnalit&eacute; de temporisation de lecture de &man.bpf.4; 
      fonctionne maintenant correctement avec &man.select.2;/&man.poll.2;, et
      aussi avec les "pthreads". &merged;</para>

      <para>&man.bridge.4; et &man.dummynet.4; ont recus des am&eacute;liorations
      et des corrections de bogues, et sont maintenant des modules 
      chargeables. &merged;</para>

      <para>&man.bridge.4; a maintenant un support am&eacute;lior&eacute; pour les 
      clusters multi-bridge ind&eacute;pendant et est maintenant plus stable 
      lors de la pr&eacute;sence d'attachements et de d&eacute;tachements dynamique. 
      Les VLANs sont aussi support&eacute;s. &merged;</para>

      <para>Les r&eacute;ponses ICMP ECHO et TSTAMPsont maintenant limit&eacute;es. 
      Les RSTs TCP g&eacute;n&eacute;r&eacute;s du a des ports ouverts et semi-ouverts sont
      maintenant limit&eacute;s par des compteurs s&eacute;par&eacute;s. Chaque taux de file 
      de limitation a maintenant sa propre description.</para>

      <para>Les messages ICMP <literal>UNREACH_FILTER_PROHIB</literal> peuvent
      maintenant r&eacute;-initialis&eacute;s des connexions TCP dans l'&eacute;tat
       <literal>SYN_SENT</literal> si le num&eacute;ro de s&eacute;quence correct est renvoy&eacute;. Cette
       fonctionnalit&eacute; est controll&eacute;e par la variable sysctl
      <varname>net.inet.tcp.icmp_may_rst</varname>
      .</para>

      <para>IP multicast fonctionne mainetant sur les p&eacute;riph&eacute;riques VLAN.  Plusieurs
      autres bogues dans le code des VLAN ont &eacute;t&eacute; corrig&eacute;s.</para>

      <para>&man.ipfw.4; filtre maintenant correctement sur la pr&eacute;sence de bits 
      ECN dans les segments TCP. &merged;</para>

      <para>Un nouveau noeud netgraph &man.ng.eth.4; permet au paquets de type
      Ethernet d'etre filtr&eacute;s sur diff&eacute;rents crit&egrave;res sur les 
      "ethertype".</para>

      <para>Les noeuds netgraph &man.ng.gif.4; et &man.ng.gif.demux.4; 
      op&eacute;rants sur les gestionnaires de p&eacute;riph&eacute;riques &man.gif.4; ont 
      &eacute;t&eacute; ajout&eacute;s.</para>

      <para>Le noeud netgraph &man.ng.ip.input.4;, permettant de cr&eacute;er des
      files d'attentes des paquets IP dans le code d'execution principal
      de la couche IP a &eacute;t&eacute; ajout&eacute;.</para>

      <para>Les type de noeud &man.ng.mppc.4; et &man.ng.bridge.4; ont
      &eacute;t&eacute; ajout&eacute; au sous-syst&egrave;me &man.netgraph.4;. Le noeud &man.ng.ether.4; 
      est maintenant chargeable dynamiquement.  Diff&eacute;rents bogues et am&eacute;liorations
      ont &eacute;t&eacute; effectu&eacute;es. &merged;</para>

      <para>Un nouveau noeud netgraph; &man.ng.one2many.4;, permettant de 
      multiplexer et d&eacute;multiplexer les paquets sur plusieurs liens 
      a &eacute;t&eacute; ajout&eacute;.&merged;</para>

      <para>Une nouvelle variable sysctl 
      <varname>net.inet.ip.check_interface</varname>, activ&eacute;e par d&eacute;faut,
      permet de v&eacute;rifier que le paquet arrivant sur une interface a une 
      addresse correspondante &agrgave; l'addresse de destination du paquet. &merged;</para>

      <para>Une nouvelle variable sysctl
      <varname>net.link.ether.inet.log_arp_wrong_iface</varname> a &eacute;t&eacute; 
      ajout&eacute;e et permet de supprimer le log des requetes ARP lorsque
      le retour d'une paquet ARP arrive sur la mauvaise interface&merged;</para>

      <para>Une nouvelle option noyau <literal>options RANDOM_IP_ID</literal> 
      permet au champ ID des paquets IP d'etre al&eacute;atoire. Cela 
      permet d'empecher a un observateur distant de calculer a quelle
      vitesse la machine g&eacute;n&egrave;re des paquets. Pr&eacute;c&eacute;demment a chaque paquet
      un compteur &eacute;tait incr&eacute;menter.&merged;</para>

      <para arch="alpha">SLIP a &eacute;t&eacute; retir&eacute; de l'image disquette
      <filename>mfsroot</filename>.</para>

      <para>TCP a recu diff&eacute;rentes corrections de bogues pour 
      les ACK retard&eacute;s. &merged;</para>

      <para>TCP supporte maintenant la modification "NewReno" sur l'algorithme
      " TCP Fast Recovery".  Cette fonctionnalit&eacute; est controlable via la variable
      sysctl<varname>net.inet.tcp.newreno</varname>. &merged;</para>

      <para>TCP utilise maintenant une minuterie plus agressive pour les
      SYN initiaux; cela permet de dropper de façon plus rapide les
      tentatives de connexions. &merged;</para>

      <para>L'option noyau <literal>TCP_COMPAT_42</literal> 
      a &eacute;t&eacute; retir&eacute;e. &merged;</para>

      <para>L'option noyau <literal>TCP_RESTRICT_RST</literal> a &eacute;t&eacute; 
      retir&eacute;e. Une fonctionnalit&eacute; similaire peut etre trouv&eacute;e via la 
      variable sysctl <varname>net.inet.tcp.blackhole</varname>. &merged;</para>

      <para>Les extensions du RFC 1323 de TCP sont maintenant 
      activ&eacute;es par defaut dans &man.rc.conf.5;. &merged;</para>

      <para>Les extensions des RFC 1323 et TFC 1644 de TCP sont 
      maintenant d&eacute;sactiv&eacute;es si aucune r&eacute;ponse au 3eme SYN envoy&eacute;
      n'est reçue lors d'une demande de connexion. Cette fonctionnalit&eacute;
      permet de travailler avec les (tres vieux) serveurs de terminaux
      ayant une impl&eacute;mentation de l'entete VJ de compression boggu&eacute;. &merged;</para>

      <para>L'impl&eacute;mentation TCP de n&eacute;cessite plus l'allocation d'une strructure
      TCP pour chaque connexion; cela permet de r&eacute;duire le nombre de tampons
      utilis&eacute;s sur des syst&egrave;mes ayant &eacute;norm&eacute;ment de connexions. &merged;</para>


      <para>La taille des tampons TCP par d&eacute;faut, controll&eacute;e par les 
      variables sysctl
      <varname>net.inet.tcp.sendspace</varname> et 
      <varname>net.inet.tcp.recvspace</varname>, a &eacute;t&eacute; augment&eacute;e 
      respectivement &agrgave; 32K et 64K. Pr&eacute;cedemment cette valeur
      &eacute;tait de 16K pour chaque tampon. Pour essayer d'&eacute;viter 
      l'augmentation de la congestion, la valeur par d&eacute;faut de 
      <varname>net.inet.tcp.local_slowstart_flightsize</varname> 
      a &eacute;t&eacute; chang&eacute;e de l'infini a 4. &merged;
        <note>
	  <para>Sur des machines tr&egrave;s charg&eacute;es, la nouvelle valeur de
	  la taille des tampons peut n&eacute;cessiter une augmentation manuelle 
	  du param&egrave;tre <varname>NMBCLUSTERS</varname>, soit dans
	  le fichier de configuration du noyau, ou via la 
	  variable <varname>kern.ipc.nmbclusters</varname>.
	  <command>netstat -mb</command> permet de monitorer 
	  l'etat des clusters mbuf.</para>
	</note>
      </para>

      <para>TCP supporte maintenant le RFC 1948(Defending Against Sequence
      Number Attacks). Cette fonctionnalit&eacute; est controlable via
      les variables sysctl <varname>net.inet.tcp.strict_rfc1948</varname> 
      et <varname>net.inet.tcp.isn_reseed_interval</varname>. &merged;</para>

      <para>L'impl&eacute;mentation TCP de &os; comporte maintenant
      un cache en r&eacute;ception des segments SYN. L'arriv&eacute; d'un segment
      SYN ajoute alors une entr&eacute;e dans le cache en attendant la fin
      de la s&eacute;quence d'initialisation des 3 &eacute;tats TCP, a chaque point
      la m&eacute;moire est allou&eacute; comme auparavant. En plus touts les
      num&eacute;ros de s&eacute;quences initiale TCP (ISN) sont utilis&eacute;s comme
      "cookies", permettant a chaque entr&eacute;e du cache d'etre d&eacute;truite, 
      tout en ayant leur ACK correspondant accept&eacute; plus tard. La 
      combinaison de ces fonctionnalit&eacute;s appel&eacute;es 
      <quote>syncache</quote> et <quote>syncookies</quote> permet
      a une machine d'etre plus resistante aux attaques par d&eacute;ni
      de services TCP. Cette fonctionnalit&eacute; est fournie grace
      au sponsor du DARPA et NAI Labs. &merged;</para>

      <para>Un bogue dans l'impl&eacute;mentation TCP, 
      figeant une connexion si l'emetteur fixait une
      fenetre de zero, a &eacute;t&eacute; corrig&eacute;.. &merged;</para>
    </sect3>

    <sect3>
      <title>Disques et Stockage</title>

      <para arch="i386">Le support des cartes de la famille Adaptec FSA 
      des contrtoleurs RAID PCI-SCSI a &eacute;t&eacute; ajout&eacute; sous la forme du 
      gestionnaire de p&eacute;riph&eacute;riques &man.aac.4;. Ce gestionnaire
      g&eacute;re correctement les commandes suivantes initi&eacute;es par la carte, 
      ajout/retrait des disques, la fonction de "crashdump" et les
      commandes &man.ioctl.2; n&eacute;cessaires pour la gestion CLI. Ce 
      gestionnaire a &eacute;t&eacute; v&eacute;rifi&eacute; par Adaptec.&merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ahc.4; a reçu
      de nombreuses modifications, corrections de bogues et am&eacute;liorations.
      Parmi les diff&eacute;rentes am&eacute;liorations il dispose d'une meilleur
      compatibilit&eacute; avec les puces en mode <quote>RAID Port</quote>
      et les syst&egrave;mes comportant des cartes AAA et/ou ARO, et 
      des am&eacute;liorations de la performance. Des bogues ont &eacute;t&eacute; fix&eacute;s,
      comme celui qui figeait les controleurs Ultra2/U160. &merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.asr.4;
      permettant de supporter les cartes controleurs Adaptec SCSI RAID
      et les familles DPT SmartRAID V et VI, a &eacute;t&eacute; ajout&eacute;.&merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.asr.4; 
      supporte maintenant les controleurs RAID  Adaptec 2000S et
      2005S Zero-Channel. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ata.4; supporte maintenant
      les controleurs ATA100. En plus il supporte maintenant
      les puces ServerWorks ROSB4 ATA33, CMD 648 ATA66 et CMD 649 ATA100
      et Cyrix 5530. &merged;</para>

      <para>Pour une configuration plus fexible, les diff&eacute;rentes options
      du gestionnaire &man.ata.4; sont maintenant modifiables via
      le gestionnaire de d&eacute;marrage, plutot que au niveau du fichier
      de configuration du noyau.&merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ata.4; supporte 
      maintenant le m&eacute;canisme de marquage de file, qui est activable
      via la variable de d&eacute;marrage <varname>hw.ata.tags</varname>. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ata.4; supporte 
      maintenant les <quote>pseudo</quote> controleurs RAID ATA comme
      les controleurs Promise Fasttrak et  HighPoint HPT370.&merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ata.4; supporte maintenant
      un grand nombre de puces SiS, list&eacute; dans les Notes Mat&eacute;rielles. &merged;</para>

      <para>La fonctionnalit&eacute; BurnProof(TM), disponible sur les
      graveurs de CDROM ATAPI et maintenant disponible.&merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ata.4; supporte 
      dispose du support d'adressage 48-bit. Les p&eacute;riph&eacute;riques
      de plus de 137GB sont maintenant support&eacute;s. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ata.4; est maintenant
      corrig&eacute; pour les syst&egrave;mes utilisant les puces VIA 82C686B Southbridge,
      qui entrainait une corruption des donn&eacute;es. &merged;</para>

      <para>Les erreurs de r&eacute;cup&eacute;ration CAM ont &eacute;t&eacute; mises &agrgave; jour.</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.cd.4; supporte maintenant
      les &eacute;critures. Cela permet d'&eacute;crire sur les DVD-RAM, PD et 
      d'autres lecteurs qui sont signal&eacute;s comme des p&eacute;riph&eacute;riques CD.
      Notez que cette modification affecte uniquement les p&eacute;riph&eacute;riques
      a acc&egrave;s en &eacute;criture al&eacute;atoire, et pas les p&eacute;riph&eacute;riques a acc&egrave;s
      en &eacute;criture s&eacute;quentielle comme les lecteurs CD-R, qui sont eux 
      support&eacute;s par &man.cdrecord.1; (via 
      <filename role="package">sysutils/cdrtools</filename> de la 
      collection des Ports. &merged;</para>

      <para arch="i386">Le gestionnaire ciss, pour les p&eacute;riph&eacute;riques
      utilisant l'interface standard d'acc&egrave;s SCSI-3, a &eacute;t&eacute; ajout&eacute;. Le
      gestionnaire supporte la famille des controleurs RAID Compaq 
      SmartRAID 5* (5300, 532, 5i)&merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques de disquette &man.fdc.4; a
      subit de nombreuses am&eacute;liorations. La s&eacute;lection de la densit&eacute;
      est maintenant automatique; le gestionnaire est aussi plus
      souple sur la selection de la densit&eacute; de diff&eacute;rents sous-
      p&eacute;riph&eacute;riques.</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques de disque ida, supporte
      maintenant la focntion de "crashdump". &merged;</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques iir a &eacute;t&eacute; ajout&eacute;
      pour supporter les controleurs RAID int&eacute;gr&eacute;s d'Intel, et les controleurs
      Vortex ICP.</para>

      <para arch="alpha">Le bogue qui ne permettait pas
      d'attacher certains lecteurs de CDROM lorsqu'ils &eacute;taient
      connect&eacute;s sur une carte SCSI g&eacute;r&eacute;e par &man.isp.4; a &eacute;t&eacute;
      corrig&eacute;.. &merged;</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.isp.4; permet
      maintenant de d&eacute;couvrir de façon pro-active les 
      changements de  topologie Fibre Channel.</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.isp.4; supporte
       maintenant le mode cible pour les cartes SCSI Qlogic, dont
       les cartes Ultra2 et Ultra3 et les cartes double bus..</para>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.isp.4; supporte 
      maintenant les cartes PCI Qlogic 2300 et 2312 Fibre 
      Channel.&merged;</para>

      <para>&man.md.4;, le gestionnaire de p&eacute;riph&eacute;riques de disque
      m&eacute;moire, comporte maintenant les fonctionnalit&eacute;s de &man.vn.4;
      Les p&eacute;riph&eacute;riques &man.md.4; peuvent maintenant etre configur&eacute;s
      via &man.mdconfig.8;. &man.vn.4; a &eacute;t&eacute; retir&eacute;. Le syst&egrave;me
      de fichiers m&eacute;moire (MFS) a &eacute;t&eacute; retir&eacute; aussi..</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.mly.4; 
      pour les controleurs  Mylex PCI to SCSI
      AccelRAID et eXtremeRAID comportant un micro-code 6.X ou sup&eacute;rieur
      a &eacute;t&eacute; ajout&eacute;. &merged;</para>

      <para arch="i386">Les gestionnaires de p&eacute;riph&eacute;riques ncv, nsp et stg ont 
      &eacute;t&eacute; port&eacute;s depuis le code NetBSD/pc98. Ils supportent les cartes controleurs
      NCR 53C50 /Workbit Ninja SCSI-3 / TMC 18C30, et les cartes bas&eacute;es sur les
      controleurs 18C50 PC-Card/ISA SCSI. Ces trois gestionnaires peuvent etre
      compil&eacute;s et charg&eacute;s en modules. &merged;</para>

      <para>Diff&eacute;rents probl&egrave;mes dans la gestion des erreurs de  &man.sa.4; 
      ont &eacute;t&eacute; corrig&eacute;s, de meme que le probl&egrave;me <quote>tape drive spinning indefinitely
      upon &man.mt.1; <option>stat</option></quote> .</para>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.twe.4; 
      3ware ATA RAID a &eacute;t&eacute; ajout&eacute;. &merged;</para>

      <para>Le gestionnaire de volume &man.vinum.4; a reçu des corrections de bogues
      et des am&eacute;liorations.</para>

      <para>La compatibilit&eacute; des gestionnaires de p&eacute;riph&eacute;riques &man.wd.4; a &eacute;t&eacute; retir&eacute;e
      des gestionnaires de p&eacute;riph&eacute;riques &man.ata.4;. &merged;</para>


      <para></para>
    </sect3>

    <sect3>
      <title>Syst&egrave;mes de fichier</title>

      <para>Le support des attributs &eacute;tendus a &eacute;t&eacute; ajout&eacute; au noyau
      de &os; Cela permet au noyau, et certains processus utilisateurs
      privil&eacute;gi&eacute;s, de marqu&eacute; des fichiers et des r&eacute;pertoires avec
      des donn&eacute;es suppl&eacute;mentaires. Les attributs &eacute;tendus ont &eacute;t&eacute; ajout&eacute;s
      pour supporter le projet TrustedBSD, en particulier les ACL, 
      l'acc&egrave;s via des jetons (voyez le fichier 
      <filename>/usr/src/sys/ufs/ufs/README.extattr</filename> pour
      plus de d&eacute;tails).</para>

      <para>Suite a un changement dans sa license, les "softupdates"
      ont &eacute;t&eacute; int&eacute;gr&eacute;s dans la portion principale des sources
      du noyau. Cela a pour cons&eacute;quence de permettre aux
      "softupdates" de pouvoir etre disponible dans le 
      noyau <filename>GENERIC</filename>. &merged;</para>

      <para>La capacit&eacute; d'effectuer un snapshot a &eacute;t&eacute; ajout&eacute; a FFS.
      Plus de d&eacute;tails peuvent etre trouv&eacute; dans le fichier 
      <filename>/usr/src/sys/ufs/ffs/README.snapshot</filename>.</para>

      <para>Les "softupdates" pour FFS ont reçus de nombreux
      correctifs et am&eacute;liorations.</para>

      <para>Lors de l'utilisation des "softupdates" et &man.statfs.2;,
      &man.df.1; affiche le nombre de blocs et de fichiers qui sont
      pret a etre nettoy&eacute;s.</para>

      <para>Le bogue dans FFS corrompant les superblock sur de grands
      syst&egrave;mes de fichier a &eacute;t&eacute; corrig&eacute;.&merged;</para>

      <para>Le syst&egrave;me de fichier Inode (IFS) a &eacute;t&eacute; ajout&eacute;; plus
      d'informations sont disponible dans le fichier
      <filename>/usr/src/sys/ufs/ifs/README</filename>.</para>

      <para>Le syst&egrave;me de fichiers ISO-9660 dispose maintenant
      d'une routine chargeable a la demande de convertion de
      caract&egrave;res. Le port <filename role="package">sysutils/cd9660_unicode</filename>
      comporte un ensemble de base de conversions.</para>

      <para>&man.kernfs.5; est obsol&egrave;te et a &eacute;t&eacute; retir&eacute;.</para>

      <para>Un bogue dans le client NFS causant un temps d'acc&egrave;s faux
      sur les fichiers ouverts par <literal>O_EXCL|O_CREAT</literal>
      a &eacute;t&eacute; corrig&eacute; &merged;</para>

      <para>Une nouvelle fonction de hashage NFS (bas&eacute; sur l'algorithme
      de hashage Fowler/Noll/Vo) a &eacute;t&eacute; impl&eacute;ment&eacute;e et am&eacute;liore les
      performances NFS en augmentant l'efficience des tables de hashage
      de <varname>nfsnode</varname>. &merged;</para>

      <para>Les locks NFS cot&eacute; client on &eacute;t&eacute; impl&eacute;ment&eacute;s.</para>

      <para>Le code NFS cot&eacute; client et serveur dans le noyau 
      a &eacute;t&eacute; crois&eacute; de mani&egrave;re complexe. Ils ont &eacute;t&eacute; s&eacute;par&eacute;s
      pour une meilleure maintenance et de futurs d&eacute;veloppements..</para>

      <para>Le support des listes de controle d'acc&egrave;s (ACLs) sur
      le syst&egrave;me de fichiers a &eacute;t&eacute; introduit, permettant de controler
      de façon plus fine l'acc&egrave;s aux fichiers et r&eacute;pertoires. Ce support
      vient du projet TrustedBSD. Plus de d&eacute;tails sont disponibles
      dans le fichier
      <filename>/usr/src/sys/ufs/ufs/README.acls</filename>.</para>

      <para>L'algorithme pr&eacute;f&eacute;r&eacute; de sch&eacute;ma des r&eacute;pertoires pour FFS
       (<literal>dirprefs</literal>) a chang&eacute;. Plutot que de couper
       les blocs de r&eacute;pertoires a travers un disque, il essaie
       de grgouper les blocs de r&eacute;pertoire ensemble. Les op&eacute;rations
       de travers&eacute; de larges structures de r&eacute;pertoire, comme les ports
       de &os;, a d&eacute;montr&eacute; plus de rapidit&eacute;. Ce changement est
       transparent et automatique pour les nouveaux r&eacute;pertoires. &merged;</para>

      <para arch="i386">Le support de smbfs(CIFS) a &eacute;t&eacute; ajout&eacute; au noyau. Les
      programmes utilisateurs &man.smbutil.1; et &man.mount.smbfs.8; 
      peuvent etre utilis&eacute;s pour se servir des partages SMB. Notez que
      &man.mount.smbfs.8; charge automatiquement le module <filename>smbfs.ko</filename>
      dans le noyau, meme si <literal>LIBMCHAIN</literal> et 
      <literal>LIBICONV</literal> ne sont pas compil&eacute; dans le noyau.
      &merged;</para>

      <para>Pour rester coh&eacute;rent les syst&egrave;mes de fichiers 
      fdesc, fifo, null, msdos, portal, umap et union ont
      &eacute;t&eacute; renomm&eacute;s en fdescfs, fifofs, msdosfs, nullfs, portalfs, 
      umapfs, et unionfs. Les modules et programmes mount_* possibles
      ont &eacute;t&eacute; aussi renomm&eacute;s. La compatiblit&eacute; avec l'entr&eacute;e du syst&egrave;me
      de fichiers <literal>msdos</literal> dans &man.fstab.5; a &eacute;t&eacute;
      ajout&eacute;e a  &man.mount.8; permettant de fonctionner sans changement.</para>

      <para>pseudofs, un canevas pour des pseudo-syst&egrave;mes de fichiers, 
      a &eacute;t&eacute; ajout&eacute;. &man.linprocfs.5; et &man.procfs.5; ont &eacute;t&eacute; modifi&eacute;s
      pour permettre l'utilisation de pseudofs.</para>

      <para>Une optimisation tr&egrave;s simple sur la recherche de hashage
      de gros r&eacute;pertoires, appel&eacute; <literal>dirhash</literal>, a &eacute;t&eacute; ajout&eacute;.
      Conditionn&eacute; par l'option noyau <literal>UFS_DIRHASH</literal> 
      (activ&eacute; par d&eacute;faut dans le noyau <filename>GENERIC</filename>), 
      permet d'augmenter la rapidit&eacute; de traitement dans les gros
      r&eacute;pertoires tout en consommant un peu plus de m&eacute;moire. &merged;</para>

      <para>Le sous-syst&egrave;me de m&eacute;moire virtuel supporte maintenant
      les n&eacute;cessit&eacute;s m&eacute;moire des r&eacute;pertoires UFS par d&eacute;faut (cette fonction
      est controler via la variable sysctl 
      <varname>vfs.vmiodirenable</varname>). &merged;</para>

      <para>Un bogue emp&eacute;chant le montage du syst&egrave;me de
      fichier "root" depuis un CDROM SCSI a &eacute;t&eacute; corrig&eacute; (les
      CDROM ATAPI ont toujours &eacute;t&eacute; support&eacute;s). &merged;</para>

      <para>Des bogues dans le code des syst&egrave;mes
      de fichiers, d&eacute;couvert en utilisant l'utilitaire
      <application>fsx</application>de test des syst&egrave;mes de fichiers,
      ont &eacute;t&eacute; corrig&eacute;s. Dans certaines cas (principalement lors de 
      l'utilisation de NFS) certains bogues causaient la corruption
      des donn&eacute;es ou des paniques du noyau. &merged;</para>

      <para>Les syst&egrave;mes de fichiers r&eacute;seaux (comme NFS et smbfs) list&eacute;s
      dans le fichier <filename>/etc/fstab</filename> peuvent 
      maintenant etre mont&eacute;s au moment de l'initialisation du syst&egrave;me;
      le montage est alors suspendu jusqu'&agrgave; l'initialisation finale
      du r&eacute;seau.</para>

    </sect3>

    <sect3>
      <title>Support PCCARD</title>

      <para arch="i386">Le gestionnaires de p&eacute;riph&eacute;riques pccard et 
      &man.pccardc.8; supporte maintenant diff&eacute;rents 
      <quote>types de sons</quote> lors de l'insertion et l'ejection
      des cartes&merged;</para>

      <para>Sur les machines modernes, les p&eacute;riph&eacute;riques PCCARD peuvent 
      etre configur&eacute;s pour envoyer indiff&eacute;remment leurs interruptions 
      via les interruptions PCI ou ISA. Le gestionnaire de p&eacute;riph&eacute;riques
       &man.pcic.4; a &eacute;t&eacute; modifi&eacute; pour supporter ces deux modes 
       d'interruptions (pr&eacute;cedemment juste le mode ISA &eacute;tait support&eacute;).
       &merged; Dans la plupart des cas, la configuration des p&eacute;riph&eacute;riques
       PCMCIA sur des ordinateurs portables est simplifi&eacute; et plus
       flexible. De plus, plus de ponts de cartes PCI Cardbus (
       comme ceux utilis&eacute;s par les cartes Orinoco PCI) sont support&eacute;s.
       Certaines machines peuvent poser des probl&egrave;mes, comme des paniques ou
       des arrets, avec le routage des interruptions PCI; elles peuvent
       la plupart du temps fonctionner en forçant l'ancien mode
       de routage des interruptions via le bus ISA. Les lignes suivantes
       plac&eacute;es dans  le fichier <filename>/boot/loader.conf</filename>,
       permettent de r&eacute;soudre ce probl&egrave;me:</para>

      <programlisting>hw.pcic.intr_path="1"
  hw.pcic.irq="0"</programlisting>

      <para>Lors de l'installation de &os;, taper les lignes suivantes
       au moment du prompt du gestionnaire de d&eacute;marrage peut
       etre tr&egrave;s utile pour d&eacute;marrer pour la premi&egrave;re fois &os :</para>

      <screen><prompt>ok</prompt> <userinput>set hw.pcic.intr_path="1"</userinput>
      <prompt>ok</prompt> <userinput>set hw.pcic.irq="0"</userinput></screen>

      <para arch="i386">Le support pr&eacute;liminaire de Cardbus sous NEWCARD
      a &eacute;t&eacute; ajout&eacute;. Ce code supporte les cartes TI113X, TI12XX, TI125X, 
      Ricoh 5C46/5C47, Topic 95/97/100 et Cirrus Logic PD683X. Le
      support 16-bit PC Card n'est pas encore fonctionnel.</para>
    </sect3>

    <sect3>
      <title>Support Multim&eacute;dia</title>

      <para arch="i386">Le gestionnaire de p&eacute;riph&eacute;riques &man.pcm.4;
      supporte maintenant les cartes sons ESS Solo 1,
      Maestro-1, Maestro-2, et Maestro-2e; Forte Media fm801, ESS
      Maestro-2e, et VIA Technologies VT82C686A, et a reçu
      de nombreuses modifications. Des gestionnaires s&eacute;par&eacute;s pour
      les cartes SoundBlaster 8 et SoundBlaster 16 remplacent l'ancien
      gestionnaire unifi&eacute;. Un gestionnaire pour les cartes CMedia
      CMI8338/CMI8738 a &eacute;t&eacute; ajout&eacute;. Un gestionnaire pour les cartes
      a base de S3 SonicVibes a &eacute;t&eacute; ajout&eacute;.&merged;</para>

      <para arch="i386">Un gestionnaire de p&eacute;riph&eacute;riques pour les
      cartes Avance Logic ALS4000 a &eacute;t&eacute; ajout&eacute;.. &merged;</para>

      <para arch="i386">Un gestionnaire de p&eacute;riph&eacute;riques pour les cartes 
      ESS Maestro-3/Allegro a &eacute;t&eacute; ajout&eacute;, mais suite a des restrrictions
      sur la license, il ne peut etre compil&eacute; dans le noyau. &merged;
      Pour utiliser ce gestionnaire, ajoutez la ligne suivante au fichier 
      <filename>/boot/loader.conf</filename>:</para>

      <programlisting>snd_maestro3_load="YES"</programlisting>

      <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.bktr.4; a &eacute;t&eacute; mis
      &agrgave; jour en version 2.18. Cette mise &agrgave; jour fournit de nombreuses
      nouvelles fonctionnalit&eacute;s. De nouveaux types de tuner ont &eacute;t&eacute;
      jout&eacute;s et des am&eacute;liorations dans les modules KLD et l'allocation
      m&eacute;moire ont &eacute;t&eacute; effectu&eacute;s. Des bogues dans &man.devfs.5;
      lors du chargement et d&eacute;chargement ont &eacute;t&eacute; corrig&eacute;s. Le support
      pour les nouvelles cartes Hauppauge Model 44xxx WinTV a &eacute;t&eacute; 
      ajout&eacute;. &merged;</para>

      <para>Lorsque les modules sons sont compil&eacute;s, un seul suffit
      a charger tous les gestionnaires et l'infrastructure
      par la commande  <command>kldload snd</command>. &merged;</para>

      <para>Une nouvelle API a &eacute;t&eacute; ajout&eacute;e pour les cartes sons
      ayant un controleur de volume mat&eacute;riel.</para>

      <para arch="i386">Un gestionnaire de p&eacute;riph&eacute;riques pour
      les cartes sons int&eacute;gr&eacute;es Intel 443MX, 810, 815, et 815E
      a &eacute;t&eacute; ajout&eacute;.</para>


    </sect3>

    <sect3>
      <title>Logiciels externes</title>
      <para></para>

      <para>Le language de commande inspir&eacute; sur Forth
      (<application>FICL</application>) du gestionnaire de 
      d&eacute;marrage a &eacute;t&eacute; mis &agrgave; jour en version 2.05.</para>

      <para>Le supporte pour la configuration avanc&eacute;e de gestion
      d'&eacute;nergie  (ACPI), un standard multi-constructeurs sur 
      la gestion d'&eacute;nergie, a &eacute;t&eacute; ajout&eacute;. Cette fonctionnalit&eacute;
      est fourni&eacute; par le projet <application>Intel ACPI Component
      Architecture</application>, depuis le snapshot ACPI CA
      20020214. Une certaine compatibilit&eacute; pour les applications
      utilisant l'ancien standard APM est fourni.</para>

      <sect4>
        <title>IPFilter</title>

	<para><application>IPFilter</application> a &eacute;t&eacute; mis a jour en version
	3.4.20. &merged;</para>

	<para><application>IPFilter</application> supporte maintenant
	IPv6. &merged;</para>

      </sect4>

      <sect4 arch="i386">
        <title>isdn4bsd</title>

	<para><application>isdn4bsd</application> a &eacute;t&eacute; mis &agrgave; jour 
	en version 1.0.1. Ceci <emphasis>oblige</emphasis> les
	 utilisateurs du gestionnaire de p&eacute;riph&eacute;riques 
	 &man.i4bisppp.4; (PPP noyau sur ISDN) &agrgave; utiliser 
	 &man.ispppcontrol.8; au lieu de &man.spppcontrol.8; pour
	 configurer et controler leurs interfaces r&eacute;seaux. &merged;</para>

	<para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ifpi.4; permettant
	le support des cartes AVM Fritz!Card PCI version 2 a &eacute;t&eacute;
	ajout&eacute;.</para>

	<para>Le gestionnaire de p&eacute;riph&eacute;riques &man.ihfc.4; permettant
	la gestion des p&eacute;riph&eacute;riques Cologne Chip Designs HFC sous 
	<application>isdn4bsd</application> a &eacute;t&eacute; ajout&eacute;. &merged;</para>

        <para>Le gestionnaire de p&eacute;riph&eacute;riques &man.itjc.4; permettant
	la gestion des p&eacute;riph&eacute;riques NETjet-S / Teles PCI-TJ sous 
	<application>isdn4bsd</application> a &eacute;t&eacute; ajout&eacute;. &merged;</para>

        <para>Le support exp&eacute;rimental des cartes Eicon.Diehl DIVA 2.0 et
	 2.02 ISA PnP ISDN a &eacute;t&eacute; ajout&eacute; au via le gestionnaire
	 de p&eacute;riph&eacute;riques &man.isic.4; de 
	 <application>isdn4bsd</application> . &merged;</para>


	<para>Le gestionnaire de p&eacute;riph&eacute;riques &man.isic.4; supporte
	les cartes Compaq Microcom 610 ISDN ISA PnP. &merged;</para>

	<para>Les cartes ISDN bas&eacute;es sur Active CAPI fabriqu&eacute;es par
	 AVM sont maintenant support&eacute;es par les gestionnaires
	 de p&eacute;riph&eacute;riques &man.i4bcapi.4; et &man.iavc.4;. Les cartes
	 support&eacute;es sont les cartes AVM B1 PCI et AVM B1 ISA Basic Rate
	 et AVM T1 Primary Rate.&merged;</para>

	<para>Un nouveau mot clef,<literal>maxconnecttime</literal>, est
	accept&eacute; dans le fichier &man.isdnd.rc.5; et permet de
	limiter le temps maximum ou une connexion peut rester 
	ouverte. &merged;</para>

	<para>&man.isdnphone.8; supporte maintenant l'option
	 <option>-k</option> pour envoyer des messages via le clavier
	 num&eacute;rique d'un PABX &merged;</para>
      </sect4>

      <sect4 id="kame-kernel">
        <title>KAME</title>

        <para>La couche IPv6 est maintenant bas&eacute;e sur la snapshot
	du projet KAME IPv6 en date du 28 Mai 2001. La plupart
	des ajouts de cette section r&eacute;sultent de cet import. La 
	<xref linkend="kame-userland"> liste les modifications
	dans les programmes utilisateurs de la couche 
	KAME IPv6 . &merged;</para>

        <para>&man.gif.4; est maintenant bas&eacute; sur le RFC 2893 et non plus 
	sur le RFC 1933. Le drapeau d'interface <literal>IFF_LINK2</literal>
	permet de controler le fitrage.&merged;</para>

	<para><application>IPSec</application> a reçu de nombreuses
	am&eacute;liorations, comme la capacit&eacute; d'utiliser les algorithmes
	SHA2 et Rijndael. Le support de IPSec RC5 a &eacute;t&eacute; retir&eacute; du
	a des probl&egrave;mes de license. &merged;</para>

	<para>&man.stf.4; est maintenant conforme au RFC 3056; le 
	drapeau d'interface <literal>IFF_LINK2</literal> 
	permet de controler le fitrage.&merged;</para>

	<para>IPv6 v&eacute;rifie mieux les adresses ill&eacute;gales (comme
	l'adresse de bouclage) sur les r&eacute;seaux physique. &merged;</para>

	<para>L'option socket <varname>IPV6_V6ONLY</varname> est 
	maintenant completement support&eacute;. La façon dont le noyau
	respecte cette option est controler par la variable
	sysctl <varname>net.inet6.ip6.v6only</varname>. &merged;</para>

	<para>Le RFC 3041 (Privacy Extensions for Stateless Address
	Autoconfiguration) est support&eacute;. Il peut etre activ&eacute; par la 
	variable sysctl <varname>net.inet6.ip6.use_tempaddr</varname>.
	 &merged;</para>

   </sect3>
  </sect2>
  <sect2 id="security">
    <title>Changements li&eacute;s a la s&eacute;curit&eacute;</title>

    <para>&man.sysinstall.8; permet maintenant a un utilisateur de choisir
    un des deux <quote>profils de s&eacute;curit&eacute;</quote> au moment de l'installation
    Ces profils activent ou d&eacute;sactivent alors diff&eacute;rents services via
    le fichier de configuration &man.rc.conf.5; lors de nouvelles 
    installations. &merged;</para>

    <para>Un bogue qui fixait le syst&egrave;me pour des images ELF ex&eacute;cutables 
    malform&eacute;es a &eacute;t&eacute; r&eacute;solu (voir l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-00:41). &merged;</para>

    <para>Un trou de s&eacute;curit&eacute; dans l'&eacute;mulation Linux a &eacute;t&eacute; corrig&eacute; (voir
    l'avis de s&eacute;curit&eacute;FreeBSD-SA-00:42). &merged;</para>

    <para>Les appels a la librairie de traitement des chaines
    ont &eacute;t&eacute; corrig&eacute;s dans beaucoups de programmes, pour r&eacute;duire
    la possiblit&eacute; d'exploitation des d&eacute;passements de tampons.
    &merged;</para>

    <para>TCP utilise maintenant une fonction plus al&eacute;atoire pour
    le choix du nombre initial lors de l'initialisation de la 
    s&eacute;quence (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-00:52). &merged;</para>

    <para>Diff&eacute;rents d&eacute;passements de tampons dans &man.tcpdump.1; ont &eacute;t&eacute;
    corrig&eacute;s (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-00:61). &merged;</para>

    <para>Le trou de s&eacute;curit&eacute; de &man.top.1; a &eacute;t&eacute; corrig&eacute;
    (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-00:62). &merged;</para>

    <para>Un potentiel trou de s&eacute;curit&eacute; du a une erreur potentielle
    dans &man.gethostbyname.3; a &eacute;t&eacute; corrig&eacute; (voir l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-00:63). &merged;</para>

    <para>Un potentiel d&eacute;passement de tampon dans la libraire
    &man.ncurses.3; permettant l'execution de programme 
    via &man.systat.1; a &eacute;t&eacute; corrig&eacute;(voir l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-00:68). &merged;</para>

    <para>La vuln&eacute;rabilit&eacute; de &man.telnetd.8; causant
    une consommation importante de ressources du serveur 
    a &eacute;t&eacute; corrig&eacute;e (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-00:69). &merged;</para>

    <para>La commande <literal>nat deny_incoming</literal> de
    &man.ppp.8; fonctionne maintenant correctement (voir l'avis
    de s&eacute;curit&eacute; FreeBSD-SA-00:70). &merged;</para>

    <para>La vuln&eacute;rabilit&eacute; dans les fichiers temporaires cr&eacute;&eacute;s par
    &man.csh.1;/&man.tcsh.1; permettant d'&eacute;craser certains fichiers 
    utilisateurs a &eacute;t&eacute; corrig&eacute;e (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-00:76). &merged;</para>

    <para>Le binaire &man.ssh.1; n'est plus SUID root par d&eacute;faut. &merged;</para>

    <para>Diff&eacute;rentes corrections ont &eacute;t&eacute; apport&eacute;es &agrgave; l'impl&eacute;mentation
    de Kerberos IV relatives a des variables d'environnements, un
    possible d&eacute;passent de tampon, et l'&eacute;crasement de fichiers de 
    tickets. &merged;</para>

    <para>&man.telnet.1; nettoie maintenant mieux son environnement.&merged;</para>

    <para>Diff&eacute;rentes vuln&eacute;rabilit&eacute;s dans &man.procfs.5; ont &eacute;t&eacute; 
    corrig&eacute;es (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-00:77). &merged;</para>

    <para>Un bogue dans <application>OpenSSH</application> dans
    lesquel un serveur n'etait pas capable de d&eacute;sactiv&eacute; &man.ssh-agent.1;
    ou <literal>X11Forwarding</literal> a &eacute;t&eacute; corrig&eacute; (voir l'avis
    de s&eacute;curit&eacute; FreeBSD-SA-01:01). &merged;</para>

    <para>Un bogue dans &man.ipfw.8; et &man.ip6fw.8; traitant 
    des segments TCP entrants comme des connexions <literal>&eacute;tablies</literal>
    a &eacute;t&eacute; corrig&eacute; (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:08). &merged;</para>
 
    <para>Un bogue dans &man.crontab.1; permettant a un utilisateur
    de lire n'importe quel fichier en ayant une syntaxe de &man.crontab.5;
    valide a &eacute;t&eacute; corrig&eacute;(voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:09). &merged;</para>

    <para>La vuln&eacute;rabilit&eacute; dans &man.inetd.8; permettant l'acc&egrave;s
    en lecture aux 16 bytes initiaux des fichiers accessibles 
    par le groupe <groupname>wheel</groupname> a &eacute;t&eacute; corrig&eacute;(voir
    l'avis de s&eacute;crurit&eacute; FreeBSD-SA-01:11). &merged;</para>

    <para>Un bogue dans &man.periodic.8; qui utilisait des fichiers
    temporaires de façon peu s&eacute;curis&eacute;e a &eacute;t&eacute; corrig&eacute; (voir l'avis
    de s&eacute;curit&eacute; FreeBSD-SA-01:12). &merged;</para>

    <para>Un bogue dans &man.sort.1; permettant a un attaquant d'arr&egrave;ter
    son traitement a &eacute;t&eacute; corrig&eacute; (voir l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-01:13). &merged;</para>

    <para><application>OpenSSH</application> int&egrave;gre maintenant un code
    permettant de pr&eacute;venir (plutot que de limiter le nombre
    de connexions) aux attaques permettant de trouver la clef 
    du serveur (pas la clef de la machine) en reg&eacute;n&eacute;rant une nouvelle
    clef lorsque un probl&egrave;me RSA est d&eacute;tect&eacute; (voir l'avis de s&eacute;curit&eacute; 
     FreeBSD-SA-01:24). &merged;</para>

    <para>Plusieurs programmes ont subit une correction dans le formattage
    de l'affichage de sortie des chaines pour r&eacute;duire le risque
    de vuln&eacute;rabilit&eacute;s. &merged;</para>

    <para>Plusieurs programmes utilisants des fichiers temporaires les 
    utilisent maintenant de façon plus s&eacute;curis&eacute;e. &merged;</para>

    <para>Un bogue dans ICMP premettant a un attaquant de perturber
    les <quote>sessions</quote> TCP et UDP a &eacute;t&eacute; corrig&eacute;. &merged;</para>

    <para>Un bogue dans &man.timed.8;, causant un crash lors de l'envoi
    de paquets mals form&eacute;s, a &eacute;t&eacute; corrig&eacute; (voir l'avis de s&eacute;curit&eacute;
     FreeBSD-SA-01:28). &merged;</para>

    <para>Un bogue dans &man.rwhod.8;, permettant de le "crasher" lors de
    l'envoi de paquets mal form&eacute;s a &eacute;t&eacute; corrig&eacute; (voir l'avis de s&eacute;curit&eacute;
     FreeBSD-SA-01:29). &merged;</para>

    <para>Un trou de s&eacute;curit&eacute; dans les impl&eacute;mentations FFS et EXT2FS de &os;
    permettant &agrgave; des utilisateurs l'acc&egrave;s a des donn&eacute;es non autoris&eacute;es, a &eacute;t&eacute;
    corrig&eacute;. (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:30). &merged;</para>

    <para>Un vuln&eacute;rabilit&eacute;, exploitable &agrgave; distance, de &man.ntpd.8; a 
    &eacute;t&eacute; r&eacute;gl&eacute;e(voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:31). &merged;</para>

    <para>Un trou de s&eacute;curit&eacute; dans le m&eacute;canisme de "cache" des fragments IP
    d'<application>IPFilter</application> a &eacute;t&eacute; corrig&eacute; (voir l'avis de
    s&eacute;curit&eacute; FreeBSD-SA-01:32). &merged;</para>

    <para>Un d&eacute;passement dans &man.glob.3; permettant l'execution de code
    dans le serveur de FTP a &eacute;t&eacute; corrig&eacute;. De plus, pour pr&eacute;venir certaines 
    formes d'attaques DOS, &man.glob.3; permet de limiter le nombre de 
    r&eacute;pertoires qu'il retourne. &man.ftpd.8; utilise maintenant cette
    fonctionnalit&eacute; (voeyz l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:33). &merged;</para>

    <para>L'initialisation des num&eacute;ros de s&eacute;quences TCP est plus
    al&eacute;atoire (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:39). Suite
    a des potentiels probl&egrave;mes de compatiblit&eacute;, cette fonctionalit&eacute;
     de s&eacute;curit&eacute; peut etre activ&eacute; ou d&eacute;sactiv&eacute; via la variable sysctl
    <varname>net.inet.tcp.tcp_seq_genscheme</varname>.&merged;</para>

    <para>Un vuln&eacute;rabilit&eacute; dans les routines &man.fts.3; (utilis&eacute;s par
    des applications pour parcourir de façon r&eacute;cursive un syst&egrave;me de fichier)
    permet &agrgave; un programme de lire des fichiers en dehors de la hi&eacute;rarchie
    de r&eacute;pertoire autoris&eacute;. Ce bogue a &eacute;t&eacute; corrig&eacute; voir l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-01:40). &merged;</para>

    <para>L'impl&eacute;mentation de la couche TCP de &os; a &eacute;t&eacute; rendue plus
    r&eacute;sistante aux attaques SYN, en &eacute;liminant le segment RST envoy&eacute; 
    normalement lors du nettoyage d'une connexion de la file 
    d'attente</para>

    <para><application>OpenSSH</application> prend, maintenant, l'UID
    de l'utilisateur avant d'essayer d'effacer le fichier
    d'authentification, annulant les effets d'une "race"</para>

    <para>A flaw allowed some signal handlers to remain in effect in a
    child process after being exec-ed from its parent.  This allowed
    an attacker to execute arbitrary code in the context of a setuid
    binary.  This flaw has been corrected (see security advisory
    FreeBSD-SA-01:42). &merged;</para>

    <para>Un d&eacute;passement de buffer &agrgave; distance dans &man.tcpdump.1; a &eacute;t&eacute; 
    corrig&eacute; (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:48). &merged;</para>

    <para>Un d&eacute;passement de buffer &agrgave; distance dans &man.telnetd.8; a &eacute;t&eacute;
    corrig&eacute; (voir l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:49). &merged;</para>

    <para>Les nouvelles variables sysctl 
    <varname>net.inet.ip.maxfragpackets</varname> 
    et <varname>net.inet.ip6.maxfragpackets</varname> permettent 
    de limiter la quantit&eacute; de m&eacute;moire utilis&eacute;e par les fragments des 
    paquets IPv4 et IPv6; cela permet de mieux se pr&eacute;venir contre les
    attaques par d&eacute;ni de service (voyez l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-01:52). &merged;</para>

    <para>Tous les services dans <filename>inetd.conf</filename> sont
    maintenant d&eacute;sactiv&eacute;s par d&eacute;faut pour les nouvelles installations.
    &man.sysinstall.8; done la possiblit&eacute; d'activer ou d&eacute;sactiver 
    &man.inetd.8; pour les nouvelles installation, comme l'&eacute;dition
    de <filename>inetd.conf</filename>. &merged;</para>

    <para>Un bogue dans l'impl&eacute;mentation des r&egrave;gles de &man.ipfw.8;
    comportant <literal>me</literal> sur les liens point &agrgave; point a 
    &eacute;t&eacute; corrig&eacute;. Les r&egrave;gles de filtrage comportant <literal>me</literal> 
    matchaient l'adresse IP distante a la place de l'adresse IP
    local (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:53). &merged;</para>

    <para>Une vuln&eacute;rabilit&eacute; dans &man.procfs.5;, permettant a un 
    processus de lire des informations sensibles depuis l'espace
    m&eacute;moire d'un autre processus, a &eacute;t&eacute; corrig&eacute;e (voyez l'avis 
    de s&eacute;curit&eacute; FreeBSD-SA-01:55). &merged;</para>

    <para>La v&eacute;rification d'un nom de machine en mode
     <literal>PARANOID</literal> de <application>tcp_wrappers</application>
     fonctionne maintenant correctement (voyez l'avis de s&eacute;curit&eacute; 
     FreeBSD-SA-01:56). &merged;</para>

    <para>Un bogue permettant de passer root dans &man.sendmail.8; a
    &eacute;t&eacute; corrig&eacute;(voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:57). &merged;</para>
    
    <para>Un bogue permettant de passer root a distance dans &man.lpd.8;
    a &eacute;t&eacute; corrig&eacute; (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:58). &merged;</para>

    <para>Une "race condition" dans &man.rmuser.8; qui rendait bri&egrave;vement
    <filename>/etc/master.passwd</filename> lisible pour tout utilisateur
    a &eacute;t&eacute; corrig&eacute;e (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:59). &merged;</para>

    <para>Un bogue dans <application>UUCP</application> a &eacute;t&eacute;
    corrig&eacute; (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:62). Tous
    les binaires n'appartenant pas a <username>root</username>
    dans les "path" syst&egrave;me standard ont maintenant le drapeau
    <literal>schg</literal> permettant d'empecher l'exploitation
    de bogues via &man.cron.8;, par <username>root</username>,
    ou par un utilisateur autre que celui auquel appartient
    le binaire. De plus &man.uustat.1; est lanc&eacute; maintenant
    via <filename>/etc/periodic/daily/410.status-uucp</filename> 
    sous l'utilisateur <username>uucp</username>, et non
    plus <username>root</username>. Dans &os; -CURRENT, 
    <application>UUCP</application> ne fait plus partie des binaires
    syst&egrave;mes, et a &eacute;t&eacute; d&eacute;plac&eacute; dans la collection des Ports. &merged;</para>

    <para>Un trou de s&eacute;curit&eacute;, sous la forme d'un d&eacute;passement de buffer, dans
    l'appel syst&egrave;me &man.semop.2; a &eacute;t&eacute; corrig&eacute;.&merged;</para>

    <para>Un trou de s&eacute;curit&eacute; dans <application>OpenSSH</application>,
    permettant a un utilisateur d'executer du code avec des privil&egrave;ges 
    suppl&eacute;mentaires si <literal>UseLogin yes</literal> &eacute;tait activ&eacute;, a &eacute;t&eacute;
    corrig&eacute;. Notez que la valeur par d&eacute;faut de ce param&egrave;tre est 
    <literal>UseLogin no</literal>.  (Voyez l'avis de s&eacute;curit&eacute;
    FreeBSD-SA-01:63.) &merged;</para>

    <para>L'utilisation de r&eacute;pertoire temporaire par &man.pkg.add.1; 
    pouvait permettre a un attaquant local de modifier le contenu
    des binaires distribu&eacute;s au moment ou ils allaient etre install&eacute;. Ce
    bogue a &eacute;t&eacute; corrig&eacute; (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-02:01).
     &merged;</para>

    <para>Une "race condition" dans &man.pw.8;, permettant de lire
    le contenu du fichier <filename>/etc/master.passwd</filename>, a
    &eacute;t&eacute; corrig&eacute; (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-02:02.) &merged;</para>

    <para>Un bogue dans &man.k5su.8; pouvait permettre a un processus
    ayant obtenu des privil&egrave;ges super-utilisateur de les r&eacute;-obtenir. Ce
    bogue a &eacute;t&eacute; corrig&eacute; (voyez l'avis de s&eacute;curit&eacute; FreeBSD-SA-02:07.)
     &merged;</para>
  </sect2>


  <sect2 id="userland">
    <title>Changements dans les programmes utilisateurs</title>

    <para>Si le premier argument de  &man.ancontrol.8; ou de 
    &man.wicontrol.8; ne commence pas par un <literal>-</literal>, il est
     consid&eacute;r&eacute; comme une inteface.</para>

    <para>&man.apmd.8; peut maintenant monitorer les niveaux des batteries
     et executer des commandes bas&eacute;es sur le pourcentage ou le nombre de
     minutes restantes via la directive de configuration 
     <literal>apm_battery</literal>.  Voyez les exemples comment&eacute;s dans le fichier
    <filename>/etc/apmd.conf</filename> pour la syntaxe. &merged;</para>

    <para>&man.arp.8; affiche maintenant le nom de l'interface correspondante 
    &agrgave; chaque entr&eacute;e ARP. &merged</para>

    <para>&man.arp.8; affiche maintenant <literal>[fddi]</literal> ou
    <literal>[atm]</literal> pour les adresses d'interfaces de ce type.</para>

    <para>&man.atacontrol.8; a &eacute;t&eacute; ajout&eacute; pour permettre de controler de
     nombreux aspects du gestionnaire de p&eacute;riph&eacute;rique &man.ata.4;.</para>

    <para arch="i386">&man.boot98cfg.8;, un utilitaire de gestionnaire de 
    d&eacute;marrage PC-98, d'installation et de configuration a &eacute;t&eacute;
     ajout&eacute;. &merged;</para>

    <para>&man.burncd.8; supporte maintenant l'option <option>-m</option> pour 
    la cr&eacute;ation en mode multi-session (par d&eacute;faut les disques sont ferm&eacute;s en 
    mono-session). Une option, <option>-l</option>, a &eacute;t&eacute; ajout&eacute;e et permet 
    de prendre une liste des images depuis un fichier. <filename>-</filename> 
    peut etre utilis&eacute; comme un nom de fichier et correspond a l'entr&eacute;e 
    standard <literal>stdin</literal>. &merged;</para>

    <para>&man.burncd.8; supporte maintenant le mode "Disk At Once (DAO)", 
    s&eacute;lectionnable via l'option <option>-d</option>.</para>

    <para>&man.burncd.8; peut maintenant &eacute;crire sur les VCDs/SVCDs.</para>

    <para>&man.c89.1; a &eacute;t&eacute; converti en binaire et certains bogues mineurs 
    ont &eacute;t&eacute; fix&eacute;s. &merged;</para>

    <para arch="i386">Une version minimaliste de &man.camcontrol.8;
    est maintenant disponible sur la disquette d'installation. Cela permet
    de d&eacute;tecter les p&eacute;riph&eacute;riques connect&eacute;s apr&egrave;s le d&eacute;marrage ou d'afficher
    les p&eacute;riph&eacute;riques attach&eacute;s aux bus SCSI (par ex, depuis un 
    <quote>shell d'urgence</quote>). &merged;</para>

    <para>&man.cat.1; dispose maintenant de la capacit&eacute; de lire depuis des 
    sockets de type UNIX-domain. &merged;</para>

    <para>&man.cdcontrol.1; supporte maintenant une commande 
    <literal>cdid</literal> qui permet de calculer et d'afficher le num&eacute;ro
    de s&eacute;rie du Cd, en utilisant le meme algorithme que la 
    base CDDB. &merged;</para>

    <para>&man.cdcontrol.1; utilise maintenant la variable d'environnement
    <envar>CDROM</envar> pour choisir le p&eacute;riph&eacute;rique par d&eacute;faut. 
    &merged;</para>

    <para>&man.cdcontrol.1; supporte maintenant les commandes 
    <literal>next</literal> et <literal>prev</literal> pour avancer et 
    reculer d'une piste sur un CD audio.&merged;</para>

    <para>&man.chflags.1; a &eacute;t&eacute; d&eacute;plac&eacute; de <filename>/usr/bin</filename>
    vers <filename>/bin</filename>.</para>

    <para>&man.chio.1; a maintenant la possibilit&eacute; de sp&eacute;cifier les &eacute;lements
     par volume a la place de leur emplacement physique tout comme 
     la possibilit&eacute; de remettre un &eacute;l&eacute;ments a son emplacement 
     pr&eacute;c&eacute;dent. &merged;</para>

    <para>&man.chmod.1; supporte maintenant l'option <option>-h</option> 
    pour changer le mode d'un lien symbolique.</para>

    <para>&man.chown.8; suit maintenant correctement les liens symboliques 
    s'ils sont sp&eacute;cifi&eacute;s en arguments de la ligne de commande meme sans 
    l'option <option>-R</option>. &merged;</para>

    <para>&man.chown.8; n'utilise plus <literal>.</literal> comme d&eacute;limiteur
    utilisateur/groupe.  Cette modification a &eacute;t&eacute; faite pour permettre de
     supporter les noms d'utilisateurs contenant un 
     <literal>.</literal>.</para>

    <para>L'inclusion de <filename>&lt;sys/param.h&gt;</filename> n'est plus
    obligatoire pour l'utilisation des macros <literal>CSMG_*</literal>.</para>

    <para>&man.col.1; dispose maintenant de l'option <option>-p</option> 
    permettant, dans le cas d'une sequence de controle inconnue, de ne pas
    en tenir compte. &merged;</para>

    <para>La distribution <filename>compat3x</filename> a &eacute;t&eacute; mise &agrgave; jour
    pour inclure les librairies pr&eacute;sentes dans &os; 3.5.1-RELEASE. 
    &merged;</para>

    <para>Une distribution <filename>compat4x</filename> a &eacute;t&eacute; ajout&eacute;e 
    pour la compatibilit&eacute; avec &os; 4-STABLE.</para>

    <para>&man.config.8; convertit maintenant plus de "warnings" qui devaient 
    etre des erreurs en des erreurs fatales avec un code de sortie. Cela 
    permet &agrgave; <literal>make buildkernel</literal>  de ne plus les ignorer
    et de g&eacute;n&eacute;rer un noyau boggu&eacute; dans le cas d'une compilation 
    automatique.&merged;</para>

    <para>Diff&eacute;rents d&eacute;passement de buffer dans &man.config.8; ont &eacute;t&eacute;
    corrig&eacute;s. &merged;</para>

    <para>La programme &man.daemon.8;, une interface en ligne de commande
    a &man.daemon.3;, a &eacute;t&eacute; ajout&eacute;. Il se d&eacute;tache lui meme du terminal et
     execute le programme pass&eacute; en ligne de commande. Cela permet a un 
     utilisateur de lancer un programme comme s'il avait &eacute;t&eacute; &eacute;crit en 
     d&eacute;mon.</para>

    <para>devinfo, un outil permettant d'afficher l'arbre des 
    p&eacute;riph&eacute;riques et l'utilisation des ressources par p&eacute;riph&eacute;riques, 
    a &eacute;t&eacute; ajout&eacute;.</para>

    <para>&man.df.1; dispose maintenant de l'option <option>-l</option> 
    permettant d'afficher uniquement les syst&egrave;mes de fichiers localement
     mont&eacute;s. &merged;</para>

    <para>&man.disklabel.8; supporte maintenant l'expression des tailles
     de partitions en kilobytes, megabytes, ou gigabytes, en plus des
      secteurs. &merged;</para>

    <para>&man.dmesg.8; dispose maintenant de l'option <option>-a</option> 
    permettant d'afficher la totalit&eacute; du message de d&eacute;marrage, incluant
     les messages &man.syslogd.8; et l'affichage 
     <filename>/dev/console</filename>.&merged;</para>

    <para>&man.du.1; dispose maintenant d'une option <option>-I</option> 
    permettant d'ignorer les fichiers et les sous-r&eacute;pertoires correspondant 
    &agrgave; un masque sp&eacute;cifi&eacute;. &merged;</para>

    <para>&man.dump.8; supporte maintenant l'h&eacute;ritage du drapeau
    <literal>nodump</literal> a travers une hi&eacute;rarchie. &merged;</para>

    <para>L'option <option>-T</option> de &man.dump.8; n'attend plus 
    forc&eacute;ment un argument suppl&eacute;mentaire. &merged;</para>

    <para>&man.dump.8; dispose maintenant d'une option <option>-D</option>
    , permettant de changer le nom du fichier 
    <filename>/etc/dumpdates</filename>. &merged;</para>

    <para>&man.dump.8; affiche maintenant une information de progression 
    dans le titre du processus, tr&egrave;s utile pour la supervision des 
    sauvegardes automatis&eacute;es.</para>

    <para>&man.edquota.8; dispose maintenant de l'option <option>-f</option>, 
    permettant de limiter la modification du fichier des
    quotas (sp&eacute;cifi&eacute; via l'option <option>-p</option>)a un seul syst&egrave;me
    de fichiers. &merged;</para>

    <para>&man.fbtab.5; accepte maintenant des expressions r&eacute;guli&egrave;res pour
    les p&eacute;riph&eacute;riques cibles, et non plus juste des noms de p&eacute;riph&eacute;riques
    ou de r&eacute;pertoires individuels.</para>

    <para arch="i386">&man.fdisk.8; n'essaie plus de rechercher un
     p&eacute;riph&eacute;rique si aucun n'a &eacute;t&eacute; sp&eacute;cifi&eacute; en ligne de commande, mais
     utilise a la place le nom du p&eacute;riph&eacute;rique par d&eacute;faut ou se trouve
     le p&eacute;riph&eacute;rique racine.</para>

    <para>&man.fdread.1;, a program to read data from floppy disks,
    has been added.  It is a counterpart to &man.fdwrite.1; and is
    designed to provide a means of recovering at least some data from
    bad media, and to obviate for a complex invocation of
    &man.dd.1;.</para>

    <para>&man.find.1; supporte maintenant l'option <option>-empty</option>
    qui retourne vrai si le fichier ou le r&eacute;pertoire est vide. &merged;</para>

    <para>&man.find.1; supporte maintenant les options 
    <option>-iname</option> et <option>-ipath</option> principalement
    pour ne pas tenir compte de la casse et les options 
    <option>-regexp</option> et <option>-iregexp</option>
    correspondant aux correpondances par expressions r&eacute;guli&egrave;res. L'option
    <option>-E</option> permet maintenant d'activer le support des
    expressions r&eacute;guli&egrave;res &eacute;tendues. &merged;</para>

    <para>&man.find.1; dispose maintenant des options <option>-anewer</option>,
    <option>-cnewer</option>, <option>-mnewer</option>,
    <option>-okdir</option>, et <option>-newer[acm][acmt]</option>
    permettant la comparaison des dates et heures des fichiers. La derni&egrave;re
    option permet de sp&eacute;cifier la valeur en diff&eacute;rentes unit&eacute;s de 
    temps. &merged;</para>

    <para>&man.finger.1; dispose de la possiblit&eacute; de comparer le nom
     aux aliases, via le fichier &man.finger.conf.5;. &merged;</para>

    <para>&man.finger.1; dispose maintenant du support du fichier
    <filename>.pubkey</filename>.</para>

    <para>&man.fmt.1; a &eacute;t&eacute; r&eacute;&eacute;crit; la r&eacute;&eacute;criture a permis de corriger
    un certain nombre de bugs. &merged;</para>

    <para>&man.fmtcheck.3;, une fonction permettant de v&eacute;rifier la 
    consistence des arguments de formatage de chaine, a &eacute;t&eacute; 
    ajout&eacute;e. &merged;</para>

    <para>L'infrastructure de &man.fsck.8; permettant a &man.fsck.8;
    de travailler sur diff&eacute;rents types de syst&egrave;mes de fichiers (comme
    &man.mount.8;).</para>

    <para>La façon dont &man.fsck.8; g&egrave;re plusieurs passes
     (a la <filename>/etc/fstab</filename>), a &eacute;t&eacute; modifi&eacute;
    pour lui permettre de s'accomoder des syst&egrave;mes de fichiers sur plusieurs
    disques.</para>

    <para>&man.fsck.8; dispose maintenant du support de v&eacute;rification
    en avant plan(<option>-F</option>) et en arri&egrave;re plan(<option>-B</option>).
    Traditionnellement &man.fsck.8;est invoqu&eacute; avant le montage
    des syst&egrave;mes de fichierset toutes les v&eacute;rifications sont faites
    a ce moment. Si la v&eacute;rification en arri&egrave;re plan est disponible,
    &man.fsck.8; est invoqu&eacute; deux fois. Il est invoqu&eacute; en premier
    de façon traditionnelle, avant de monter les syst&egrave;mes de fichier,
    avec l'option <option>-F</option> pour v&eacute;rifier les
    syst&egrave;mes de fichiers ne pouvant etre v&eacute;rifier en arri&egrave;re plan.
    Il est invoqu&eacute; une seconde fois, apr&egrave;s que le syst&egrave;mes soit
    pass&eacute; en mode multi-utilisateur, avec l'option <option>-B</option>
    pour v&eacute;rifier tous les autres syst&egrave;mes de fichiers pouvant 
    &ecirc;tre v&eacute;rifi&eacute; en arri&egrave;re plan.
    Contrairement &agrgave; la v&eacute;rification en avant-plan, la v&eacute;rification en
    arri&egrave;re plan est d&eacute;marr&eacute; de façon asynchrone, cela permet
    donc de permettre &agrgave; d'autres processus syst&egrave;me de d&eacute;marrer
    pendant que les syst&egrave;mes de fichiers sont v&eacute;rifi&eacute;s. L'activation
    de cette fonctionnalit&eacute; est controll&eacute;e par la variable 
    <varname>background_fsck</varname> du fichier &man.rc.conf.5;.</para>

    <para>Imm&eacute;diatement avec la r&eacute;ception d'un signal <literal>SIGINFO</literal>
    (souvent un control-T depuis le tty de controle),  &man.fsck.ffs.8; affiche
    maintenant une ligne indiquant le num&eacute;ro et l'information de progression
     de la phase en cours.&merged;</para>

    <para>&man.fsck.ffs.8; supporte maintenant la v&eacute;rification en
    arri&egrave;re plan des syst&egrave;mes de fichiers FFS mont&eacute;s 
    grace a l'option <option>-B</option> (les softupdates doivent
     &ecirc;tre activ&eacute;s sur ces syst&egrave;mes de fichiers). 
    L'option <option>-F</option> permet de sp&eacute;cifier que le syst&egrave;me
    de fichier doit &ecirc;tre v&eacute;rifier en avant-plan.</para>

    <para>Un nouvel utilitaire &man.fsck.msdosfs.8; a &eacute;t&eacute; ajout&eacute;
    pour v&eacute;rifier la consistence des syst&egrave;mes de fichiers 
    MS-DOS. &merged;</para>

    <para>&man.ftpd.8; dispose maintenant de l'option <option>-r</option>
    permettant le mode lecture seule, et l'option <option>-E</option>
    permettant de d&eacute;sactiver la commande <literal>EPSV</literal>.  
    Il dispose aussi de plusieurs fixes permettant de r&eacute;duire la diffusion
    d'information et la possibilit&eacute;e de s&eacute;pcifier un interval de ports
    au moment de sa compilation. &merged;</para>

    <para>&man.ftpd.8; supporte maintenant les options <option>-o</option> et
    <option>-O</option> permettant de d&eacute;sactiver la commande 
    <literal>RETR</literal>; la premi&egrave;re pour tout le monde et la deuxi&egrave;me
    juste pour les invit&eacute;s. Coupl&eacute; a l'option <option>-A</option> et
    des permissions appropri&eacute;es sur les fichiers, cela permet de cr&eacute;er
    un FTP anonyme assez propre permettant a d'autres de d&eacute;poser des 
    fichiers..</para>

    <para arch="i386">&man.gdb.1; supporte maintenant des points d'arrets 
    mat&eacute;riel (en utilisant les registres de d&eacute;boggage du noyau qui
    a &eacute;t&eacute; introduit dans &os 4.0). &merged;</para>

    <para>Les fonctions &man.getprogname.3; et  &man.setprogname.3;
    ont &eacute;t&eacute; ajout&eacute;e pour permettre de manipuler le nom du programme courant.
    Elles sont utilis&eacute;es par les routines de gestion d'erreurs pour afficher
    des messages consistents.&merged;</para>

    <para>&man.gprof.1; dispose maintenant de l'option <option>-K</option> 
    pour r&eacute;soudre de façon dynamique les symboles du noyau en cours d'execution.
    Avec cette fonctionnalit&eacute;, les modules chargeables peuvent maintenant
    etre profil&eacute;s.</para>

    <para>&man.growfs.8;,  un utilitaire pour augmenter la taille des syst&egrave;mes
    de fichiers FFS a &eacute;t&eacute; ajout&eacute;. &man.ffsinfo.8;, un utilitaire pour afficher
    les m&eacute;ta-informations d'un syst&egrave;me de fichier a &eacute;t&eacute; aussi ajout&eacute;. &merged;</para>

    <para>Les scripts shells &man.groups.1; et &man.whoami.1; ne sont
    plus n&eacute;cessaires; leur fonctionnalit&eacute;s sont maintenant int&eacute;gr&eacute;es dans
    &man.id.1;. &merged;</para>

    <para>Les scripts &man.ibcs2.8;, &man.linux.8;, &man.osf1.8;, et 
    &man.svr4.8;, qui chargeaient les modules d'&eacute;mulation, ont &eacute;t&eacute; retir&eacute;s. Le
    syst&egrave;me de module actuel charge maintenant les modules n&eacute;cessaires &agrgave;
    la demande en v&eacute;rifiant les d&eacute;pendances.</para>

    <para>&man.indent.1;  dispose de nouvelles options de formattage. &merged;</para>

    <para>&man.ifconfig.8; peut maintenant affecter l'adresse au niveau de la couche
    lien d'une interface via le param&egrave;tre <option>lladdr</option>.&merged;</para>

    <para>&man.ifconfig.8; accepte maintenant la notation au format CIDR.&merged;</para>

    <para>&man.ifconfig.8; supporte maintenant l'affectation de param&egrave;tres sur les
    interfaces sans fil IEEE802.11. Les interfaces support&eacute;es sont &man.wi.4; et &man.an.4;
    ainsi que partiellement &man.awi.4;. &merged;</para>

    <para>&man.ifconfig.8; n'affiche plus la liste des m&eacute;dia support&eacute;s par d&eacute;faut. Elle
    est affich&eacute;e avec l'option <option>-m</option>. &merged;</para>

    <para>La syntaxe de &man.inetd.8; avec le support de &man.faithd.8; est maintenant
    compatible avec les autres BSDs. &merged;</para>

    <para>Le support du protocol <literal>ident</literal> dans  &man.inetd.8; a &eacute;t&eacute; 
    v&eacute;rifi&eacute; et mise a jour. &merged;</para>

    <para>&man.inetd.8; peut maintenant g&eacute;rer les sockets de type UNIX-domain. &merged;</para>

    <para>&man.install.1; dispose de plusieurs nouveaut&eacute;s, comme les options
     <option>-b</option> et <option>-B</option> pour sauvegarder les 
     fichiers cibles existants et l'option <option>-S</option> pour
     copier de façon <quote>attentive</quote>. L'option <option>-c</option> (copie)
     est maintenant active par d&eacute;faut et l'option <option>-D</option> (debug)
     a &eacute;t&eacute; retir&eacute;e. &man.install.1; affiche maintenant un warning si l'option
     <option>-d</option> (cr&eacute;er les r&eacute;pertoires) et l'option <option>-C</option>
     (copie des fichiers modifi&eacute;s uniquement) sont utilis&eacute;es ensemble. &merged;</para>

    <para>IP Filter est maintenant support&eacute; par le fichier de configuration
    du d&eacute;marrage &man.rc.conf.5;&merged;</para>

    <para>&man.ipfstat.8; supporte maintenant l'option <option>-t</option> pour
    lui permettre un affichage  &agrgave; la &man.top.1;. &merged;</para>

    <para>&man.ipfw.8; n'affiche plus les r&egrave;gles dynamiques sauf si on lui passe
    l'option <option>-d</option>. L'option <option>-e</option> permet d'afficher
    la liste des r&egrave;gles dynamiques expir&eacute;es. &merged;</para>

    <para>&man.ipfw.8; permet de v&eacute;rifier les paquets sur les interfaces 
    ayant des adresses IP dynamiques (via <literal>me</literal>). &merged;</para>

    <para>&man.ipfw.8; dispose du type <literal>limit</literal> pour
    les r&egrave;gles, qui permet de limitter le nombre de sessions entre 
    deux adresses. &merged;</para>

    <para>Les r&egrave;gles de filtrage de  &man.ipfw.8; peuvent maintenant
    v&eacute;rifier la valeur du champ de pr&eacute;c&eacute;dencee IPv4.</para>

    <para>&man.ip6fw.8; peut maintenant utiliser un pr&eacute;-processeur
    et dispose de l'option <option>-q</option> (quiet) pour la lecture
    depuis un fichier. &merged;</para>

    <para>&man.kenv.1;, une commande permettant d'afficher l'environnement
    noyau, a &eacute;t&eacute; ajout&eacute;. &merged;</para>

    <para>&man.keyinfo.1; est maintenant un programme C, plutot qu'un script 
    Perl. &merged;</para>

    <para>&man.killall.1; est maintenant un programme C plutot qu'un script Perl.
    L'option <option>-m</option> utilise donc maintenant la syntaxe
    des expressions de &man.regex.3; a la place de celles de &man.perl.1;. &merged;</para>

    <para>&man.killall.1; permet maintenant aux utilisateurs non-root de tuer
    les processus SUID root qu'ils ont lanc&eacute;, de la meme façon que la version 
    Perl. &merged;</para>

    <para>L'utilitaire &man.kldconfig.8; a &eacute;t&eacute; ajout&eacute; pour permettre de manipuler
    plus facilement le path de recherche des modules noyau. &merged;</para>

    <para>&man.last.1; impl&eacute;mente maintenant l'option <option>-d</option>
    qui permet de voir qui s'est logguer a une date et a une heure 
    sp&eacute;cifique.. &merged;</para>

    <para>L'utilitaire &man.lastlogin.8;, permettant d'afficher le dernier login
    d'un utilisateur, a &eacute;t&eacute; import&eacute; de NetBSD. &merged;</para>

    <para>&man.ldconfig.8; v&eacute;rifie maintenant le propri&eacute;taire du r&eacute;pertoire et 
    les permissions pour plus de s&eacute;curit&eacute;; ces v&eacute;rifications peuvent etre
    d&eacute;sactiv&eacute;s via l'option <option>-i</option>. &merged;</para>

    <para>&man.ldd.1; peut maintenant etre utilis&eacute; sur les librairies partag&eacute;es, 
    en plus des executables. &merged;</para>

    <para>&man.ldd.1; dispose maintenant de l'option <option>-a</option>
    pour lister l'ensemble des objets n&eacute;cessaire pour chaque objet 
    chargeable.</para>

    <para><filename>libc</filename> est maintenant thread-safe par d&eacute;faut;
    <filename>libc_r</filename> contient uniquement des fonctions "thread-able".</para>

    <para><filename>libcrypt</filename> et
    <filename>libdescrypt</filename> ont &eacute;t&eacute; unifi&eacute; pour fournir une fonction 
    de hashage d'authentification des mots de passe configurable. Les
    m&eacute;thodes de hashage des et md5 sont fournies sauf si la fonction
    de hashage des est sp&eacute;cifiquement retir&eacute;e. &merged;</para>

    <para><filename>libcrypt</filename> supporte maintenant l'algorithme
     Blowfish pour le hashage des mots de passe. &merged;</para>

    <para arch="i386"><filename>libdisk</filename> peut maintenant configurer
    lors de l'installation le gestionnaire de d&eacute;marrage 
    <filename>boot0</filename>. &merged;</para>

    <para><filename>libstand</filename> supporte maintenant les fichiers
    compress&eacute;s en <application>bzip2</application> dans les syst&egrave;mes de 
    fichiers. &merged;</para>

    <para><filename>libstand</filename> peut maintenant &eacute;craser le contenu
    d'un fichier sur des syst&egrave;mes de fichiers UFS (il ne peut pas &eacute;largir
    ou tronquer des fichiers, car le syst&egrave;me de fichiers ne serait pas
     consistent).</para>

    <para>L'intervalle par d&eacute;faut des ports TCP utilis&eacute;s par
    <filename>libfetch</filename> lors de FTP passifs a chang&eacute;; 
    cela affecte les fonctionnalit&eacute;s de &man.fetch.1;, qui
    dispose maintenant de l'option <option>-U</option> pour utiliser 
    l'ancien intervalle. &merged;</para>

    <para><filename>libfetch</filename> supporte maintenant 
    l'authentification. &merged;</para>

    <para><filename>libfetch</filename> peut maintenant utiliser la variable
    d'environnement <envar>HTTP_USER_AGENT</envar>. &merged;</para>

    <para><filename>libgmp</filename> a &eacute;t&eacute; remplac&eacute; par
    <filename>libmp</filename>.

    <para>Les fonctions de <filename>libposix1e</filename> ont &eacute;t&eacute; 
    int&eacute;gr&eacute;s dans <filename>libc</filename>.</para>

    <para>&man.ln.1; dispose maintenant de l'option <option>-i</option>
    pour demander a l'utilisateur la confirmation avant d'&eacute;craser un
    fichier existant. &merged;</para>

    <para>&man.ln.1; supporte maintenant l'option <option>-h</option> 
    pour emp&eacute;cher de suivre une cible qui est un lien, l'option 
    <option>-n</option> a &eacute;t&eacute; ajout&eacute;e pour la 
    compatibilit&eacute;. &merged;</para>

    <para>&man.logger.1; peut maintenant envoyer des messages directement 
    a un syslog distant. &merged;</para>

    <para>&man.login.1; exporte maintenant les variables d'environnements
    mis en place par les modules <application>PAM</application>. &merged;</para>

    <para>&man.lpc.8; a &eacute;t&eacute; am&eacute;lior&eacute;; <command>lpc clean</command>
    est maintenant plus sur, et une nouvelle commande <command>lpc tclean</command>
    permettant de v&eacute;rifier quels fichiers seront effac&eacute;s par 
    <command>lpc clean</command> a &eacute;t&eacute; ajout&eacute;e. &merged;</para>

    <para>&man.lpd.8; dispose de deux nouvelles options: <option>-c</option>
    qui loggue toutes les erreurs de connexion dans &man.syslogd.8;, et
    <option>-W</option> qui permet d'autoriser les connexions depuis des ports
    non r&eacute;serv&eacute;s. &merged;</para>

    <para>&man.lpd.8; supporte maintenant dans ses fichiers de controle
    des actions d'impressions le type <literal>o</literal>, qui lui permet d'imprimer 
    les fichiers PostScript g&eacute;n&eacute;r&eacute;s par 
    <application>MacOS</application> 10.1. &merged;</para>

    <para>&man.lpr.1;, &man.lpq.1;, et &man.lpd.8; ont reçus certaines 
    am&eacute;liorations. &merged;</para>

    <para>&man.lpr.1;, &man.lpd.8;, &man.syslogd.8;, et
    &man.logger.1; sont maintenant compatible IPv6, comme d'autres
    utilitaires r&eacute;seaux du syst&egrave;me de base. &merged;</para>

    <para><command>lprm -</command> supporte maintenant la gestions des files
    d'impressions distantes. &merged;</para>

    <para>&man.ls.1; peut maintenant produire une sortie en couleur lorsque
    l'option <option>-G</option> lui est pass&eacute; (et que le terminal supporte
    cette fonction). La variable d'environnement <envar>CLICOLOR</envar> peut
    etre mise en place pour activer par d&eacute;faut cette 
    fonctionnalit&eacute;. &merged;</para>

    <para>&man.mail.1;  supporte maintenant l'option <option>-E</option>
    pour &eacute;viter d'envoyer des messages avec le corps vide. &merged;</para>

    <para>&man.make.1; dispose des modificateurs de variables <literal>:C///</literal>
    (substitution des expressions r&eacute;guli&egrave;res), <literal>:L</literal>
    (minuscule), and <literal>:U</literal> (majuscule).  Ils ont &eacute;t&eacute; ajout&eacute;
    pour r&eacute;duire les diff&eacute;rences entre &os; et OpenBSD/NetBSD. &merged; </para>

    <para>Diff&eacute;rents bogues dans  &man.make.1;, comme ceux incluant 
    les suffixes vide, mauvaises suppositions sur les permissions des r&eacute;pertoires,
    et certains d&eacute;passements de tampon potentiels, ont &eacute;t&eacute; 
    fix&eacute;s. &merged;</para>

    <para>La nouvelle variable <varname>CPUTYPE</varname> dans
    <filename>make.conf</filename> permet de controler les optimisations
    sp&eacute;cifiques &agrgave; certains processeurs dans diff&eacute;rentes parties du code, 
    comme dans <application>OpenSSL</application>. &merged;</para>

    <para>L'infrastructure de <filename>Makefile</filename> de &os; supporte
    maintenant la directive <varname>WARNS</varname> venant de NetBSD. Cette
    directive controle l'addition des options de warnings au compilateur
    via <varname>CFLAGS</varname> de façon neutre. &merged;</para>

    <para>&man.man.1; n'est plus install&eacute; SUID
    <username>man</username>, dans le but de r&eacute;duire les vuln&eacute;rabilit&eacute;s
    associ&eacute;es lors de la g&eacute;n&eacute;ration de <quote>catpages</quote>
    (les pages de manuel cach&eacute;es pour leur lecture r&eacute;p&eacute;t&eacute;es). 
    Comme r&eacute;sultat &man.man.1; ne peut plus cr&eacute;er des pages de manuels
    cach&eacute;es pour un utilisateur. Il peut continuer a le faire si l'utilisateur
    &agrgave; la possibilit&eacute; d'&eacute;crire dans le r&eacute;pertoire des catpages (
    par ex une page de manuel lui appartenant) ou si l'utilisateur le lancant est 
    <username>root</username>.</para>

    <para>La commande &man.mdmfs.8; a &eacute;t&eacute; ajout&eacute;e; c'est un wrapper
    de &man.mdconfig.8;, &man.disklabel.8;, &man.newfs.8; et &man.mount.8; qui
    permet d'utiliser les options de en ligne de commande de 
    &man.mount.mfs.8;.</para>

    <para>&man.mergemaster.8; inclut maintenant le fichier et 
    <filename>/etc/mergemaster.rc</filename> et demande maintenant a 
    l'utilisateur de lancer les commandes recommand&eacute;es (comme
    <command>newaliases</command>)) si n&eacute;cessaires. &merged;</para>

    <para>&man.moused.8; supporte maintenant l'option  <option>-a</option>  pour
    controler l'acc&eacute;l&eacute;ration de la souris. &merged;</para>

    <para>&man.mtree.8; peut utiliser un fichier comportant la liste des
    r&eacute;pertoires &agrgave; exclure lorsqu'il cr&eacute;e ou v&eacute;rifie les prototypes. 
    Cela permet d'utiliser plus facilement &man.mtree.8; comme outil
    de d&eacute;tection d'intrusion syst&egrave;me.&merged;</para>

    <para>&man.natd.8; dispose maintenant de l'option <option>-log_ipfw_denied</option> 
    pour logguer les paquets qui ne peuvent etre r&eacute;-inject&eacute;s suite a des
    r&egrave;gles de &man.ipfw.8;. &merged;</para>

    <para>Le pourcentage d'utilisation affich&eacute; par &man.netstat.1; 
    refl&egrave;te maintenant correctement le pourcentage de mbufs r&eacute;seaux 
    utilis&eacute;s&merged;</para>

    <para>&man.netstat.1; dispose maintenant du param&egrave;tre de ligne de commande
    <option>-W</option> qui lui permet de ne pas tronquer les adresses, meme si
    elles sont trop longue pour s'afficher dans la colonne n&eacute;cessaire. &merged;</para>

    <para>&man.netstat.1; garde maintenant une trace des paquets en entr&eacute;e 
    et en sortie par adresse pour chaque interface. &merged;</para>

    <para>&man.netstat.1; dispose maintenant du param&egrave;tre de ligne de commande
     <option>-z</option> permettant la remise &agrgave; z&eacute;ro des statistiques. &merged;</para>

    <para>&man.netstat.1; dispose maintenant du param&egrave;tre de ligne de commande
     <option>-S</option> permettant d'afficher les adresse en format num&eacute;rique tout
     en gardant les noms symbolique des ports. &merged;</para>

    <para>&man.newfs.8; impl&eacute;mente maintenant les &eacute;critures combin&eacute;es, cela
    permet la cr&eacute;ation des nouveaux syst&egrave;mes de fichiers jusqu'a sept
    fois plus rapidement. &merged;</para>

    <para>&man.newfs.8; dispose maintenant de l'option <option>-U</option>, permettant
    l'activation des softupdates sur un nouveau syst&egrave;me de fichiers. &merged;</para>

    <para>Le nombre de cylindres par groupe de &man.newfs.8; est maintenant
    calcul&eacute; pour etre &eacute;gal au nombre maximum donn&eacute; par les
    param&egrave;tres du syst&egrave;me de fichiers courant. Ce nombre peut etre 
    forc&eacute; via l'option <option>-c</option>. De base, la valeur par d&eacute;faut a &eacute;t&eacute;
    fix&eacute;e &agrgave; 16. Cela augmente les performances de &man.fsck.8; tout en 
    r&eacute;duisant la fragmentation. &merged;</para>

    <para><anchor id="newfs-block-frag-sizes">La taille des blocs et des fragments
    lors de la cr&eacute;ation de syst&egrave;mes de fichiers par &man.newfs.8; sont 
    respectivement de 16384 bytes et 2048 bytes (les anciennes valeurs
    &eacute;taient de 8192 bytes et 1024 bytes). Ce changement augmente la performance
    en contrepartie de r&eacute;duire la taille disponible. &merged;</para>

    <para>&man.newsyslog.8; peut maintenant compresser les fichiers de log
    en utilisant &man.bzip2.1;. &merged;</para>

    <para><application>NFS</application> supporte maintenant IPv6.</para>

    <para>&man.ngctl.8; now supports a <option>write</option> command
    to send a data packet down a given hook. &merged;</para>

    <para>&man.nl.1;, un filtre de num&eacute;rotation des lignes a &eacute;t&eacute; 
    ajout&eacute;. &merged;</para>

    <para>Le support de <application>nsswitch</application> a &eacute;r&eacute; ajout&eacute;
    depuis NetBSD. En cr&eacute;ant un fichier &man.nsswitch.conf.5;, diff&eacute;rentes
    bases de donn&eacute;es du syst&egrave;me, comme &man.passwd.5; et &man.group.5;,
    peuvent se trouver dans des fichiers plats, des bases NIS ou Hesiod. L'ancien
    fichier <filename>hosts.conf</filename> n'est plus utilis&eacute;.</para>

    <para>Le support <application>PAM</application> pour la gestion des comptes
    et des sessions a &eacute;t&eacute; ajout&eacute;.</para>

    <para>La configuration <application>PAM</application> se trouve
    maintenant dans le r&eacute;pertoire <filename>/etc/pam.d/</filename>
    au lieu du seul fichier <filename>/etc/pam.d/</filename>. Voyez
    le fichier <filename>/etc/pam.d/README</filename> pour plus de d&eacute;tails.</para> 

    <para>&man.passwd.1; et &man.pw.8; s&eacute;lectionnent l'algorithme de
    hashage &agrgave; la vol&eacute;e. Voyez l'attribut <literal>passwd_format</literal>
    dans <filename>/etc/login.conf</filename>. &merged;</para>

    <para>&man.pax.1; a reçu diff&eacute;rentes am&eacute;liorations, comme la 
    compatibilit&eacute; avec  &man.tar.1;, la fonctionnalit&eacute; &man.cpio.1;,
    les options <option>-z</option> et <option>-Z</option> pour la 
    compression en  &man.gzip.1; et &man.compress.1; , et diff&eacute;rentes corrections
    de bogues.</para>

    <para>&man.pciconf.8; dispose maintenant de l'option <option>-v</option> 
    permettant d'afficher les informations sur le composant configur&eacute;, en
    compl&eacute;ment de l'option <option>-l</option> option.  La base de donn&eacute;es
    par d&eacute;faut peut etre trouv&eacute; dans le fichier
    <filename>/usr/share/misc/pci_vendors</filename>. &merged;</para>

    <para>Le comportement de &man.periodic.8; est maintenant controller
    par les fichiers <filename>/etc/defaults/periodic.conf</filename> et
    <filename>/etc/periodic.conf</filename>. &merged;</para>

    <para>&man.ping.8; dispose maintenant de l'option <option>-m</option> 
    permettant d'imposer le TTL des paquets de sortie. &merged;</para>

    <para>&man.ping.8; dispose maintenant de l'option <option>-A</option> permettant
    d'&eacute;mettre un son lorsque des paquets sont perdus. &merged;</para>

    <para>La partie utilisateur de &man.ppp.8; a reçu de nombreuses modifications
    et de corrections de bogues. &merged;</para>

    <para>&man.ppp.8; dispose de l'option <literal>tcpmssfixup</literal>
    qui permet d'ajuster les paquets TCP SYN en entr&eacute;e et en sortie, permettant
    alors que la taille de r&eacute;ception de segment ne soit pas plus importante
    que le MTU de l'interface. &merged;</para>

    <para>&man.ppp.8; supporte maintenant IPv6.</para>

    <para>&man.pppd.8; (le programme controlant au niveau noyau PPP) est maintenant
    install&eacute; en mode <literal>4550</literal> et 
    <username>root</username><literal>:</literal><groupname>dialer</groupname>,
    plutot que en mode <literal>4555</literal> (en d'autre termes, cela veut dire
    qu'il n'est plus executable par tout le monde.) Les utilisateurs de &man.pppd.8; 
    doivent donc changer leur configuration de groupes. &merged;</para>

    <para>L'option <option>-W</option> de &man.ps.1; (permettant d'extraire
    les informations depuis un p&eacute;riph&eacute;rique de swap sp&eacute;cifique) a
    &eacute;t&eacute; retur&eacute;. &merged;</para>

    <para>&man.pwd.1; can now double as &man.realpath.1;, a program to
    resolve pathnames to their underlying physical paths. &merged;</para>

    <para>Le g&eacute;n&eacute;rateur de nombre pseudo al&eacute;atoire impl&eacute;ment&eacute; par
    &man.rand.3; a &eacute;t&eacute; am&eacute;lior&eacute; .</para>

    <para>&man.rc.8; dispose maintenant d'un environnement permettant de v&eacute;rifier
    les d&eacute;pendances entre les variables de &man.rc.conf.5;. &merged;</para>

    <para>&man.rc.8; efface maintenant tous les fichiers qui ne sont pas des r&eacute;pertoires
    dans  <filename>/var/run</filename> et
    <filename>/var/spool/lock</filename> au moment du d&eacute;marrage. &merged;</para>

    <para>&man.rcmd.3; supporte maintenant la variable d'environnement
    <envar>RSH</envar> permettant de sp&eacute;cifier quel programme autre que 
    &man.rsh.1; utiliser pour l'execution a distance de commande. Cela permet
    donc a des programmes comme &man.dump.8; d'utiliser &man.ssh.1; pour
    transporter les donn&eacute;es.</para>

    <para>&man.rdist.1; a &eacute;t&eacute; retir&eacute; du syst&egrave;me de base, mais reste
    disponible dans la collection des Ports sous 
    <filename role="package">net/44bsd-rdist</filename>.</para>

    <para>Le &man.resolver.3; de &os; impl&eacute;mente maintenant le support
    EDNS0, qui est n&eacute;cessaire lorsque l'on utilise des serveurs DNS/resolveurs
    supportant IPv6. &merged;</para>

    <para>L'appel syst&egrave;me &man.rfork.thread.3; a &eacute;t&eacute; ajout&eacute; comme
    fonction d'aide &agrgave; &man.rfork.2;. Cela permet d'utiliser cette
    fonction sans impl&eacute;menter des m&eacute;canismes complexes de swap de 
    stack. &merged;</para>

    <para>L'option <option>-v</option> de &man.rm.1; affiche maintenant
    l'ensemble du r&eacute;pertoire ou se trouve le fichier &agrgave; effacer.</para>

    <para>&man.route.8; est maintenat plus verbeux lors du changement de routes
    indirectes, dans le cas ou la passerelle de la route modifi&eacute;e est
    la meme que la route existante. &merged;</para>

    <para>&man.route.8; utilise maintenant la syntax 
    <literal><replaceable>host</replaceable>/<replaceable>bits</replaceable></literal>
    plutot que la syntaxe
    <literal><replaceable>net</replaceable>/<replaceable>bits</replaceable></literal>
    syntax, pour la compatibilit&eacute; avec &man.netstat.1;. &merged;</para>

    <para>&man.route.8; peut maintenant cr&eacute;er des entr&eacute;e ARP 
    <quote>proxy only</quote>. &merged;</para>

    <para>La commande <option>add</option> de &man.route.8; dispose des options
     <option>-ifp</option> and <option>-ifa</option>. &merged;</para>

    <para>&man.rpcbind.8; a remplac&eacute; &man.portmap.8;.</para>

    <para>&man.rpcgen.1; utilise  <filename>/usr/bin/cpp</filename>
    (comme dans NetBSD), et non plus <filename>/usr/libexec/cpp</filename>.</para>

    <para>&man.rpc.lockd.8; a &eacute;t&eacute; import&eacute; depuis NetBSD.  Ce d&eacute;mon permet
    d'activer les verrous sur les syst&egrave;mes de fichiers NFS.</para>

    <para>Les performances du linkeur dynamique ELF &man.rtld.1; ont &eacute;t&eacute;
    am&eacute;lior&eacute;es. &merged;</para>

    <para>RSA Security a lib&eacute;r&eacute; les droits sur l'algorithme 
    <application>RSA</application>. Cela permet d'activer par d&eacute;faut
    dans <application>OpenSSL</application> l'algorithme RSA. Cela permet
    de lib&eacute;rer le port <filename role="package">security/rsaref</filename>
    des d&eacute;pendences des librairies <filename>librsaUSA</filename> et
    <filename>librsaINTL</filename> repectivement pour les r&eacute;sidents am&eacute;ricains
    et non am&eacute;ricains. &merged;</para>

    <para>&man.rtld.1; affiche maintenant le nom de tous les objets n&eacute;cessaires
    &agrgave; charger lorsque la variable d'environnement
    <varname>LD_TRACE_LOADED_OBJECTS_ALL</varname> est d&eacute;finie.</para>

    <para>&man.savecore.8; dispose de l'option <option>-k</option> 
    permettant de nettoyer le fichier de crash apr&egrave;s l'avoir
    sauvegard&eacute;. Il essaie aussi d'&eacute;viter d'&eacute;crire de
    grandes s&eacute;ries de z&eacute;ro dans le fichier de crash pour 
    sauver de l'espace disque et du temps. &merged;</para>

    <para>&man.savecore.8; fonctionne correctement sur les machines
    disposant de 2GB ou plus de RAM. &merged;</para>

    <para>&man.sed.1; dispose de l'option <option>-E</option> pour le
    support des expressions r&eacute;guli&egrave;res &eacute;tendues. &merged;</para>

    <para>&man.send-pr.1; dispose maintenant de l'option <option>-a</option> 
    permettant d'inclure un fichier dans la section <literal>Fix:</literal> 
    d'un rapport de bogue. &merged;</para>

    <para>Les commandes &man.setfacl.1; et &man.getfacl.1; ont &eacute;t&eacute; 
    jout&eacute;es pour g&eacute;rer les listes de controles d'acc&egrave;s (ACL)
    sur les syst&egrave;mes de fichiers.</para>

    <para>&man.setproctitle.3; a &eacute;t&eacute; d&eacute;placer de
    <filename>libutil</filename> vers
    <filename>libc</filename>. &merged;</para>

    <para>&man.sh.1; impl&eacute;mente <command>test</command> comme une
    built-in pour am&eacute;liorer son &eacute;fficience. &merged;</para>

    <para>&man.sh.1; n'impl&eacute;mente plus <command>printf</command> comme une 
    built-in car elle a &eacute;t&eacute; consid&eacute;r&eacute;e peu int&eacute;ressante 
    compar&eacute;e aux autres built-ins (cette fonctionnalit&eacute; est toujours 
    disponible via l'executable &man.printf.1;).</para>

    <para>&man.sockstat.1; dispose de l'option <option>-c</option> et
    <option>-l</option> permettant repectivement de lister les sockets 
    connect&eacute;es et &agrgave; l'&eacute;coute. &merged;</para>

    <para>&man.split.1; peut maintenant couper les fichiers de plus de 
    2GB. &merged;</para>

    <para>Dans le but d'etre compatible SUSv2/POSIX pour   
    <filename>&lt;sys/select.h&gt;</filename>,
    <literal>struct selinfo</literal> et les fonctions associ&eacute;es 
    ont &eacute;t&eacute; d&eacute;plac&eacute;es dans 
    <filename>&lt;sys/selinfo.h&gt;</filename>.</para>

    <para>Les variantes &man.strnstr.3; et &man.strcasestr.3; de
    &man.strstr.3; ont &eacute;t&eacute; impl&eacute;ment&eacute;es. &merged;</para>

    <para>&man.stty.1; dispose d'un charact&egrave;re de controle
    <literal>erase2</literal>, donc, par exemple, les touches
    <keycap>Delete</keycap> et <keycap>Backspace</keycap> peuvent
    etre utilis&eacute;s pour effacer des caract&egrave;res. &merged;</para>

    <para>&man.style.perl.7;, un guide de style pour les 
    d&eacute;veloppeurs de code Perl dans le syst&egrave;me de base de &os; a &eacute;t&eacute;
    ajout&eacute;. &merged;</para>

    <para>&man.su.1; peut maintenant utiliser l'authentification
     <application>PAM</application>.</para>

    <para>La configuration de d&eacute;marragede &man.syscons.4; a &eacute;t&eacute;
    d&eacute;placer dans le fichier, ind&eacute;pendant de l'architecture, 
     <filename>/etc/rc.syscons</filename>. &merged;</para>

    <para>&man.sysctl.8; dispose de l'option <option>-N</option> 
    pour afficher juste le nom des variables. &merged;</para>

    <para>Les options <option>-A</option> et <option>-X</option> 
    de &man.sysctl.8; ont &eacute;t&eacute; remplac&eacute;es respectivement par
    <option>-ao</option> et <option>-ax</option>; les anciennes options
    sont maintenant d&eacute;pr&eacute;ci&eacute;es. L'option <option>-w</option>
    est elle aussi d&eacute;pr&eacute;ci&eacute;e. &merged;</para>

    <para>&man.sysctl.8; dispose maintenant de l'option <option>-e</option>
    pour s&eacute;parer les noms des variables et leur valeur par
    <literal>=</literal> plutot que <literal>:</literal>. Cette option
    est tr&egrave;s pratique pour renvoyer des valeurs &agrgave; 
    &man.sysctl.8;. &merged;</para>

    <para>&man.sysinstall.8; pr&eacute;serve maintenant proprement
    <filename>/etc/mail</filename> lors d'une mise &agrgave; jour via
    les binaires. &merged;</para>

    <para>La taille par d&eacute;faut de la partition principale dans 
     &man.sysinstall.8; est maintenant de 100MB sur i386 et 120MB 
     sur Alpha.</para>

    <para>&man.sysinstall.8; se trouve maintenant dans 
    <filename>/usr/sbin</filename>, ce qui simplifie le processus 
    d'installation. La page de manuel de &man.sysinstall.8; a &eacute;t&eacute;
    install&eacute; de façon consistente.</para>

    <para>&man.sysinstall.8; peut maintenant charger des KLDs au
    moment de l'installation. &merged;</para>

    <para>Lors de l'installation, &man.sysinstall.8; charge 
    automatiquement tous les gestionnaires de p&eacute;riph&eacute;riques
    du r&eacute;pertoire <filename>/stand/modules</filename>de la
    disquette <literal>mfsroot</literal> ou du syst&egrave;me de fichier
    image. Il faut noter que les gestionnaires alors charg&eacute;s 
    n'apparaitront pas dans les messages de d&eacute;marrage du noyau; 
    l'&eacute;cran de d&eacute;bogguage de &man.sysinstall.8;
    fournira lui, plus d'informations. &merged;</para>

    <para>&man.sysinstall.8; active maintenant automatiquement les 
    Soft Updates sur tous les syst&egrave;mes de fichiers qu'il cr&eacute;e, 
    except&eacute; pour le syst&egrave;me de fichiers racine. &merged;</para>

    <para>&man.sysinstall.8; a reçu des mises &agrgave; jour sur le mode
    <quote>auto</quote> de partitionnement qui permet de donner des
    valeurs plus raisonnables &agrgave; la taille des partitions qu'il cr&eacute;e;
    ces partitions automatiquement taill&eacute;es peuvent r&eacute;-utiliser
    l'espace qui devient disponible lorsque d'autres partitions sont 
    effac&eacute;es. &merged;</para>

    <para>&man.syslogd.8; support l'option <option>-n</option>
    pour d&eacute;sactiver les r&eacute;solutions DNS lors de chaque
    requete. &merged;</para>

    <para>&man.syslogd.8; dispose maintenant d'un facilit&eacute;
     <literal>LOG_CONSOLE</literal> (d&eacute;sactiv&eacute;e par d&eacute;faut),
     qui permet de logguer les messages de 
     <filename>/dev/console</filename>. &merged;</para>

    <para>&man.syslogd.8; dispose de la possibilit&eacute; de s'attacher
    sur une adresse sp&eacute;cifique (plutot que d'utiliser toutes celles
    disponibles) grace &agrgave; l'option <option>-b</option>. &merged;</para>

    <para>&man.syslogd.8; dispose de l'option <option>-c</option> pour 
    d&eacute;sactiver la compression des lignes r&eacute;p&eacute;titives. &merged;</para>

    <para>&man.tail.1; peut utiliser les fichiers de plus de 
    2GB. &merged;</para>

    <para>&man.tar.1; peut utiliser la variable <varname>TAR_RSH</varname>
    principalement pour tuiliser &man.ssh.1; comme 
    transport. &merged;</para>

    <para>&man.telnet.1; supporte l'autologin et le cryptage
    par d&eacute;faut; une nouvelle option, <option>-y</option>, 
    d&eacute;sactive ce cryptage.</para>

    <para>&man.telnet.1; dispose de l'option de ligne de commande
    <option>-u</option> pour autoriser les connexions depuis les
    sockets de domaine UNIX (<literal>AF_UNIX</literal>). &merged;</para>

    <para>&man.tftpd.8; dispose des options <option>-c</option> et
    <option>-C</option> permettant de &man.chroot.2;er le serveur
    an fonction de l'adresse IP du client se connectant.
    &man.tftp.1; et &man.tftpd.8; peut maintenant transf&eacute;er des
     fichiers plus gros que 65535 blocks. &merged;</para>

    <para>&man.tftpd.8; supporte maintenant le RFC 2349 (TFTP Timeout Interval
    and Transfer Size Options); cette fonctionnalit&eacute; est n&eacute;cessaire pour 
    certains firmware de gestionnaire de d&eacute;marrage EFI (les serveurs
    HP i2000 Itanium le n&eacute;cessite) pour d&eacute;marrer sur une image de
    d&eacute;marrage en utilisant <application>TFTP</application>.</para>

    <para arch="alpha">&man.timed.8; fonctionnent maintenant sur alpha.</para>

    <para>Une version de  Transport Independent RPC
    (<application>TI-RPC</application>) a &eacute;t&eacute; import&eacute;e.</para>

    <para>&man.tmpnam.3; utilise maintenant la variable d'environnement
     <envar>TMPDIR</envar>, si elle est positionn&eacute;e, pour sp&eacute;cifi&eacute;
     l'emplacement des fichiers temporaires. &merged;</para>

    <para>&man.tip.1; a &eacute;t&eacute; mis &agrgave; jour depuis
    <application>OpenBSD</application>, et dispose de la possibilit&eacute; 
    d'etre utilis&eacute; comme &man.cu.1;.</para>

    <para>&man.top.1; utilise maintenant la totalit&eacute; de la largeur du 
    tty.</para>

    <para>&man.touch.1; dispose maintenant de l'option <option>-h</option> 
    lui permettant d'utiliser les liens symboliques.</para>

    <para>L'utilitaire &man.truncate.1;, permettant de r&eacute;duire ou 
    d'augmenter la taille d'un fichier, a &eacute;t&eacute; ajout&eacute;. &merged;</para>

    <para>Le support Ukrainian a &eacute;t&eacute; ajout&eacute; &agrgave; la console
     &os;. &merged;</para>

    <para><application>UUCP</application> a &eacute;t&eacute; retir&eacute; du syst&egrave;me
    de base. Il se trouve maintenant dans la collection des Ports, 
    dans <filename role="package">net/freebsd-uucp</filename>.</para>

    <para>&man.units.1; a reçu diff&eacute;rentes corrections de bogues 
    et mise &agrgave; jour. &merged;</para>

    <para>&man.usbdevs.8; dispose de l'option de ligne de commande
     <option>-d</option> pour afficher le gestionnaire de p&eacute;riph&eacute;rique 
     associ&eacute; avec chaque p&eacute;riph&eacute;rique.</para>

    <para>&man.uudecode.1; dispose de l'option <option>-o</option> permettant
    de d&eacute;finir le fichier de sortie.</para>

    <para>&man.vidcontrol.1; dispose du param&egrave;tre <option>-g</option>
    permettant de selectionnerune g&eacute;om&eacute;trie personnelle de text dans le
    mode texte <literal>VESA_800x600</literal>. &merged;</para>

    <para>&man.vidcontrol.1;  permet maintenant &agrgave; l'utilisateur
    d'oublier de sp&eacute;cifier la taille des fontes lors de leur chargement,
    et il dispose aussi d'une meilleur gestion des erreurs. &merged;</para>

    <para>&man.vidcontrol.1; dispose de l'option <option>-p</option>
    permettant d'obtenir une copie du tampon vid&eacute;o de &man.syscons.4;.
    Ces copies peuvent ensuite etre utilis&eacute;es avec l'utilitaire 
    <filename role="package">graphics/scr2png</filename> de la collection
    des Ports. &merged;</para>

    <para>&man.vidcontrol.1; dispose maintenant de l'option
     <option>-C</option> permettant de nettoyer l'historique du tampon pour
     un tty, et de l'option <option>-h</option> pour affecter la taille
     de l'historique du tampon. &merged;</para>

    <para>The default stripe size in &man.vinum.8; has been changed
    from 256KB to 279KB, to spread out superblocks more evenly between
    stripes.</para>

    <para>&man.wall.1; supporte maintenant de l'option de ligne de commande
     <option>-g</option>  permttant d'&eacute;crire un message a tous les 
     utilisateurs d'un groupe donn&eacute;. &merged;</para>

    <para>&man.watch.8; dispose de l'option <option>-f</option> permettant
    de sp&eacute;cifier le p&eacute;riph&eacute;rique &man.snp.4; &agrgave; utiliser.</para>

    <para>&man.which.1; est maintenant un programme C plutot qu'un script
    Perl.</para>

    <para>&man.whois.1; interroge maintenant directement l'ARIN pour
    les demandes d'adresses IP. Si la requ&egrave;te &agrgave; l'ARIN
    r&eacute;f&eacute;rence l'APNIC ou le RIPE, le serveur apropri&eacute;
    est appel&eacute;, dans le cas ou l'option <option>-Q</option>
    n'est pas sp&eacute;cifi&eacute;e. &merged;</para>

    <para>&man.whois.1; dispose de l'option <option>-c</option> 
    permettant de sp&eacute;cifier le code pays dans le but
    d'aider les requ&egrave;tes directes vers un serveur whois 
    particulier. &merged;</para>


    <para>&man.xargs.1; dispose de l'option <option>-I</option>
      <replaceable>replstr</replaceable> permettant de demander &agrgave;
      l'utilisateur les donn&eacute;es &agrgave; ins&eacute;r&eacute;es depuis
      l'entr&eacute;e standard &agrgave; certains points, plutot que de prendre
      ces donn&eacute;es &agrgave; la fin des arguments</para>

    <para>La chaine de compilation utilise maintenant le code
    d'initialisation fourni par le compilateur C/C++ de la FSF.
    Ce changement permet d'obtenir une meilleur compatibilit&eacute; avec
    les diff&eacute;rentes version de egcs et gcc des ports, comme
    avec les sources publiques de la FSF. &merged;</para>

    <para>La Libraire des threads a recu un certain nombre de mises
    &agrgave; jour dans la gestion des signaux, des corrections de bogues,
    et des am&eacute;liorations de la performance. Le support
    des thread dans &man.gdb.1; a &eacute;t&eacute; mis &agrgave; jour en 
    cons&eacute;quence. &merged;</para>

    <para>Diff&eacute;rents ajouts ont &eacute;t&eacute; effectu&eacute;s dans le support
    international: &os; dispose maintenant d'un support total des 
    cat&eacute;gories <literal>LC_MONETARY</literal>, 
    <literal>LC_NUMERIC</literal>, et <literal>LC_MESSAGES</literal>.
    Un certain nombre d'applications ont &eacute;t&eacute; mises &agrgave; jour
    pour supporter ces ajouts.</para>

    <para>Les noms locaux ont &eacute;t&eacute; chang&eacute;s pour augementer la 
    compatibilit&eacute; avec les noms de X11R6, tout comme avec d'autres
    version UNIX. Comme exemple le nom local 
    <literal>en_US.ISO_8859-1</literal> a &eacute;t&eacute; chang&eacute; en 
    <literal>en_US.ISO8859-1</literal>.  Les valeurs
    dans <filename>/etc/locale.alias</filename> permettent
    la compatibilit&eacute; descendante.&merged;</para>

    <para><filename>/usr/src/share/examples/BSD_daemon/</filename> dispose
    d'une version graphique de Beastie. &merged;</para>

    <para>Parmi l'ensemble du processus, de nombreuses pages de manuel
    ont &eacute;t&eacute; am&eacute;lior&eacute;es, que cela soit dans les termes ou dans
    le formattage de leur contenu. &merged;</para>




    <sect3>
      <title>Logiciels externes</title>

      <para><application>am-utils</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 6.0.7.</para>

      <para><application>bc</application> a &eacute;t&eacute; mis &agrave; jour de 
      la version 1.04 &agrave; la 1.06. &merged;</para>

      <para>La distribution de la librairie ISC  <application>BIND</application> 
      est maintenant compil&eacute; sous <filename>libisc</filename>.&merged;</para>

      <para><application>BIND</application> est maintenant compil&eacute; avec 
      l'option <literal>NOADDITIONAL</literal>, permettant &agrave; &man.named.8; 
      de fonctionner de façon plus consistente lors de certaines mauvaises 
      configurations. &merged;</para>

      <para><application>BIND</application> a &eacute;t&eacute; mis &agrave; jour 
      en version 8.3.1-REL. &merged;</para>

      <para><application>Binutils</application> ont &eacute;t&eacute; mis &agrave; 
      jour en version du 21 F&eacute;vrier 2002 depuis la branche FSF 2.12.</para>

      <para><application>bzip2</application> 1.0.2 a &eacute;t&eacute; 
      import&eacute;; cela permet d'avoir le programme &man.bzip2.1; et la 
      librairie <filename>libbz2</filename> dans le syst&egrave;me de base.
       &merged;</para>

      <para>L'<application>&eacute;diteur </application> &man.ee.1; a 
      &eacute;t&eacute; mis &agrave; jour en version 1.4.2. &merged;</para>

      <para><application>file</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 3.37.</para>

      <para><application>gcc</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 2.95.3. &merged;</para>

      <para>&man.gcc.1; utilise maintenant une version unifi&eacute; de 
      <filename>libgcc</filename> plutot qu'une version s&eacute;par&eacute;es 
      pour les programmes supportant les thread et ceux ne les supportant pas. 
      <filename>/usr/lib/libgcc_r.a</filename> peut donc être retir&eacute;.
      &merged;</para>

      <para>&man.gcc.1; supporte maintenant la variable d'environnement 
      <envar>GCC_OPTIONS</envar>, qui permet de positionner les options par 
      d&eacute;faut pour <application>GCC</application>. &merged;</para>

      <para><application>GNATS</application> a &eacute;t&eacute; mis &agrave; jour 
      en version 3.113. &merged;</para>
      
      <para><application>GNU awk</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 3.1.0.</para>

      <para><application>gperf</application> a &eacute;t&eacute; mis &agrave; jour 
      en version 2.7.2.</para>

      <para><application>groff</application> et l'ensemble des utilitaires 
      associ&eacute;s ont &eacute;t&eacute; mis &agrave; jour en version FSF 
      1.17.2. Cet import inclu la nouvelle macro &man.mdoc.7; (anciennement 
      <literal>mdocNG</literal>), qui &eacute;limine beaucoup des anciennes 
      limitations de son pr&eacute;d&eacute;cesseur. &merged;</para>

      <para><application>Heimdal</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 0.3f.</para>

      <para>La version de <application>IPFilter</application> fournie avec &os; 
      inclue maintenant le programme &man.ipfs.8;, permettant d'obtenir des 
      informations sur l'&eacute;tat des entr&eacute;es NAT et des r&egrave;gles 
      "stateful" &agrave; sauvegarder sur disque et a restaurer apr&egrave;s un 
      red&eacute;marrage. La fonctionnalit&eacute; a &eacute;t&eacute; 
      rajout&eacute; dans &man.rc.conf.5;. &merged;</para>

      <para>Le client <application>ISC DHCP</application> a &eacute;t&eacute; mis 
      &agrave; jour en version  3.0.1RC6.</para>

      <para><application>Kerberos IV</application> a &eacute;t&eacute; mis &agrave;
       jour en version 1.0.5. &merged;</para>

      <para>La commande &man.more.1; a &eacute;t&eacute; remplac&eacute;e par 
      &man.less.1;, bien sur il est toujours possible de lancer une commande 
      <command>more</command>. &merged; La version 371 de 
      <application>less</application> a &eacute;t&eacute; import&eacute;.</para>

      <para><application>libpcap</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 0.6.2. &merged;</para>

      <para><application>libreadline</application> a &eacute;t&eacute; mis &agrave;
       jour en version 4.2.</para>

      <para><application>Linux-PAM</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 0.75. &merged;</para>

      <para>Un certain nombre de nouveaux modules 
      <application>Linux-PAM</application> ont &eacute;t&eacute; ajout&eacute;s, 
      ceux-ci incluent: <filename>pam_ftp</filename>,
      <filename>pam_krb5</filename>,
      <filename>pam_nologin</filename>,
      <filename>pam_rootok</filename>,
      <filename>pam_securetty</filename>,
      <filename>pam_wheel</filename>.</para>

      <para><application>lukemftp</application> a remplac&eacute; le programme 
      &man.ftp.1; de &os;. Parmis les nouvelles fonctionnalit&eacute;s on trouve; 
      plus d'automatisation, meilleur conformit&eacute;e aux standards, 
      augmentation du taux de trtansfert et la possibilit&eacute; de configurer 
      des la ligne de commande. Certaines variables d'environnement et d'arguments 
      de ligne de commande ont chang&eacute;s.</para>

      <para><application>ncurses</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 5.2-20010512.</para>

      <para>La suite de programme <application>NTP</application> a 
      &eacute;t&eacute; mis &agrave; jour en version 4.1.0. &merged;</para>

      <para>La suite <application>OPIE</application>, de mot de passe unique, a 
      &eacute;t&eacute; mis &agrave; jour en version 2.32. &merged; Elle a 
      compl&egrave;tement remplac&eacute; les fonctionnalit&eacute;s de 
      <application>S/Key</application>.</para>

      <para><application>Perl</application> a &eacute;t&eacute; mis &agrave; jour 
      en version 5.6.0.</para>

      <para>&man.routed.8; a &eacute;t&eacute; mis &agrave; jour en version 2.22. 
      &merged;</para>

      <para arch="i386">La version 1.4.3 des utilitaires 
      <application>smbfs</application> en mode utilisateur ont &eacute;t&eacute; 
      import&eacute;s. &merged;</para>

      <para><application>tcpdump</application> a &eacute;t&eacute; mis &agrave; 
      jour en version 3.6.3. &merged;</para>

      <para>Le shell &man.csh.1; a &eacute;t&eacute; remplac&eacute; par 
      &man.tcsh.1;, bien sur il est lanceable sous le nom <command>csh</command>.
      <application>tcsh</application> a &eacute;t&eacute; mis &agrave; jour en 
      version 6.11. &merged;</para>

      <para>La version contribu&eacute;e de <application>tcp_wrappers</application> 
      inclue maintenant le d&eacute;mon &man.tcpd.8; helper daemon. Ce programme 
      n'est pas n&eacute;cessaire pour une installation standard de &os; 
      (car &man.inetd.8; inclue cette fonction), mais peut &ecirc;tre  
      n&eacute;cessaire pour des remplacants &agrave; &man.inetd.8;,  comme par 
      exemple <application>xinetd</application>.</para>

      <para><application>top</application> a &eacute;t&eacute; mis &agrave; jour 
      en version 3.5b12.</para>

      <para>&man.traceroute.8; obtient maintenant la valeur maximum du TTL depuis 
      la variable sysctl <varname>net.inet.ip.ttl</varname>. &merged;</para>

      <para>La base de donn&eacute;es des zones de  temps &agrave; &eacute;t&eacute;
       mis &agrave; jour en version <filename>tzdata2001d</filename>.&merged;</para>

      <sect4>
        <title>CVS</title>

        <para><application>cvs</application> a &eacute;t&eacute; mis &agrave; jour 
	en version 1.11.1p1. &merged;</para>

        <para>La valeur par d&eacute;faut de la variable  &man.cvs.1; 
	<envar>CVS_RSH</envar> est maintenant <literal>ssh</literal> plutot que 
	<literal>rsh</literal>. &merged;</para>

        <para>&man.cvs.1; support maintenant l'option <option>-T</option> 
	permettant de mettre &agrave; jour le fichier 
	<filename>CVS/Template</filename> du r&eacute;pertoire des sources. 
	&merged;</para>

	<para>&man.cvs.1; <literal>diff</literal> dispose maintenant de 
	l'option <option>-j</option> permettant de g&eacute;rer les 
	diff&eacute;rences entre les r&eacute;vision de plusieurs branches. 
	&merged;</para>
      </sect4>

      <sect4>
	<title>CVSup</title>

	<para><application>CVSup</application>, un utilitaire fr&eacute;quemment 
	utilis&eacute; dans la collection des ports de &os;, &eacute;tait 
	installable pr&eacute;cedemment via plusieurs ports et pacquetages. Les 
	ports ou pacquetages <filename role="package">net/cvsup-bin</filename> et 
	<filename role="package">net/cvsupd-bin</filename> ne sont plus 
	n&eacute;cessaires ou plus disponibles; il faut utilis&eacute; le port 
	<filename role="package">net/cvsup</filename> &agrave; la place. 
	&merged;</para>

	<para><application>CVSup</application> a &eacute;t&eacute; mis &agrave; 
	jour en version 16.1_3, qui est disponible dans la collection des ports de 
	&os; sous <filename role="package">net/cvsup</filename>. Cette mise 
	&agrave; jour fixe le tr&egrave;s vieux bogue (mais rencontr&eacute; que 
	tr&egrave;s r&eacute;cemment) qui affecte les marquages de temps 
	apr&egrave;s le dimanche 9 Septembre 2001 01:46:40 UTC 
	(1,000,000,000 seconds apr&egrave;s la naissance d'UNIX). &merged;</para>
      </sect4>


      <sect4 id="kame-userland">
        <title>KAME</title>
      <para></para>
      </sect4>
      
    </sect3>

    <sect3>
      <title>Collection des Ports/Packages</title>

      <para></para>
    </sect3>
  </sect2>
</sect1>

<sect1>
  <title>Mise a jour depuis une version pr&eacute;cedente de  &os;</title>


       <para>Si vous effectuez une mise &agrgave; jour depuis une version
        ant&eacute;rieure de &os;, vous avez g&eacute;n&eacute;ralement 3 options
        :</para>

    <itemizedlist>
      <listitem>
      <para>Utiliser l'option de mise &agrgave; jour binaire de &man.sysinstall.8;.Cette
            option est sans doute la plus rapide mais elle suppose
            que votre installation de &os; n'utilise aucune
            option sp&eacute;ciale de compilation.</para>
          </listitem>
          <listitem>
            <para>Faire une r&eacute;installation compl&egrave;te de &os;.
            Techniquement, ce n'est pas une m&eacute;thode de mis &agrgave; jour
            et, dans tous les cas, elle est moins pratique qu'une
            mise &agrgave; jour binaire dans le sens ou elle n&eacute;cessite de
            sauvegarder et de restaurer manuellement le contenu du
            r&eacute;pertoire <filename>/etc</filename>. Cependant,
            cela peut &ecirc;tre utile si vous d&eacute;sirez (ou si vous devez)
            modifier le partitionnement de vos disques.</para>
          </listitem>
          <listitem>
            <para>A partir du code source du r&eacute;pertoire <filename>/usr/src</filename>.
	    Cette option est plus souple mais demande plus d'espace disque, plus de temps et
            plus de comp&eacute;tences techniques. Faire une mise &agrgave; jour
            depuis une tr&egrave;s ancienne version de &os; peut &ecirc;tre
            probl&eacute;matique; dans de tels cas, il est g&eacute;n&eacute;ralement
            plus efficace de r&eacute;aliser une mise &agrgave; jour binaire ou
            une r&eacute;installation compl&egrave;te.</para>
          </listitem>
    </itemizedlist>

        <para>Veuillez lire le fichier <filename>INSTALL.TXT</filename>
	 pour plus d'informations, de
        pr&eacute;f&eacute;rence <emphasis>avant</emphasis> de commencer une mise &agrgave; jour.
        Si vous effectuez une mise &agrgave; jour depuis les sources,
        veuillez &eacute;galement consulter le fichier
	 <filename>/usr/src/UPDATING</filename>.</para>

        <para>Enfin, si vous d&eacute;sirez utiliser un des moyens de suivre
        les branches -STABLE ou -CURRENT de &os;, veuillez
        consulter la section 
       <ulink url="http://www.FreeBSD.org/handbook/current-stable.html"><quote>-CURRENT
       vs. -STABLE</quote></ulink>  <ulink url="http://www.FreeBSD.org/handbook/">du manuel 
       de r&eacute;f&eacute;rence de FreeBSD</ulink>.
       </para>

        <important>
            <para><emphasis>Important:</emphasis> La mise &agrgave; jour de &os; devrait,
            bien &eacute;videmment, &ecirc;tre r&eacute;alis&eacute;e uniquement apr&egrave;s avoir
            effectu&eacute; une sauvegarde de <emphasis>toutes</emphasis> 
	    les donn&eacute;es et des fichiers de configuration.</para>
        </important>

</sect1>

