freebsd/freebsd-src/usr.sbin/bootparamd/bootparamd/bootparamd.8
.\" @(#)bootparamd.8
.\" $FreeBSD$
.Dd November 8, 1989
.Dt BOOTPARAMD 8
.Os
.Sh NAME
.Nm bootparamd
.Nd boot parameter server
.Sh SYNOPSIS
.Nm
.Op Fl ds
.Op Fl r Ar router
.Op Fl f Ar file
.Sh DESCRIPTION
.Nm Bootparamd
is a server process that provides information to diskless clients
necessary for booting.
It consults the
.Pa /etc/bootparams
file. 
.Pp
This version will allow the use of aliases on the hostname in the
.Pa /etc/bootparams
file.
The returned hostname to the whoami request done by the booting client
will be the name that appears in 
.Pa /etc/bootparams
and not the canonical name.
In this way you can keep the answer short enough
so that machines that can not handle long hostnames won't fail during boot.
.Sh OPTIONS
.Bl -tag -width Fl
.It Fl d
Display the debugging information.
.It Fl s
Log the debugging information with syslog. 
.It Fl r Ar router
The default router (a machine or an IP-address).
This defaults to the machine running the server.
.It Fl f Ar file
The file to use as boot parameter file instead of
.Pa /etc/bootparams .
.El
.Sh FILES
.Bl -tag -width /etc/bootparams -compact
.It /etc/bootparams
.El
.Sh EXAMPLES
When netbooting diskless SunOS/Xkernel SPARCstations the booted SunOS kernel
also broadcasts to the all-0 address. The SunOS kernel hangs until it
receives a reply. To accomodate this behaviour add an alias address 
that responds to an all-0 broadcast. So, add something like 'ifconfig xl0
192.168.200.254 netmask 255.255.255.255 broadcast 192.168.200.0 alias'
on the relevant network interface on your bootparamd server. The alias
address must of course be free for use.
.Sh BUGS
You may find the syslog loggings to be verbose.
.Sh AUTHORS
Written by
.An Klas Heggemann Aq klas@nada.kth.se
