freebsd/freebsd-src/usr.sbin/bootparamd/bootparamd/bootparamd.8
.\" @(#)bootparamd.8
.TH BOOTPARAMD 8 "8 November 1989"
.SH NAME
bootparamd \- boot parameter server
.SH SYNOPSIS
.B bootparamd
[
.B \-d
]
[
.B \-s
]
[
.B \-r 
router
]
[
.B \-f
file
]
.SH DESCRIPTION
.IX "bootparamd daemon" "" "\fLbootparamd\fP daemon"
.LP
.B bootparamd
is a server process that provides information to diskless clients
necessary for booting. It consults 
.B /etc/bootparams
file. 
.LP
This version will allow the use of aliases on the hostname in the
.B /etc/bootparams
file. The returned hostname to the whoami request done by the booting client
will be the name that appears in 
.B /etc/bootparams
and not the canonical name. In this way you can keep the answer short enough
so that machines that can not handle long hostnames won't fail during boot.
.SH OPTIONS
.TP
.B \-d
Display the debugging information.
.TP
.B \-s
Log the debugging information with syslog. 
.TP
.B 
\-r router
The default router (a machine or an IP-address).
This defaults to the machine running the server.
.TP
.B
\-f file
The file to use as boot parameter file instead of /etc/bootparams.
.SH FILES
.PD 0
.TP 20
.B /etc/bootparams
.PD

.SH BUGS
You may find the syslog loggings to verbose.

.SH AUTHOR
Written by Klas Heggemann <klas@nada.kth.se>


