freebsd/freebsd-src/lib/libpam/modules/pam_ftp/pam_ftp.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 8, 2001
.Dt PAM_FTP 8
.Os
.Sh NAME
.Nm pam_ftp
.Nd FTP PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_ftp
.Op Ar options
.Sh DESCRIPTION
The FTP authentication service module for PAM,
.Nm
provides functionality for only one PAM category:
authentication.
In terms of the 
.Ar module-type
parameter, this is the
.Dv auth
feature.
It also provides a null function for session management.
.Ss FTP Authentication Module
The FTP authentication component
.Pq Fn pam_sm_authenticate ,
authenticates the anonymous user
.Pq usually Do anonymous Dc or Do ftp Dc
usually by simply requesting an email address as a password.
The supplied email address is broken up
into its username and host parts,
and these are assigned to the
.Dv PAM_RUSER
and
.Dv PAM_RHOST
facilities respectively.
.Pp
This module is intended for the
.Xr ftpd 8
service.
.Pp
The following options may be passed to the authentication module:
.Bl -tag -xwidth ".Cm use_first_pass"
.It Cm debug
.Xr syslog 3
debugging information at
.Dv LOG_DEBUG
level.
.It Cm no_anon
Disallow anonymous access.
.It Cm ignore
Ingnore the password supplied,
and do not use its constituent parts
.Pq username and hostname
as
.Dv PAM_RUSER
and
.Dv PAM_RHOST
respectively.
.El
.Sh SEE ALSO
.Xr ftp 1 ,
.Xr syslog 3 ,
.Xr pam.conf 5 ,
.Xr ftpd 8 ,
.Xr pam 8
