freebsd/freebsd-src/share/man/man7/hier.7
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\" $FreeBSD$
.\"
.Dd May 30, 2023
.Dt HIER 7
.Os
.Sh NAME
.Nm hier
.Nd layout of file systems
.Sh SYNOPSIS
A sketch of the file system hierarchy.
.Sh DESCRIPTION
.Bl -tag -width "/libexec/"
.It Pa /
root directory of the file system
.It Pa /bin/
user utilities fundamental to both single-user and multi-user environments
.It Pa /boot/
programs and configuration files used during operating system bootstrap
.Pp
.Bl -tag -width "nvmecontrol/" -compact
.It Pa defaults/
default bootstrapping configuration files; see
.Xr loader.conf 5
.It Pa dtb/
compiled flattened device tree (FDT) files; see
.Xr fdt 4
and
.Xr dtc 1
.It Pa efi/
mount point for the EFI System Partition (ESP) on UEFI systems
.It Pa firmware/
loadable kernel modules containing binary firmware for hardware that needs
firmware downloaded to it to function
.It Pa kernel/
pure kernel executable (the operating system loaded into memory at boot time)
and kernel modules
.It Pa modules/
third-party loadable kernel modules, such as the ones installed from
.Xr ports 7
.It Pa overlays/
compiled flattened device tree (FDT) overlays; see
.Xr fdt 4
and
.Xr dtc 1
.It Pa zfs/
.Xr zfs 8
pool cache files
.El
.It Pa /compat/
normally a link to
.Pa /usr/compat .
If not, then the
.Pa /usr/compat
comments apply
.It Pa /dev/
device special files managed by
.Xr devfs 5
.Pp
.Bl -tag -width "nvmecontrol/" -compact
.It Pa fd/
file descriptor files; see
.Xr fd 4
.El
.It Pa /etc/
system configuration files and scripts
.Pp
.Bl -tag -width "nvmecontrol/" -compact
.It Pa bluetooth/
bluetooth configuration files
.It Pa defaults/
default system configuration files; see
.Xr rc 8
.It Pa localtime
local timezone information; see
.Xr ctime 3
.It Pa mail/
sendmail control files
.It Pa mtree/
mtree configuration files; see
.Xr mtree 8
.It Pa pam.d/
configuration files for the Pluggable Authentication Modules (PAM) library
.It Pa periodic/
scripts that are run daily, weekly, and monthly, via
.Xr cron 8 ;
see
.Xr periodic 8
.It Pa ppp/
PPP configuration files; see
.Xr ppp 8
.It Pa rc.d/
system and daemon startup/control scripts; see
.Xr rc 8
.It Pa security/
OpenBSM audit configuration files; see
.Xr audit 8
.It Pa ssh/
OpenSSH configuration files; see
.Xr ssh 1
.It Pa ssl/
OpenSSL configuration files
.El
.It Pa /home/
users' HOME directories;
the layout is not standardized, but a typical interactive user
.Dv beastie
might receive their own directory
.Pa /home/beastie
.It Pa /lib/
critical system libraries needed for binaries in
.Pa /bin
and
.Pa /sbin
.Pp
.Bl -tag -width "nvmecontrol/" -compact
.It Pa casper/
service-specific
.Xr libcasper 3
Capsicum support libraries
.It Pa geom/
class-specific libraries for the
.Xr geom 8
utility
.It Pa nvmecontrol/
vendor-specific libraries to extend the
.Xr nvmecontrol 8
utility
.El
.It Pa /libexec/
critical system utilities needed for binaries in
.Pa /bin
and
.Pa /sbin
.It Pa /media/
contains subdirectories to be used as mount points for removable media such as
USB drives, CDs and DVDs
.It Pa /mnt/
empty directory commonly used by
system administrators as a temporary mount point
.It Pa /net/
automounted NFS shares; see
.Xr auto_master 5
.It Pa /nonexistent/
a non-existent directory; by convention, it serves as a home directory for
special user accounts that need no home directory; see also
.Pa /var/empty/
.It Pa /proc/
process file system; see
.Xr procfs 5
.It Pa /rescue/
statically linked programs for emergency recovery; see
.Xr rescue 8
.It Pa /root/
root's HOME directory
.It Pa /sbin/
system programs and administration utilities
fundamental to both single-user and multi-user environments
.It Pa /tmp/
temporary files that are not guaranteed to persist across system reboots
.It Pa /usr/
contains the majority of user utilities and applications
.Pp
.Bl -tag -width "freebsd-dist/" -compact
.It Pa bin/
common utilities, programming tools, and applications
.It Pa compat/
files needed to support binary compatibility with other operating systems; see
.Xr linux 4
.It Pa freebsd-dist/
distribution files
.Pq like base.txz ; see
.Xr release 7
and
.Xr bsdinstall 8
.It Pa include/
standard C include files
.Pp
.It Pa lib/
shared and archive
.Xr ar 1 Ns -type
libraries
.Pp
.Bl -tag -width Fl -compact
.It Pa compat/
shared libraries for compatibility
.It Pa debug/
standalone debug data for the kernel and base system libraries and binaries
.It Pa dtrace/
DTrace library scripts
.It Pa engines/
OpenSSL (Cryptography/SSL toolkit) dynamically loadable engines
.El
.Pp
.It Pa libdata/
miscellaneous utility data files
.Pp
.Bl -tag -width Fl -compact
.It Pa gcc/
GCC configuration data
.It Pa ldscripts/
linker scripts; see
.Xr ld 1
.It Pa pkgconfig/
.Xr pc 5 Pq Pa ports/devel/pkgconf
files: collections of compiler flags, linker flags, and other information
relevant to library use
.El
.Pp
.It Pa libexec/
system daemons & system utilities (executed by other programs)
.Pp
.Bl -tag -width Fl -compact
.It Pa aout/
utilities to manipulate a.out executables
.It Pa elf/
utilities to manipulate ELF executables
.It Pa lpr/
utilities and filters for LP print system; see
.Xr lpr 1
.It Pa sendmail/
the
.Xr sendmail 8
binary; see
.Xr mailwrapper 8
.It Pa sm.bin/
restricted shell for
.Xr sendmail 8 ;
see
.Xr smrsh 8
.El
.Pp
.It Pa local/
local executables, libraries, etc.
Also used as the default destination for the
.Xr ports 7
framework.
Within
.Pa local/ ,
the general layout sketched out by
.Nm
for
.Pa /usr
should be used.
Exceptions are the ports documentation
.Po in
.Pa share/doc/<port>/ Ns Pc ,
and
.Pa /usr/local/etc
.Po mimics
.Pa /etc Ns Pc .
.It Pa obj/
architecture-specific target tree produced by building
.Fx
from source; see
.Xr build 7
.It Pa ports/
.Fx
ports collection; see
.Xr ports 7
.It Pa sbin/
system daemons & system utilities (executed by users)
.It Pa share/
architecture-independent files
.Pp
.Bl -tag -width Fl -compact
.It Pa calendar/
a variety of pre-fab calendar files; see
.Xr calendar 1
.It Pa dict/
word lists; see
.Xr look 1
.Pp
.Bl -tag -width Fl -compact
.It Pa freebsd
.Fx Ns -specific
terms, proper names, and jargon
.It Pa web2
words from Webster's Second International
.El
.Pp
.It Pa doc/
miscellaneous documentation
.It Pa examples/
various examples for users and programmers
.It Pa firmware/
firmware images loaded by userland programs
.It Pa games/
ASCII text files used by various games
.It Pa keys/
known trusted and revoked keys
.Pp
.Bl -tag -width Fl -compact
.It Pa pkg/
fingerprints for
.Xr pkg 7
and
.Xr pkg 8
.El
.Pp
.It Pa locale/
localization files; see
.Xr setlocale 3
.It Pa man/
manual pages
.It Pa misc/
miscellaneous system-wide files
.Pp
.Bl -tag -width Fl -compact
.It Pa fonts/
???
.It Pa termcap
terminal characteristics database; see
.Xr termcap 5
.El
.Pp
.It Pa mk/
templates for make; see
.Xr make 1
.It Pa nls/
national language support files
.It Pa security/
data files for security policies such as
.Xr mac_lomac 4
.It Pa sendmail/
.Xr sendmail 8
configuration files
.It Pa skel/
example
.Pa .\&
(dot) files for new accounts
.It Pa snmp/
MIBs, example files and tree definitions for the SNMP daemon
.Pp
.Bl -tag -width Fl -compact
.It Pa defs/
tree definition files for use with
.Xr gensnmptree 1
.It Pa mibs/
MIB files
.El
.Pp
.It Pa syscons/
files used by syscons; see
.Xr syscons 4
.Pp
.Bl -tag -width Fl -compact
.It Pa fonts/
console fonts; see
.Xr vidcontrol 1
and
.Xr vidfont 1
.It Pa keymaps/
console keyboard maps; see
.Xr kbdcontrol 1
and
.Xr kbdmap 1
.It Pa scrnmaps/
console screen maps
.El
.Pp
.It Pa sysroot/
files necessary for the -sysroot compiler/linker argument to build non-native
binaries
.Pp
.Bl -tag -width Fl -compact
.It Pa VERSION/
files for
.Fx
release VERSION.
By convention,
.Dq VERSION
matches
.Xr uname 1
.Fl r .
.Pp
.Bl -tag -width Fl -compact
.It Pa MACHINE.MACHINE_ARCH/
represent the binary ABI for these files.
.Dq MACHINE
matches
.Xr uname 1
.Fl m .
.Dq MACHINE_ARCH
matches
.Xr uname 1
.Fl p .
.El
.El
.Pp
.It Pa tabset/
tab description files for a variety of terminals; used in the termcap file;
see
.Xr termcap 5
.It Pa vi/
localization support and utilities for
.Xr vi 1
.It Pa vt/
files used by vt; see
.Xr vt 4
.Pp
.Bl -tag -width Fl -compact
.It Pa fonts/
console fonts; see
.Xr vidcontrol 1
and
.Xr vidfont 1
.It Pa keymaps/
console keyboard maps; see
.Xr kbdcontrol 1
and
.Xr kbdmap 1
.\" .It Pa scrnmaps/
.\" console screen maps
.El
.Pp
.It Pa zoneinfo/
timezone configuration information; see
.Xr tzfile 5
.El
.Pp
.It Pa src/
.Fx
source code; see
.Xr development 7 .
The layout of the source tree is described by the top-level
.Pa README.md
file.
.Pp
.It Pa tests/
the
.Fx
test suite; see
.Xr tests 7
.El
.It Pa /var/
multi-purpose log, temporary, transient, and spool files
.Pp
.Bl -tag -width "preserve/" -compact
.It Pa account/
system accounting files
.Pp
.Bl -tag -width "freebsd-update/" -compact
.It Pa acct
execution accounting file; see
.Xr acct 5
.El
.Pp
.It Pa at/
timed command scheduling files; see
.Xr at 1
.Pp
.Bl -tag -width Fl -compact
.It Pa jobs/
directory containing job files
.It Pa spool/
directory containing output spool files
.El
.Pp
.It Pa backups/
miscellaneous backup files
.It Pa cache/
miscellaneous cached files
.Pp
.Bl -tag -width Fl -compact
.It Pa pkg/
cached packages for
.Xr pkg 8
.El
.Pp
.It Pa crash/
default directory to store kernel crash dumps; see
.Xr crash 8
and
.Xr savecore 8
.It Pa cron/
files used by cron; see
.Xr cron 8
.Pp
.Bl -tag -width Fl -compact
.It Pa tabs/
crontab files; see
.Xr crontab 5
.El
.Pp
.It Pa db/
miscellaneous automatically generated system-specific database files
.Pp
.Bl -tag -width Fl -compact
.It Pa freebsd-update/
.Xr freebsd-update 8
work directory for temporary files and downloaded updates
.El
.It Pa empty/
empty directory for use by programs that need a specifically empty directory.
Used for instance by
.Xr sshd 8
for privilege separation
.It Pa games/
miscellaneous game status and score files
.It Pa heimdal/
Kerberos server databases; see
.Xr kdc 8
.It Pa log/
miscellaneous system log files
.Pp
.Bl -tag -width Fl -compact
.It Pa utx.lastlogin
last login log; see
.Xr getutxent 3
.It Pa utx.log
login/logout log; see
.Xr getutxent 3
.El
.Pp
.It Pa mail/
user mailbox files
.It Pa msgs/
system messages database; see
.Xr msgs 1
.It Pa preserve/
temporary storage for files following a crash of an editor; see
.Xr vi 1
.It Pa quotas/
file system quota information files
.It Pa run/
system information files describing various info about
system since it was booted
.Pp
.Bl -tag -width Fl -compact
.It Pa bhyve/
.Xr bhyve 8
virtual machine
.Xr unix 4 Ns -domain sockets
.It Pa ppp/
writable by the
.Dq network
group for command connection sockets; see
.Xr ppp 8
.It Pa utx.active
database of current users; see
.Xr getutxent 3
.El
.Pp
.It Pa rwho/
rwho data files; see
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1
.It Pa spool/
miscellaneous printer and mail system spooling directories
.Pp
.Bl -tag -width Fl -compact
.It Pa clientmqueue/
undelivered submission mail queue; see
.Xr sendmail 8
.It Pa ftp/
ftp root directory; see
.Xr ftpd 8
.It Pa mqueue/
undelivered mail queue; see
.Xr sendmail 8
.It Pa output/
line printer spooling directories
.El
.Pp
.It Pa tmp/
temporary files that are kept between system reboots
.Pp
.Bl -tag -width Fl -compact
.It Pa vi.recover/
.Xr vi 1
recovery files
.El
.Pp
.It Pa yp/
the NIS maps; see
.Xr yp 8
.El
.El
.Sh NOTES
This manual page documents the default
.Fx
file system layout, but the actual hierarchy on a given system is defined at
the system administrator's discretion.
A well-maintained installation will include a customized version of
this document.
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr find 1 ,
.Xr grep 1 ,
.Xr ls 1 ,
.Xr whereis 1 ,
.Xr which 1
.Sh HISTORY
A
.Nm
manual page appeared in
.At v7 .
