freebsd/freebsd-src/share/man/man7/hier.7
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt HIER 7
.Os
.Sh NAME
.Nm hier
.Nd layout of filesystems
.Sh DESCRIPTION
A sketch of the filesystem hierarchy.
.Bl -tag -width "/stand/"
.It Li /
root directory of the filesystem
.It Li /bin/
user utilities fundamental to both single-user and multi-user environments
.It Li /boot/
programs and configuration files used during operating system bootstrap
.Pp
.Bl -tag -width defaults/ -compact
.It Li defaults/
default bootstrapping configuration files; see
.Xr loader.conf 5
.It Li kernel/
pure kernel executable (the operating system loaded into memory
at boot time).  
.It Li modules/
third-part loadable kernel modules;
see 
.Xr kldstat 8 
.El
.It Li /dev/
block and character device files
.Pp
.Bl -tag -width MAKEDEV -compact
.It Li MAKEDEV
script for creating device files;
see
.Xr MAKEDEV 8
.It Li fd/ 
file descriptor files;
see
.Xr \&fd 4
.El
.It Li /etc/
system configuration files and scripts 
.Pp
.Bl -tag -width "disklabels/" -compact
.It Li defaults/
default system configuration files;
see
.Xr rc 8
.It Li gnats/
gnats configuration files;
see
.Xr send-pr 1
.It Li isdn/
isdn4bsd configuration files;
see
.Xr isdnd 8
.It Li kerberosIV/ 
configuration files for the kerberos version IV;
see
.Xr kerberos 1
.It Li localtime
local timezone information;
see
.Xr ctime 3
.It Li mail/
spam-filtering information
.It Li mtree/ 
mtree configuration files;
see
.Xr mtree 8
.It Li namedb/ 
named configuration files;
see
.Xr named 8
.It Li periodic/
scripts that are run daily, weekly, and monthly, via
.Xr cron 8 ;
see
.Xr periodic 8
.It Li ppp/
ppp configuration files;
see 
.Xr ppp 8
.It Li ssl/
OpenSSL configuration files
.It Li uucp/
uucp configuration files;
see
.Xr uucp 1
.El
.It Li /mnt/
empty directory commonly used by
system administrators as a temporary mount point
.It Li /proc/
process file system;
see
.Xr procfs 5 ,
.Xr mount_procfs 8
.It Li /root/
root's HOME directory
.It Li /sbin/
system programs and administration utilities
fundamental to both single-user and multi-user environments
.It Li /stand/
programs used in a standalone environment
.It Li /tmp/ 
temporary files
.It Li /usr/
contains the majority of user utilities and applications 
.Pp
.Bl -tag -width "libdata/" -compact
.It Li bin/
common utilities, programming tools, and applications 
.It Li games/
useful and semi-frivolous programs
.It Li include/
standard C include files
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li arpa/
C include files for Internet service protocols
.It Li cam/
C include files for the Common Access Methods Layer
.Bl -tag -width "kerberosIV/" -compact
.It scsi/
The SCSI device on top of CAM
.El
.It Li dev/
C include files for programming various
.Fx
devices
.Bl -tag -width "kerberosIV/" -compact
.It Li ppbus/
The parallel port bus;
see
.Xr ppbus 4
.It Li usb/
The USB subsystem
.El
.It Li g++/
GNU C++ include files
.Bl -tag -width "kerberosIV/" -compact
.It Li std/
GNU C++ libstdc++ include files
.El
.It Li isc/
ISC utility library libisc include files
.It Li isofs/
.Bl -tag -width "kerberosIV/" -compact
.It Li cd9660/
iso9660 filesystem
.El
.It Li kerberosIV/
C include files for kerberos authentication package;
see
.Xr kerberos 1
.It Li machine/
machine-specific C include files
.It Li msdosfs/
MS-DOS file system
.It Li net/
misc network C include files
.It Li netatalk/
Appletalk protocol
.It Li netatm/
ATM include files;
see
.Xr atm 8
.It Li netinet/
C include files for Internet standard protocols;
see
.Xr inet 4
.It Li netinet6/
C include files for Internet protocol version 6;
see
.Xr inet6 4
.It Li netipx/
IPX/SPX protocol stacks
.It Li netkey/
kernel key-management service
.It Li netns/
Xerox NS protocols
.It Li netnatm/
NATM include files;
see
.Xr natm 4
.It Li nfs/
C include files for NFS (Network File System)
.It Li objc/
Objective C include files
.It Li openssl/
OpenSSL (Cryptography/SSL toolkit) headers
.It Li pccard/
PC-CARD controllers
.It Li posix4/
POSIX real-time extensions includes;
see
.Xr p1003_1b 9
.It Li protocols/
C include files for Berkeley service protocols
.It Li readline/
get a line from a user, with editing;
see
.Xr readline 3
.It Li rpc/
remote procedure calls;
see
.Xr rpc 3
.It Li rpcsvc/
definition of RPC service structures; see
.Xr rpc 3
.It Li security/
PAM; see
.Xr pam 8
.It Li ss/
MIT SIPB
.Sq subsystem
library, part of Kerberos IV.
.It Li sys/
system C include files (kernel data structures)
.\" .It Li tcl/
.\" Tcl language;
.\" see
.\" .Xr Tcl n
.\" .Bl -tag -width "kerberosIV/" -compact
.\" .It Li generic/
.\" ???
.\" .It Li unix/
.\" ???
.\" .El
.It Li ufs/
C include files for UFS (The U-word File System)
.Bl -tag -width "kerberosIV/" -compact
.It Li ffs/
Fast filesystem
.It Li mfs/
memory file system;
see
.Xr mount_mfs 8
.It Li ufs/
UFS filesystem
.El
.It Li vm/
virtual memory;
see 
.Xr vmstat 8
.El
.Pp
.It Li lib/
archive libraries
.Bl -tag -width Fl -compact
.It Li aout/
a.out archive libraries
.It Li compat/
shared libraries for compatibility
.Bl -tag -width Fl -compact
.It Li aout/
a.out backward compatibility libraries
.El
.El
.Pp
.It Li libdata/
misc. utility data files
.Bl -tag -width Fl -compact
.It Li doscmd/
files used by doscmd (drivers, fonts, etc.);
see
.Xr doscmd 1
.Bl -tag -width 6n -compact
.It Li fonts/
fonts used by doscmd
.El
.It Li gcc/
???
.It Li ldscripts/
linker scripts;
see
.Xr ld 1
.It Li lint/
various prebuilt lint libraries;
see 
.Xr lint 1
.It Li msdosfs/
Character set conversion tables
.It Li perl/
.Bl -tag -width Fl -compact
.It Li 5.00503/
contains Perl modules for Perl version 5.00503;
see
.Xr perl 1
.El
.It Li stallion/
holds the download firmware images
.El
.Pp
.It Li libexec/
system daemons & system utilities (executed by other programs)
.Bl -tag -width Fl -compact
.It Li aout/
utilities to manipulate a.out executables
.It Li elf/
utilities to manipulate ELF executables
.It Li lpr/
utilities and filters for LP print system;
see
.Xr lpr 1
.It Li sm.bin/
restricted shell for sendmail;
see 
.Xr smrsh 8
.It Li uucp/
uucp utilities;
see
.Xr uucp 1
.El
.Pp
.It Li local/
local executables, libraries, etc.
Also used as the default destination for the
.Fx
ports framework.
Within local/, the general layout sketched out by
.Xr hier 7
for /usr
should be used.  Exceptions are the man directory (directly under local/
rather than under local/share/), ports documentation (in share/doc/<port>/),
and /usr/local/etc (mimics /etc).
.It Li obj/
architecture-specific target tree produced by building the /usr/src tree
.It Li ports/
The
.Fx
ports collection (optional).
.It Li sbin/
system daemons & system utilities (executed by users)
.It Li share/
architecture-independent files
.Pp
.Bl -tag -width "calendar/" -compact
.It Li calendar/
a variety of pre-fab calendar files;
see
.Xr calendar 1
.It Li dict/
word lists;
see
.Xr look 1
.Pp
.Bl -tag -width Fl -compact
.It Li words
common words
.It Li web2
words from Webster's 2nd International
.It Li papers/
reference databases;
see
.Xr refer 1
.It Li special/
custom word lists;
see
.Xr spell 1
.El
.Pp
.It Li doc/
miscellaneous documentation;
source for most of the printed
.Bx
manuals (available
from the
.Tn USENIX
association)
.Bl -tag -width Fl -compact
.It Li FAQ/
Frequently Asked Questions
.It Li IPv6/
implementation notes for IPv6
.It Li bind/
documents pertaining to BIND (the Berkeley Internet Name Domain)
.It Li es/
Spanish translations of documents in /usr/share/doc
.It Li handbook/
.Fx
Handbook
.It Li ja/
Japanese translations of documents in /usr/share/doc
.It Li ncurses/
HTML documents pertaining to ncurses;
see
.Xr ncurses 3X
.It Li ntp/
HTML documents pertaining to the Network Time Protocol
.It Li papers/
UNIX Papers
.It Li psd/
UNIX Programmer's Supplementary Documents
.It Li ru/
Russian translations of documents in /usr/share/doc
.It Li smm/
UNIX System Manager's Manual
.It Li tutorials/
.Fx
tutorials
.It Li usd/
UNIX User's Supplementary Documents
.It Li zh/
Chinese translations of documents in /usr/share/doc
.El
.Pp
.It Li examples/
various examples for users and programmers
.It Li games/
ASCII text files used by various games
.It Li groff_font/
device description file for device name
.It Li info/
GNU Info hypertext system
.It Li isdn/
ISDN
.It Li libg++/
libg++'s genclass prototype/template class files
.It Li locale/
localization files;
see
.Xr setlocale 3
.It Li man/
manual pages 
.It Li me/
macros for use with the me macro package;
see
.Xr me 7
.It Li misc/
misc system-wide ASCII text files
.Bl -tag -width Fl -compact
.It Li fonts/
???
.It Li pcvtfonts/
pcvt fonts;
see
.Xr pcvt 4
.It Li termcap
terminal characteristics database;
see
.Xr termcap 5
.El
.It Li mk/
templates for make;
see
.Xr make 1
.It Li nls/
national language support files;
see 
.Xr mklocale 1
.It Li pcvt/
pcvt documentation and etc examples;
see
.Xr pcvt 4
.It Li perl/
perl library files;
see
.Xr perl 1
.It Li sendmail/ 
sendmail configuration files;
see
.Xr sendmail 8
.It Li skel/
example . (dot) files for new accounts
.It Li syscons/
files used by syscons;
see
.Xr syscons 4
.Bl -tag -width "scrnmaps/xx" -compact
.It Li fonts/
console fonts;
see
.Xr vidcontrol 1
and
.Xr vidfont 1
.It Li keymaps/
console keyboard maps;
see
.Xr kbdcontrol 1
and
.Xr kbdmap 1
.It Li scrnmaps/
console screen maps
.El
.It Li tabset/
tab description files for a variety of terminals; used in 
the termcap file;
see
.Xr termcap 5
.It Li tmac/
text processing macros;
see
.Xr nroff 1
and 
.Xr troff 1
.It Li vi/
localization support and utilities for
.Xr vi 1
.It Li zoneinfo/
timezone configuration information;
see
.Xr tzfile 5
.El
.It Li src/
BSD, third-party, and/or local source files
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li bin/
source code for files in /bin 
.It Li contrib/
source code for contributed software
.It Li crypto/
source code for contributed cryptography software
.It Li etc/
source code for files in /etc
.It Li games/
source code for files in /usr/games
.It Li gnu/
Utilities covered by the GNU General Public License
.It Li include/
source code for files in /usr/include
.It Li kerberosIV/
source code for kerberos version IV
.It Li lib/
source code for files in /usr/lib
.It Li libexec/
source code for files in /usr/libexec
.It Li release/
files required to produce a
.Fx 
release
.It Li sbin/
source code for files in /sbin
.It Li secure/
build directory for files in /usr/src/crypto
.It Li share/
source for files in /usr/share
.It Li sys/
kernel source code
.It Li tools/
tools used for maintenance and testing of
.Fx
.It Li usr.bin/
source code for files in /usr/bin
.It Li usr.sbin/
source code for files in /usr/sbin
.El
.Pp
.It Li X11R6/
X11R6 distribution executables, libraries, etc (optional).
.Bl -tag -width "include/" -compact
.It Li bin/
X11R6 binaries (servers, utilities, local packages/ports).
.It Li etc/
X11R6 configuration files and scripts.
.It Li include/
X11R6 include files.
.It Li lib/
X11R6 libraries.
.It Li man/
X11R6 manual pages.
.It Li share/
architecture-independent files.
.El
.El
.It Li /var/
multi-purpose log, temporary, transient, and spool files
.Pp
.Bl -tag -width "preserve/" -compact
.It Li account/ 
system accounting files
.Pp
.Bl -tag -width Fl -compact
.It Li acct
execution accounting file;
see
.Xr acct 5
.El
.Pp
.It Li at/
timed command scheduling files;
see
.Xr \&at 1
.Bl -tag -width "preserve/" -compact
.It Li jobs/
directory containing job files
.It Li spool/
directory containing output spool files 
.El
.Pp
.It Li backups/
misc. backup files
.It Li crash/
default directory to store kernel crash dumps; see
.Xr crash 8
and
.Xr savecore 8
.It Li cron/
files used by cron;
see
.Xr cron 8
.Bl -tag -width "preserve/" -compact
.It Li tabs/
crontab files;
see
.Xr crontab 5
.El
.Pp
.It Li db/ 
misc. automatically generated system-specific database files
.It Li games/ 
misc. game status and score files
.It Li log/ 
misc. system log files
.Pp
.Bl -tag -width Fl -compact
.It Li wtmp
login/logout log;
see
.Xr wtmp 5
.El
.Pp
.It Li mail/ 
user mailbox files
.It Li preserve/
temporary home of files preserved after an accidental death
of an editor;
see
.Xr \&ex 1 
.It Li msgs/
system messages database;
see
.Xr msgs 1
.It Li quotas/ 
filesystem quota information files
.It Li run/
system information files describing various info about
system since it was booted
.Pp
.Bl -tag -width Fl -compact
.It Li utmp
database of current users;
see
.Xr utmp 5
.El
.Pp
.It Li rwho/ 
rwho data files;
see
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1
.It Li spool/ 
misc. printer and mail system spooling directories
.Pp
.Bl -tag -width Fl -compact
.It Li ftp/ 
commonly ~ftp; the anonymous ftp root directory
.It Li mqueue/ 
undelivered mail queue;
see
.Xr sendmail 8
.It Li output/
line printer spooling directories
.It Li secretmail/ 
secretmail spool directory;
see
.Xr xget 1
.It Li uucp/ 
uucp spool directory
.It Li uucppublic/
commonly ~uucp; public uucp temporary directory
.El
.Pp
.It Li tmp/ 
temporary files that are kept between system reboots
.Bl -tag -width Fl -compact
.It Li vi.recover/
the directory where recovery files are stored
.El
.It Li yp/
the NIS maps
.El
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr find 1 ,
.Xr finger 1 ,
.Xr grep 1 ,
.Xr ls 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr which 1 ,
.Xr fsck 8
.Sh HISTORY
A
.Nm
manual page appeared in
.At v7 .
