freebsd/freebsd-src/share/man/man7/networking.7
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2023 Alexander Ziaee
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 12, 2023
.Dt "NETWORKING" 7
.Os
.Sh NAME
.Nm networking ,
.Nm wifi
.Nd quickstart guide to connecting to a network
.Sh DESCRIPTION
In the following examples, it is assumed that we are connecting to Ethernet
with the first interface found by the
.Xr em 4
driver, and Wi-Fi with the first interface found by the
.Xr iwn 4
driver, though your hardware will vary.
.Sh EXAMPLES
.Bl -tag -width 0n
.It Sy Connecting to an Ethernet network with DHCP:
.Bd -literal -offset 2n
.Ic # dhclient em0
.Ed
.It Sy Connecting to a cellular network with USB tethering:
.Pp
Load the USB tethering driver,
.Xr urndis 4 :
.Bd -literal -offset 2n
.Ic # kldload urndis
.Ed
.Pp
Ask for a DHCP lease on the USB tethering interface:
.Bd -literal -offset 2n
.Ic # dhclient ue0
.Ed
.It Sy Connecting to a Wi-Fi network:
.Pp
Identify your Wi-Fi hardware:
.Bd -literal -offset 2n
.Ic % sysctl net.wlan.devices
.Ed
.Pp
Configure your Wi-Fi hardware as wlan0 interface:
.Ed
.Bd -literal -offset 2n
.Ic # sysrc wlans_iwn0="wlan0"
.Ed
.Pp
Set that interface to negotiate a DHCP lease with
.Xr wpa_supplicant 8 :
.Bd -literal -offset 2n
.Ic # sysrc ifconfig_wlan0="WPA SYNCDHCP"
.Ed
.Pp
Enter the details of the Wi-Fi network:
.Bd -literal -offset 2n
.Ic # wpa_passphrase "myssid" "mypassphrase" >> wpa_supplicant.conf
.Ed
.Pp
Restart the network interface daemon:
.Bd -literal -offset 2n
.Ic # service netif restart
.Ed
.Pp
.It Sy Scanning for Wi-Fi networks:
.Bd -literal -offset 2n
.Ic % ifconfig wlan0 scan
.Ed
.It Sy Airplane mode:
.Bd -literal -offset 2n
.Ic # service netif stop
.Ed
.El
.Sh SEE ALSO
.Xr bsdconfig 8 ,
.Xr dhclient 8 ,
.Xr ifconfig 8 ,
.Xr wpa_passphrase 8 ,
.Xr wpa_supplicant 8
.Pp
The Advanced Networking chapter of the
.Fx
Handbook.
.Sh CAVEATS
Shell Special Characters in the
.Ar SSID
or
.Ar passphrase
will need to be escaped for
.Xr wpa_passphrase 8 ,
commonly using
.Ql \e ,
see the manual page for your shell for more details.
.Pp
Currently
.Ql Ic service netif restart
does not restart routing.
A common workaround is to issue
.Ql Ic service netif restart && service routing restart
instead.
