freebsd/freebsd-src/share/man/man7/ports.7
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: ports.7,v 1.1 1997/11/09 06:05:45 obrien Exp $
.\"
.Dd January 25, 1997
.Dt PORTS 7
.Os FreeBSD 2.2
.Sh NAME
.Nm ports
.Nd contributed applications
.Sh DESCRIPTION
The
.Nm FreeBSD Ports Collection
offers a simple way for users and
administrators to install applications.
Each 
.Ar port
listed here contains any patches necessary to make the original
application source code compile and run on BSD. Installing an
application is as simple as downloading the port, unpacking it and typing
make in the port directory. The 
.Ar Makefile
automatically fetches the
application source code, either from a local disk or via ftp, unpacks it
on your system, applies the patches, and compiles. If all goes well,
simply type
.Ar make install
to install the application.
.Pp
For more information about using ports, see
.Nm The Ports Collection
(file:/usr/share/doc/handbook/ports.html --or--
http://www.freebsd.org/handbook/ports.html).
For information about creating new ports, see
.Nm Porting applications
(file:/usr/share/doc/handbook/porting.html --or--
http://www.freebsd.org/handbook/porting.html).
Both are part of the FreeBSD Handbook.
.Pp
.Sh TARGETS
.Ss fetch
Fetch all of the files needed to build this port from the site(s)
listed in MASTER_SITES and PATCH_SITES.  See FETCH_CMD, MASTER_SITES,
PATCH_SITES, and MASTER_SITE_OVERRIDE for details on how those
environment variables impact this command.  If there are
subdirectories, then this target operates recursively.
.Ss fetch-list
Show list of files needed to be fetched in order to build the port.
.Ss checksum
Verifies the fetched distfile matches the one the port was tested against.
.Ss makesum
Creats an MD5 checksum for the distfile the port is tested against.
.Ss extract
Checksum the files for the port and then extract them into a work
directory.  Defining NO_CHECKSUM will skip the checksum check step.
Files will be fetched in the same way that 
.Ar make fetch
fetches them.
If there are subdirectories, then this target operates recursively.
.Ss patch
Patches the port.  Generally this isn't used directly as the "all"
target does this.  If the port hasn't been extracted yet, then it will
be extracted.
.Ss configure
Configures the port.  Generally this isn't used directly as the "all"
target does this.  If the port hasn't been patched yet, the patch
target is performed.
.Ss build
Builds the the port.   Generally this isn't used directly as the "all"
target does this.
.Ss install
Installs the the port and registers the port with the pkg system.  If
the port hasn't been built yet, then all steps to build the port are
perforfmed.
.Ss reinstall
Simular to \'install\'.
.Ss deinstall
Removes an installed port from the system.
.Ss package
Makes a binary package for the port from an installed port.  You must
install the package first.  If the port has not been installed then
the port will be installed.  The .tar.gz file that is built is placed
into the current directory, unless the PACKAGES variable is set.
.Ss clean
Cleans up after yourself.  Blah Blah Blah.
.Ss distclean
Cleans up fetched distfiles in addition to what \'clean\' does.
.Sh ENVIRONMENT VARIABLES
.Ss PORTSDIR
Location of the ports tree.  This defaults to /usr/ports on
FreeBSD
and
OpenBSD
, but on 
.Nx
this defaults to /usr/pkgsrc
.Ss DISTDIR
Where to install the ports into.
.Ss PACKAGES
Location of where to put the packages that are built with make packages
.Ss PREFIX
Where to install things in general (default: /usr/local).
.Ss MASTER_SITES
Primary sites for distribution files if not found locally.
.Ss PATCH_SITES
Primary locations(s) for distribution patch files if not found
locally.
.Ss NOCLEANDEPNDS
.Ss FETCH_CMD
Command to use to fetch files from the remote.
.Ss FETCH_BEFORE_ARGS
.Ss FETCH_AFTER_ARGS
.Ss MASTER_SITE_OVERRIDE
If set, override MASTER_SITES setting with this value.
.Ss FORCE_PKG_REGISTER
If set, it will overwrite any existing package registration on the
system.
.Ss MOTIFLIB
Location of libXm.{a,so}.
.Ss PATCH_DEBUG
Displays verbose output from applying each patch.
.Ss BROKEN
String as to why the port is broken.
.Ss RESTRICTED
String as to why the port is restricted.
.Sh FILES
.Bl -tag -width /usr/ports/xxxx -compact
.It Pa /usr/ports
The default ports directory (FreeBSD and OpenBSD).
.It Pa /usr/pkgsrc
The default ports directory (NetBSD).
.Sh SEE ALSO
.Xr make 1 ,
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_info 1 .
.Sh AUTHORS
This man page has been written by David O'Brien.
The ports collection is maintained by Satoshi Asami and the
.\" incredible
awesome
ports team.
.Sh HISTORY
.Nm The Ports Collection
appeared in
.Fx 1.0 .
