freebsd/freebsd-src/share/man/man7/ports.7
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: intro.4,v 1.3.2.3 1996/12/31 22:55:05 mpp Exp $
.\"
.Dd January 7, 1997
.Dt PORTS 7
.Os FreeBSD 2.2
.Sh NAME
.Nm ports
.Nd contributed applications
.Sh DESCRIPTION
The
.Nm FreeBSD Ports Collection
offers a simple way for users and
administrators to install applications.
Each 
.Ar port
listed here contains any patches necessary to make the original
application source code compile and run on BSD. Installing an
application is as simple as downloading the port, unpacking it and typing
make in the port directory. The Makefile automatically fetches the
application source code, either from a local disk or via ftp, unpacks it
on your system, applies the patches, and compiles. If all goes well,
simply type
.Ar make install
to install the application.
.Pp
For more information about using ports, see
.Nm The Ports Collection
(file:/usr/share/doc/handbook/ports.html --or--
http://www.freebsd.org/handbook/ports.html).
For information about creating new ports, see
.Nm Porting applications
(file:/usr/share/doc/handbook/porting.html --or--
http://www.freebsd.org/handbook/porting.html).
Both are part of the FreeBSD Handbook.
.Pp
.Sh FILES
.Bl -tag -width /usr/ports/xxxx -compact
.It Pa /usr/ports
The default ports directory (FreeBSD and OpenBSD).
.It Pa /usr/opt
The default ports directory (NetBSD).
.Sh SEE ALSO
.Xr make 1 ,
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_info 1 .
.Sh AUTHORS
This man page has been written by David E. O'Brien.
The ports collection is maintained by Satoshi Asami and the
.\" incredible
awesome
ports team.
.Sh HISTORY
.Nm The Ports Collection
appeared in
.Fx 1.0 .
