freebsd/freebsd-src/usr.sbin/isfctl/isfctl.8
.\"-
.\" Copyright (c) 2012 SRI International
.\" All rights reserved.
.\"
.\" This software was developed by SRI International and the University of
.\" Cambridge Computer Laboratory under DARPA/AFRL contract (FA8750-10-C-0237)
.\" ("CTSRD"), as part of the DARPA CRASH research programme.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd August 3, 2012
.Dt ISFCTL 8
.Os
.Sh NAME
.Nm isfctl
.Nd Intel StrataFlash device control program
.Sh SYNOPSIS
.Nm
.Ar device
.Ic erase
.Ar offset
.Ar size
.Sh DESCRIPTION
The
.Nm
utility provides a way for administrators to control aspects of
.Xr isf 4
devices that can not be managed though the
.Xr disk 9
interface.
.Pp
The
.Nm
utility takes a device name as its first argument followed by a command.
Currently supported commands are:
.Bl -tag -width erase
.It Ic erase
Erase blocks beginning at
.Ar offset
covering a total of
.Ar size
bytes.
The
.Ar offset
argument must be a multiple of 128K.
The
.Ar size
argument must either be a multiple of 128K or a number less than 32K in
which case it is treated as a number of 128K blocks to erase.
.El
.Sh EXAMPLES
.Dl isfctl isf0 erase 0 0x20000
.Pp
Erase the first block of the isf0 device.
.Sh SEE ALSO
.Xr isf 4
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 10.0 .
.Sh AUTHORS
This software and this manual page were
developed by SRI International and the University of Cambridge Computer
Laboratory under DARPA/AFRL contract
.Pq FA8750-10-C-0237
.Pq Do CTSRD Dc ,
as part of the DARPA CRASH research programme.
