freebsd/freebsd-src/sbin/reboot/boot_i386.8
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software written and contributed
.\" to Berkeley by William Jolitz.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_i386.8	8.2 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt BOOT 8 i386
.Os
.Sh NAME
.Nm boot
.Nd
system bootstrapping procedures
.Sh DESCRIPTION
.Sy Power fail and crash recovery.
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed,
and unless this fails, the system will resume multi-user operations.
.Pp
.Sy Cold starts.
The 386
.Tn "PC AT"
clones attempt to boot the floppy disk drive A (otherwise known as drive
0) first, and failing that, attempt to boot the hard disk C (otherwise
known as hard disk controller 1, drive 0).
The automatic boot will attempt to load
.Pa vmunix
from partition A of either the floppy or the hard disk.
This boot may be aborted by typing any character on the keyboard repeatedly
(four or five times at least) during the operating system load phase, after
which the bootstrap will prompt for the file that you wish to load instead.
.Pp
One exception to this is the
.Ql d
key, which will not abort the load but instead silently force the
.Dv DEBUG
boot flags.
The boot flags for an autoboot are 0, and 3 for the successive boot after
an aborted autoboot sequence.
No other provison is made for setting boot flags (yet).
A specific device or bootstrap file may be used; for example,
.Pp
The file specifications used for the boostrap
when loaded with the
.Dq askme
flag
(e.g. an aborted autoboot)
are of the form:
.Pp
.Dl device unit partition:
.Pp
where
.Ar device
is the type of the device, assumed to be on the ISA bus, to be searched,
.Ar unit
is the unit number of the disk or tape,
and
.Ar partition
is the disk partition or tape file number.
Normal line editing characters can be used when typing the file specification.
The following list of supported devices may vary from installation to
installation:
.Bd -unfilled -offset indent
wd	ST506, IDE, ESDI, RLL disks on a WD100[2367] or lookalike
	controller
fd	5 1/4" or 3 1/2" High density floppies
.Ed
.Pp
For example,
to boot from a file system which starts at cylinder 0
of unit 0 of an IDE disk, type
.Dq Li wd0a:vmunix
to the boot prompt;
.Dq Li fd0a:vmunix
would specify a 3 1/2" floppy drive 0 .
.Pp
In an emergency, the bootstrap methods described in the paper
.%T "Installing and Operating 4.3 BSD-Reno UNIX on the AT/386"
can be used
to boot from a distribution tape.
.Sh FILES
.Bl -tag -width /vmunixxx -compact
.It Pa /vmunix
system code
.It Pa /boot
system bootstrap
.El
.Sh SEE ALSO
.Xr halt 8 ,
.Xr reboot 8 ,
.Xr shutdown 8
.Sh BUGS
The disklabel format used by this version of
.Bx
is quite
different from that of other architectures.
