freebsd/freebsd-src/sbin/reboot/nextboot.8
.\" Copyright (c) 2002 Gordon Tetlow
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd November 4, 2002
.Dt NEXTBOOT 8
.Os
.Sh NAME
.Nm nextboot
.Nd specify an alternate kernel and boot flags for the next reboot
.Sh SYNOPSIS
.Nm
.Op Fl f
.Op Fl o Ar options
.Fl k Ar kernel
.Nm
.Fl D
.Sh DESCRIPTION
The
.Nm
utility allows specifying an alernate kernel and/or boot flags for the
next time the machine is booted. Once the loader loads in the new kernel
information, it is deleted so in case the new kernel hangs the machine,
once it is rebooted, the machine will automatically revert to it's previous
configuration.
.Pp
The options are as follows:
.Bl -tag -width ".Fl o Ar options"
.It Fl D
Invoking
.Nm
with the
.Fl D
option removes an existing nextboot configuration
.It Fl f
The
.Fl f
option disables the sanity checking which checks if the kernel really exists
before writing the nextboot configuration.
.It Fl k Ar kernel
The
.Fl k
option with required kernel argument specifies a kernel directory relative to
.Pa /boot
to load the kernel and any modules from.
.It Fl o Ar options
The
.Fl o
allows the passing of kernel flags for the nextboot.
.El
.Sh FILES
.Bl -tag -width ".Pa /boot/nextboot.conf" -compact
.It Pa /boot/nextboot.conf
The configuration file that the nextboot configuration is written into.
.El
.Sh EXAMPLES
To boot the GENERIC kernel with the
.Nm
command:
.Pp
.Dl "nextboot -k GENERIC"
.Pp
To enable into single user mode with the normal kernel:
.Pp
.Dl "nextboot -o ""-s"" -k kernel"
.Pp
To remove an existing nextboot configuration:
.Pp
.Dl "nextboot -D"
.Sh SEE ALSO
.Xr boot 8 ,
.Xr loader 8
.Sh HISTORY
The original
.Nm
manual page first appeared in
.Fx 2.2 .
It used a very different interface to achieve similar results.
.Pp
The current incarnation of
.Nm
appeared in
.Fx 5.0 .
.Sh AUTHORS
This manual page was written by
.An Gordon Tetlow Aq gordon@FreeBSD.org .
.Sh BUGS
The nextboot code is implemented in the loader. It is not the most throughly
tested code. It is also my first attempt to write in Forth.
.Pp
Finally, it does some evil things like writing to the filesystem before it
has been checked. If it scrambles your filesystem, don't blame me.
