freebsd/freebsd-src/usr.bin/wtmpcvt/wtmpcvt.1
.\" Copyright (c) 2010 Ed Schouten <ed@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd January 14, 2010
.Os
.Dt WTMPCVT 1
.Sh NAME
.Nm wtmpcvt
.Nd convert wtmp files to the utmpx format
.Sh SYNOPSIS
.Nm
.Ar input
.Ar output
.Sh DESCRIPTION
The
.Nm
utility converts traditional
.Pa wtmp
user accounting database files to the same format that is used by
.Pa /var/log/utx.log .
This makes it possible to view their contents using existing accouting
utilities, such as
.Xr last 1
and
.Xr ac 8 .
.Sh SEE ALSO
.Xr last 1 ,
.Xr getutxent 3 ,
.Xr ac 8
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 9.0 .
.Sh BUGS
The application assumes the
.Ar input
file has the same byte order as the host system.
The
.Ar output
file can be used on any architecture.
.Sh AUTHORS
.An Ed Schouten Aq ed@FreeBSD.org
