<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $Id$
     $FreeBSD$
     Original revision: 1.14

     This file has architecture-dependent installation instructions, culled
from {alpha,i386}/INSTALL.TXT.

-->

<sect1>
  <title>***En cours de traduction***Installation de &os;</title>

  <para>Cette sections documente le processus pour l'installation 
  d'une nouvelle version de &os;. Ces instructions mettent un accent
  particulier sur la fa&ccedil;on d'obtenir la distribution &os;
  &release.current; de commencer la proc&eacute;dure d'installation. Le
  chapitre <ulink
  url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/install.html">
  <quote>Installation de &os;</quote></ulink> du 
  <ulink
  url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/">
  guide de r&eacute;f&eacute;rence de &os;</ulink> vous fournit plus
  d'informations sur le programme d'installation lui m&ecirc;me, et
  une explication pas &agrave; pas de l'installation ponctu&eacute;e
  de copies d'&eacute;crans</para>


  <para>Si vous effectuez une mise &agrave; jour depuis une version
  pr&eacute;cedente de &os;, r&eacute;f&eacute;rez vous aux, <xref
  linkend="upgrading">, instructions sur la mise &agrave; jour.</para>

  <sect2 id="getting-started">
    <title>Pour commencer</title>

    <para>Probablement l'&eacute;tape la plus importante avant
    l'installation de &os;, la lecture de la documentation fournie
    avec &os; est n&eacute;cessaire. Une liste des documents pertinents
    pour cette version de &os; peut &ecirc;tre trouv&eacute;e dans le fichier
    <filename>README.TXT</filename>, qui se trouve la plupart du temps
    au m&ecirc;me endroit que ce fichier; la plupart de ces documents,
    comme les notes de version et la liste de mat&eacute;riel compatible,
    sont aussi accessible dans le menu Documentation du programme
    d'installation. </para>

    <para>Notez que les versions en ligne de &os; <ulink
    url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/faq/">FAQ</ulink> 
    et <ulink
    url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/">Handbook</ulink>
     sont aussi disponibles sur le <ulink
     url="http://www.FreeBSD.org/">site Web du projet FreeBSD</ulink>,
     si vous disposez d'une connection Internet.</para>

    <para>Cette liste de documents peut vous para&icirc;tre &eacute;norme,
    mais le temps pass&eacute; &agrave; les lire vous fera probablement gagner
    du temps par la suite. Savoir que ces ressources sont disponibles
    peut &ecirc;tre interessant lors de probl&egrave;mes au moment de
    l'installation.</para>

    <para>Si vous avez des probl&egrave;mes, voyez la <xref
    linkend="trouble">, qui contient certaines informations
    interessantes. Vous pouvez aussi lire une copie &agrave; jour du
    fichier <filename>ERRATA.TXT</filename> avant l'installation, qui
    vous alertera sur les probl&egrave;mes rencontr&eacute;s depuis la mise
    &agrave; jour d'une version particuli&egrave;re.</para>

    <important>
      <para>M&ecirc;me si &os; essaie de mettre le plus de garde-fou pour
      &eacute;viter de perdre des donn&eacute;es, il est plus que possible
      <emphasis> de perdre la totalit&eacute; de votre disque</emphasis>
      lors de l'installation si vous faites une erreur. Donc, ne
      validez pas la derni&egrave;re phase de l'installation de &os; tant
      que vous n'avez pas effectu&eacute; une sauvegarde de vos donn&eacute;es
      importantes.</para>
    </important>

  <sect2>
    <title>Mat&eacute;riel N&eacute;cessaire</title>

    <para arch="i386">&os; pour &arch.print; n&eacute;cessite une
    processeur 386 ou sup&eacute;rieur pour fonctionner (d&eacute;sol&eacute;,
    les processeurs 286 ne sont pas support&eacute;s) et au moins 5Mo de
    RAM pour l'installation et 4Mo de RAM par la suite. Voyez plus
    loin comment retailler des partitions DOS avant d'installer
    &os;.</para>

    <para arch="alpha">&os; pour &arch.print; supporte les plateformes
    d&eacute;crites dans le fichier <filename>HARDWARE.TXT</filename>.</para>

    <para arch="alpha">Vous devrez disposer d'un disque d&eacute;di&eacute;
    pour &os;/&arch;. Il n'est pas possible actuellement
    d'utiliser un disque avec un autre syst&egrave;me d'exploitation. Ce
    disque n&eacute;cessite d'&ecirc;tre attach&eacute; &agrave; un
    controleur SCSI support&eacute; par le micro-code SRM ou un disque
    IDE si votre machine supporte le d&eacute;marrage sur des disques
    IDE.</para>

    <para arch="alpha">Votre syst&egrave;me de fichier "root" DOIT &ecirc;tre
    la premi&egrave;re partition (partition <literal>a</literal>) sur le
    disque de d&eacute;marrage.</para>

    <para arch="alpha">Vous devez disposer le micro-code de console
    SRM pour cette plateforme. Dans certains cas, il est possible
    de changer les micro-codes AlphaBIOS (ou ARC) et SRM. Dans les
    autres cas il est n&eacute;cessaire de t&eacute;l&eacute;charger le nouveau
    micro-code depuis le site Web du constructeur.</para>

    <para>Si vous n'&ecirc;tes pas familier sur la configuration du
    mat&eacute;riel avec &os;, vous devrez lire le fichier
    <filename>HARDWARE.TXT</filename> qui contient d'importantes
    informations sur le mat&eacute;riel support&eacute; par &os;.</para>
  </sect2>

  <sect2 id="floppies">
  <title>Installation depuis une disquette image</title>

  <para>Suivant la fa&ccedil;on choisie pour l'installation de &os; vous
  pourriez avoir &agrave; cr&eacute;er un jeu de disquettes
  (g&eacute;n&eacute;ralement deux) pour commencer l'installation. Cette
  section d&eacute;crit bri&egrave;vement la fa&ccedil;on de cr&eacute;er ces
  disquettes que cela soit depuis le CDROM d'installation ou depuis
  Internet. Notez que la fa&ccedil;on la plus courante d'installer &os est
  par un CDROM, sur une machine supportant le d&eacute;marrage sur CDROM,
  et cette proc&eacute;dure ne sert donc &agrave; rien dans ce cas.</para>

  <para>Pour une installation standard depuis le r&eacute;seau ou un
  CDROM, tout ce que vous avez besoin d'effectuer est la copie sur des
  disquettes les fichiers images <filename>kern.flp</filename> et
  <filename>mfsroot.flp</filename> depuis le r&eacute;pertoire
  <filename>floppies/</filename> (pour des disquettes 1.44Mo).</para>

  <para>Rapatrier ces images depuis le r&eacute;seau, est tr&egrave;s
  simple. Rapatriez simplement les 
  <replaceable>release</replaceable><filename>/floppies/kern.flp</filename>
  et
  <replaceable>release</replaceable><filename>/floppies/mfsroot.flp</filename>
  fichiers depuis <ulink
  url="&release.url;"></ulink>
  ou un des sites mirroirs list&eacute; &agrave; la section  <ulink
    url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/mirrors-ftp.html">sites FTP
    </ulink> du guide de r&eacute;gerence ou depuis les pages Web 
    <ulink url="http://www.freebsdmirrors.org/"></ulink>.
  </para>

  <para>Obtenez des disquette vierges formatt&eacute;es et copiez l'
  image <filename>kern.flp</filename> sur une et
  <filename>mfsroot.flp</filename> sur l'autre. Ces images
  <emphasis>ne sont pas</emphasis> des fichiers DOS. Vous ne pouvez
  pas simplement les copier sur une disquette DOS ou UFS comme des
  fichiers standard, vous devez les copier comme une
  <quote>image</quote> en utilisant <filename>fdimage.exe</filename>
  sous DOS (voyez le r&eacute;pertoire <filename>tools</filename> sur le
  CDROM ou site mirroir FTP de &os;) ou la commande UNIX
  &man.dd.1;.</para>

  <para>Par exemple, pour cr&eacute;er la disquette image du noyau depuis
  DOS, vous devrez taper quelque chose comme:</para>

  <screen><prompt>C></prompt> <userinput>fdimage kern.flp a:</userinput></screen>

  <para>En assumant que vous avez copi&eacute;
  <filename>fdimage.exe</filename> et <filename>kern.flp</filename>
  dans un r&eacute;pertoire.  Vous devrez effectuer la m&ecirc;me
  op&eacute;ration pour <filename>mfsroot.flp</filename>.</para>

  <para>Si vous cr&eacute;ez les disquettes de d&eacute;marrage depuis une
  machine UNIX, quelque chose comme:</para>

  <screen>&prompt.root; <userinput>dd if=floppies/kern.flp of=/dev/rfd0</userinput></screen>

  <para>ou</para>

  <screen>&prompt.root; <userinput>dd if=floppies/kern.flp of=/dev/floppy</userinput></screen>

  <para>fonctionne parfaitement, suivant votre mat&eacute;riel et
  syst&egrave;me d'exploitation (diff&eacute;rentes version d'UNIX ont des
  noms diff&eacute;rents pour le lecteur de disquette).</para>

  <para arch="alpha">Si vous disposez d'une machine alpha qui peut
  d&eacute;marrer les images depuis le r&eacute;seau ou si vous disposez d'un
  lecteur de disquette 2.88Mo ou LS-120 capable depuis une machine x86
  de cr&eacute;er une image 2.88Mo, vous pouvez utiliser l'image unique
  (mais deux fois plus grosse)  <filename>boot.flp</filename>. Ce
  fichier contient <filename>kern.flp</filename> et 
  <filename>mfsroot.flp</filename> sur une seule disquette. Ce fichier
  peut aussi &ecirc;tre utilis&eacute; comme une image de d&eacute;marrage pour
  ceux cr&eacute;eant des images de d&eacute;marrage pour CD <quote>El
  Torito</quote> Voyez la commande  &man.mkisofs.8; pour plus
  d'informations.</para>

  </sect2>

  <sect2 id="start-installation">
      <title>Installation de &os; depuis un CDROM ou Internet</title>

      <para arch="i386">La fa&ccedil;on la plus simple d'effectuer
      l'installation est d'utiliser un CDROM. Si vous disposez d'un
      lecteur de CDROM support&eacute; et du CDROM d'installation de &os;,
      il y a deux fa&ccedil;on de d&eacute;marrer cette installation:
        <itemizedlist>
          <listitem>
            <para>Si votre syst&egrave;me supporte le d&eacute;marrage depuis
            un CDROM (souvent il s'agit d'une option qui peut &ecirc;tre
            s&eacute;lectionn&eacute;e via le menu d'un controleur ou depuis
            le BIOS du PC sur certains syst&egrave;mes) et que vous l'avez
            activ&eacute;, &os; supporte le standard de d&eacute;marrage
            <quote>El Torito</quote>. Ins&eacute;rez tout simplement le CD
            dans le lecteur de CDROM et d&eacute;marrez le syst&egrave;me pour
            commencer l'installation.</para>
	  </listitem>
	  <listitem>
	    <para>Cr&eacute;er un jeu de disquette de d&eacute;marrage de &os;
            depuis le r&eacute;pertoire <filename>floppies/</filename>. En
            utilisant le script <filename>makeflp.bat</filename>
            depuis DOS ou en lisant la 
            <xref linkend="floppies"> pour plus d'informations sur la
            cr&eacute;ation de disquettes de d&eacute;marrage sous
            diff&eacute;rents syst&egrave;mes. Vous d&eacute;marrerez depuis la
            premi&egrave;re disquette et vous vous trouverez rapidement
            dans l'installation de &os;.</para>
          </listitem>
        </itemizedlist>
      </para>

      <para arch="i386">Si vous ne disposez pas d'un CDROM (ou si
      votre ordinateur ne supporte par le d&eacute;marrage depuis un
      CDROM) ou si vous d&eacute;sirez installer via le r&eacute;seau en
      utilisant PPP, SLIP ou une connexion d&eacute;di&eacute;; vous devez
      commencer par cr&eacute;er un jeu de disquette de d&eacute;marrage &os;
      depuis les fichiers <filename>floppies/kern.flp</filename> et
      <filename>floppies/mfsroot.flp</filename> en suivant les
      instructions que vous trouverez &agrave; la  
      <xref linkend="floppies">. Red&eacute;marrez votre ordinateur en utilisant
      la disquette <filename>kern.flp</filename> et lorsqu'on vous le
      demande, inserez alors la disquette
      <filename>mfsroot.flp</filename>. Allez &agrave; la <xref
      linkend="ftpnfs"> pour plus d'information sur l'installation
      via FTP ou NFS.</para>

      <para arch="alpha">La fa&ccedil;on la plus simple d'effectuer
      l'installation est d'utiliser un CDROM. Si vous disposez d'un
      lecteur de CDROM support&eacute; et du CDROM d'installation de &os;,
      vous pouvez d&eacute;marer &os; directement depuis le
      CDROM. Ins&eacute;rez le CDROM dans le lecteur et tapez la commande
      suivante pour d&eacute;marrer l'installation (en substituant le nom
      du lecteur de CDROM appropri&eacute;):</para>

      <screen arch="alpha">&gt;&gt;&gt;<userinput>boot dka0</userinput></screen>

      <para arch="alpha">Sinon, vous pouvez d&eacute;marrer l'installation
      depuis un lecteur de disquette. Vous devez donc commencer
      l'installation en cr&eacute;eant un jeu de disquette de d&eacute;marrage
      de &os; depuis les fichiers <filename>floppies/kern.flp</filename> et
      <filename>floppies/mfsroot.flp</filename> en suivant les
      instructions que vous trouverez &agrave; la  <xref
      linkend="floppies">. Depuis l'invite de console SRM
      (<literal>&gt;&gt;&gt;</literal>), inserez la disquette
      <filename>kern.flp</filename> et tapez la commande suivante pour
      d&eacute;marrer l'installation:</para>

      <screen arch="alpha">&gt;&gt;&gt;<userinput>boot dva0</userinput></screen>

      <para arch="alpha">Ins&eacute;rez alors la disquette
      <filename>mfsroot.flp</filename> au moment ou le syst&egrave;me la
      demande et vous finirez alors le premier &eacute;cran
      d'installation.</para>

  </sect2>
  <sect2>
    <title>D&eacute;tails de diff&eacute;rents types d'installation</title>

    <para>D&egrave;s que vous arrivez &agrave; au premier &eacute;cran
    d'installation, vous devez pouvoir suivre les diff&eacute;rents
    menus. Si vous n'avez jamais utilis&eacute; l'installeur de &os;
    pr&eacute;c&eacute;demment, vous &ecirc;tes encourag&eacute;s &agrave; lire la
    documentation dans le menu Documentation tout comme les
    instructions <quote>d'usage</quote> g&eacute;n&eacute;ral du premier
    menu.</para>

    <note>
      <para>Si vous &ecirc;tes perdu sur un &eacute;cran, pressez la touche
      <keycap>F1</keycap> pour la documentation en ligne sur la section
      courante.</para>
    </note>

    <para>Si vous n'avez jamais install&eacute; &os; pr&eacute;cedemment, le
    mode d'installation <quote>Standard</quote> est recommand&eacute;, car
    il v&eacute;rifie que vous visitez toutes les portions importantes
    n&eacute;cessaires. Si vous connaissez le processus d'installation de
    &os; et que vous savez <emphasis>exactement</emphasis> ce que vous
    faites, utilisez l'option d'installation <quote>Express</quote> ou
    <quote>Custom</quote>. Si vous mettez &agrave; jour depuis un
    syst&egrave;me existant, utilisez l'option <quote>Upgrade</quote>.</para>

    <para>L'installeur de &os; supporte l'utilisation de lecteur de
    disquette, DOS, CDROM, FTP, lecteur de bande ou partitions NFS et
    UFS comme m&eacute;dia d'installation; plus d'informations sur
    l'installagion depuis chaque type de m&eacute;dia sont list&eacute;s
    ci-dessous.</para>

    <para arch="alpha">Une fois la proc&eacute;dure d'installation finit,
    vous pourrez d&eacute;marrer &os;/&arch; en tapant quelque chose comme
    ceci &agrave; l'invite SRM:</para>

    <screen arch="alpha">&gt;&gt;&gt;<userinput>boot dkc0</userinput></screen>

    <para arch="alpha">Cela demande au micro-code de d&eacute;marrer
    depuis le disque sp&eacute;cifi&eacute;. Pour trouver le nom SRM des
    disque de votre machine, utilisez la commande <literal>show
    device</literal>:</para>

    <screen arch="alpha">&gt;&gt;&gt;<userinput>show device</userinput>
dka0.0.0.4.0               DKA0           TOSHIBA CD-ROM XM-57  3476
dkc0.0.0.1009.0            DKC0                       RZ1BB-BS  0658
dkc100.1.0.1009.0          DKC100             SEAGATE ST34501W  0015
dva0.0.0.0.1               DVA0
ewa0.0.0.3.0               EWA0              00-00-F8-75-6D-01
pkc0.7.0.1009.0            PKC0                  SCSI Bus ID 7  5.27
pqa0.0.0.4.0               PQA0                       PCI EIDE
pqb0.0.1.4.0               PQB0                       PCI EIDE</screen>

    <para arch="alpha">Cet exemple est extrait d'une Digital Personal
    Workstation 433au et montre trois disques attach&eacute;s &agrave; cette
    machine. Le premier est un CDROM appel&eacute;
    <devicename>dka0</devicename> et les deux autres sont des disques
    appel&eacute;s respectivement <devicename>dkc0</devicename> et
    <devicename>dkc100</devicename>.</para>

    <para arch="alpha">Vous pouvez sp&eacute;cifier le noyau &agrave; charger
    et quelles options de d&eacute;marrage utiliser via les options
    <option>-file</option> et <option>-flags</option>:</para>

    <screen arch="alpha"><prompt>&gt;&gt;&gt;</prompt> <userinput>boot -file kernel.old -flags s</userinput></screen>

    <para arch="alpha">Pour d&eacute;marrer automatiquement &os;/&arch;
    utilisez les commandes:</para>

    <screen arch="alpha"><prompt>&gt;&gt;&gt;</prompt> <userinput>set boot_osflags a</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>set bootdef_dev dkc0</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>set auto_action BOOT</userinput></screen>

    <sect3>
      <title>Installation depuis un CDROM r&eacute;seau</title>

      <para>Si vous d&eacute;sirez installer depuis un lecteur de CDROM
      local voyez la <xref linkend="start-installation">. Si vous ne
      disposez pas d'un lecteur de CDROM sur votre syst&egrave;me et que
      vous d&eacute;sirez utiliser une distribution CD de &os; dans le
      lecteur CDROM d'une autre machine que vous pouvez acc&eacute;der via
      le r&eacute;seau, il y a plusieurs fa&ccedil;on d'y arriver:</para>

      <itemizedlist>
        <listitem>
          <para>Si vous voulez pouvoir installer via FTP &os;,
          directement depuis le lecteur de CDROM d'une machine &os;,
          c'est tr&egrave;s simple: Vous pouvez tout simplement ajouter la
          ligne suivante &agrave; votre fichier des mots de passe (en
          utilisant la commande &man.vipw.8;):</para>

          <screen>ftp:*:99:99::0:0:FTP:/cdrom:/sbin/nologin</screen>

          <para>Sur la machine que vous voulez installer, allez dans
          le menu Options et mettez le Release Name &agrave;
          <literal>any</literal>. Vous pouvez alors choisir comme type
          de m&eacute;dia  <literal>FTP</literal> et taper
          <filename>ftp://<replaceable>machine</replaceable></filename>
          apr&egrave;s avoir choisi <quote>URL</quote> dans le menu des
          sites ftp.</para>

          <warning>
	    <para>: Cela permet &agrave; n'importe qui depuis le r&eacute;seau
            local (ou Internet) de se connecter via <quote>FTP anonyme
            </quote> &agrave; cette machine, ce qui peut ne pas &ecirc;tre
            voulu.</para>
	  </warning>
	</listitem>

	<listitem>
	  <para>Si vous pr&eacute;f&eacute;rez utiliser NFS pour export&eacute; le
          CDROM sur la machine que vous installez, vous devez en
          premier ajouter une ligne au fichier
          <filename>/etc/exports</filename> (sur la machine disposant
          du lecteur de CDROM). L'exemple ci-dessous autorise la
          machine <hostid role="hostname">ziggy.foo.com</hostid> &agrave;
          monter le CDROM via NFS lors de l'installation:</para>

	  <screen>/cdrom          -ro             ziggy.foo.com</screen>

	  <para>La machine contenant le CDROM doit, bien sur, &ecirc;tre
          configur&eacute;e en serveur NFS, et si vous n'en &ecirc;tes pas
          sur, une installation via NFS n'est pas le meilleur des
          choix, sauf si vous voulez lire &man.rc.conf.5; et
          configurer les choses correctement. En assumant que cette
          partie se passe bien, vous devriez &ecirc;tre capable d'entrer:
          <filename><replaceable>cdrom-host</replaceable>:/cdrom</filename> 
          comme r&eacute;pertoire d'installation NFS pour la machine &agrave;
          installer, e.g. <filename>wiggy:/cdrom</filename>.</para>
	</listitem>
      </itemizedlist>
    </sect3>

    <sect3>
      <title>Installation depuis des disquettes</title>

      <para>Si vous devez installer &os; via des disquettes, car votre
      mat&eacute;riel n'est pas support&eacute; ou juste parce que vous aimez
      le faire comme cela, vous devez d&eacute;j&agrave; pr&eacute;par&eacute;
      quelques disquettes pour l'installation.</para>

      <para>Premi&egrave;rement, cr&eacute;ez vos disquettes de d&eacute;marrage
      comme indiqu&eacute; &agrave; la <xref linkend="floppies">.</para>

      <para>Deuxi&egrave;emement, lisez la <xref linkend="layout"> et
      faites attention &agrave; la section <quote>Format de la
      distribution</quote> qui d&eacute;crit quels fichiers vous devez
      copier sur disquette et ceux que vous pouvez ne pas copier.</para>

      <para>Ensuite vous aurez besoin, au minimum, d'autant de
      disquettes 1.44Mo qu'il en faut pour contenir tous les fichiers
      du r&eacute;pertoire <filename>bin</filename>. Si vous pr&eacute;parez
      ces disquettes sous DOS, il faut alors que ces disquettes
      <emphasis>soient </emphasis> formatt&eacute;es en utilisant la
      commande DOS <filename>FORMAT</filename>. Si vous utilisez
      Windows, utilisez la commande de formattage du gestionnaire de
      fichier.</para>


      <important>
        <para>Fr&eacute;quemment, les disquettes sont
        pr&eacute;formatt&eacute;s. De nombreux probl&egrave;mes
        rapport&eacute;s par les utilisateurs &eacute;taient le
        r&eacute;sultat de mauvais formattage de
        m&eacute;dia. Re-formatt&eacute;z vos disquettes avant
        l'utilisation, juste pour en &ecirc;tre sur.</para>
      </important>

      <para>Si vous cr&eacute;ez ces disquettes depuis une autre machine
      &os;, un formattage n'est pas une mauvaise id&eacute;e, m&ecirc;me s'il
      n'est pas n&eacute;cessaire de mettre un syst&egrave;me de fichiers DOS
      sur chaque disquette. Vous pouvez utiliser les commandes
      &man.disklabel.8; et &man.newfs.8; pour mettre un syst&egrave;me de
      fichier UFS, sur les disquettes, comme l'illustrent les
      commandes suivantes:</para>

      <screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</userinput></screen>

      <para>Apr&egrave;s avoir formatt&eacute; vos disquettes pour DOS ou UFS,
      vous devez copier dessus les fichiers. Les fichiers des
      distributions sont coup&eacute;s en petits fichiers. 5 de ces fichiers
      tiennent sur une seule disquette 1.44Mo. Copiez tous les
      fichiers n&eacute;cessaires &agrave; votre distributino sur les
      disquettes. Chaque distribution doit &ecirc;tre copi&eacute; dans son
      propre sous-r&eacute;pertoire sur les disquettes, e.g
      :<filename>a:\bin\bin.inf</filename>,
      <filename>a:\bin\bin.aa</filename>,
      <filename>a:\bin\bin.ab</filename>, ...</para>

      <important>
        <para>Le fichier <filename>bin.inf</filename> doit aussi
        &ecirc;tre copi&eacute; et doit se trouver sur la premi&egrave;re
        disquette du jeu  <filename>bin</filename> car il est lu par
        le programme d'installation, pour savoir en combien de
        morceaux est coup&eacute; la distribution pour la
        recomposer. Lorsque vous mettez les distributions sur les
        disquettes, le fichier <filename>distname.inf</filename>
        <emphasis>doit </emphasis> se trouver sur la premi&egrave;re
        disquette de chaque jeu de distribution.</para>
      </important>

      <para>Au moment ou vous arriverez a l'&eacute;cran de s&eacute;lection
      du m&eacute;dia, choisissez <quote>Floppy</quote> et suivez les
      instructions affich&eacute;es.</para>
    </sect3>

    <sect3 arch="i386">
      <title>Installation depuis une partition DOS</title>

      <para>Pour pr&eacute;parer une installation depuis une partition
      MS-DOS, vous devez simplement copier les fichiers de la
      distribution dans le r&eacute;pertoire <filename>FREEBSD</filename>
      sur la partition DOS primaire (<devicename>C:</devicename>). Par
      exemple, pour installation une distribution minimal de &os;
      sous DOS depuis les fichiers se trouvant sur le CDROM, vous
      devriez taper les commandes suivantes :</para>

      <screen><prompt>C:\></prompt> <userinput>MD C:\FREEBSD</userinput>
<prompt>C:\></prompt> <userinput>XCOPY /S E:\BIN C:\FREEBSD\BIN</userinput></screen>

      <para>En assumant que <devicename>E:</devicename> est le nom du
      lecteur CDROM.</para>

      <para>Pour toutes les distributions n&eacute;cessaires &agrave;
      l'installation depuis DOS, vous devez copier chacune dans un
      sous r&eacute;pertoire de <filename>C:\FREEBSD</filename>. Le
      r&eacute;pertoire <filename>BIN</filename> etant le minimum
      obligatoire.</para>

      <para>Lorsque vous avez copi&eacute; toutes les distributions, vous
      pouvez lancer l'installation via les disquettes et
      s&eacute;lectionnez <quote>DOS</quote> comme m&eacute;dia
      d'installation.</para>
    </sect3>

    <sect3>
      <title>Installation depuis un lecteur de bande QIC/SCSI</title>

      <para>Lors de l'installation depuis un lecteur de bande, le
      programme d'installation n&eacute;cessite que les fichiers soient
      tout simplement en format tar sur la bande, donc apr&egrave;s avoir
      r&eacute;cup&eacute;rer l'ensemble des fichiers des distributions
      n&eacute;cessaires, utilisez simplement la commande &man.tar.1; pour
      les mettre sur la bande, comme cela :/<para>

      <screen>&prompt.root; <userinput>cd <replaceable>/where/you/have/your/dists</replaceable></userinput>
&prompt.root; <userinput>tar cvf /dev/rsa0 <replaceable>dist1</replaceable> .. <replaceable>dist2</replaceable></userinput></screen>

      <para>Lorsque vous d&eacute;butez l'installation, assurez vous
      d'avoir assez de place dans un r&eacute;pertoire temporaire (que
      vous pourrez choisir) pour extraire la
      <emphasis>totalit&eacute;</emphasis> du contenu de la bande. Du &agrave;
      la m&eacute;thode d'acc&egrave;s des lecteurs de bande, cette m&eacute;thode
      d'installation n&eacute;cessite plus de place temporaire. Vous
      devrez juste vous assurez que vous disposez d'autant de place
      sur disque que de la taille des donn&eacute;es sur la bande.</para>

      <note>
        <para>Lors de l'utilisation de ce type d'installation, la
        bande doit se trouver dans le lecteur de bande
        <emphasis>avant</emphasis> de d&eacute;marrer sur les
        disquettes. Sinon le m&eacute;canisme de v&eacute;rification de
        l'installation ne trouvera pas la bande.</para>
      </note>

      <para>Ensuite cr&eacute;ez une disquette de d&eacute;marrage comme
      indiqu&eacute; &agrave; la  <xref linkend="floppies"> et proc&eacute;dez
      &agrave; l'installation.</para>
    </sect3>

    <sect3 id="ftpnfs">
      <title>Installation via le r&eacute;seau en utilisant FTP ou NFS</title>

      <para>Apr&egrave;s avoir cr&eacute;er les disquettes de d&eacute;marrage
      comme d&eacute;crit dans la premi&egrave;re section, vous pouvez
      effectuer le reste de l'installation via un r&eacute;seau de trois
      façons diff&eacute;rentes: par le port s&eacute;rie, par le port
      parall&egrave;le, ou Ethernet.</para>

      <sect4>
        <title>Par port s&eacute;rie</title>

	<para>Le support SLIP est primitif, et est limit&eacute; aux liens
        directs, comme un cable s&eacute;rie reliant deux ordinateurs. Le
        lien doit être direct car l'installation via SLIP ne
        supporte pas encore la capacit&eacute; d'appel. Si vous devez
        appeler via un modem ou un autre type de mat&eacute;riel sur ce
        lien avant de vous connectez, je vous recommande d'utilisez
        PPP &agrave; la place.</para>

        <para>Si vous utilisez PPP, assurez vous de disposer des
        informations d'adresse IP du DNS, de votre fournisseur
        d'acc&egrave;s Internet, &agrave; cot&eacute; de vous car vous en aurez
        besoin tr&egrave;s tôt lors du processus d'installation. Vous
        devez aussi connaitre votre adresse IP, car PPP supporte la
        n&eacute;gociation dynamique d'adresse et peut r&eacute;cup&eacute;rer
        cette information directement depuis votre ISP.</para>

        <para>Vous devez aussi savoir comment utiliser les
        diff&eacute;rentes <quote>commandes AT</quote> pour dialoguer avec
        certains modems, car le gestionnaire PPP ne fournit qu'un
        simple &eacute;mulateur de terminal.</para>
      </sect4>

      <sect4>
        <title>Par port parall&egrave;le</title>

	<para>Si une connexion directe &agrave; une autre machine &os; ou
        Linux est disponible, vous pouvez installer via un port
        parall&egrave;le. Le taux de transfert via un port parall&egrave;le
        est bien plus important que via un port s&eacute;rie (jusqu'&agrave;
        50k/sec), cela vous permettra d'installer &os; plus
        rapidement. Il n'est pas forc&eacute;ment n&eacute;cessaire d'utiliser
        une <quote>v&eacute;ritable</quote> adresse IP lors de
        l'utilisation d'un cable parall&egrave;le pour une installation
        point &agrave; point, car vous pouvez utiliser g&eacute;n&eacute;ralement
        des adresses de style RFC1918 pour les extr&eacute;mit&eacute;s du
        lien (e.g. <hostid
        role="ipaddr">10.0.0.1</hostid>, <hostid
        role="ipaddr">10.0.0.2</hostid>,etc).</para>

        <important>
	  <para>Si vous utilisez une machine Linux plutôt qu'une
          machine &os; comme deuxi&egrave;me extr&eacute;mit&eacute; PLIP, vous
          devez sp&eacute;cifier <option>link0</option> dans l'&eacute;cran de
          configuration TCP/IP comme <quote>options suppl&eacute;mentaire
          &agrave; ifconfig</quote>, pour fonctionner correctement avec le
          protocole PLIP l&eacute;g&eacute;rement diff&eacute;rent de Linux.</para>
	</important>

      </sect4>

      <sect4>
        <title>Ethernet</title>

	<para>&os; supporte la plupart des cartes Ethernet; une liste
        des cartes support&eacute;es se trouve dans les notes de
        compatibilit&eacute; mat&eacute;riel de &os; (voir
        <filename>HARDWARE.TXT</filename> dans le menu
        <quote>Documentation</quote> sur la disquette de d&eacute;marage
        ou dans le r&eacute;pertoire principal sur le CDROM). Si vous
        utilisez une carte PCMCIA Ethernet support&eacute;e, v&eacute;rifiez
        de bien l'avoir ins&eacute;rer <emphasis>avant</emphasis> le
        d&eacute;marrage de votre portable. &os; ne supporte pas encore
        <quote>l'insertion &agrave; chaud</quote> de cartes PCMCIA pendant
        l'installation.</para>

        <para>Vous devez aussi connaître votre adresse IP sur le
        r&eacute;seau, ainsi que la valeur du <option>netmask</option> et
        le nom de votre machine. Votre administrateur syst&egrave;me peut
        vous fournir les bonnes valeurs. Si vous d&eacute;sirez utiliser
        des noms de machine &agrave; la place des adresses IP , vous devez
        aussi disposer d'un serveur DNS, et potentiellement l'adresse
        IP de la passerelle (si vous utilisez PPP, c'est l'adresse IP
        de votre ISP) pour dialoguer avec lui. Si vous d&eacute;sirez
        effectuer l'installation par FTP vi un proxy HTTP (voir
        ci-apr&egrave;s), vous devez connaître l'adresse du
        proxy.</para>

        <para>Si vous ne connaissez pas les r&eacute;ponse &agrave; ces
        diff&eacute;rentes questions, vous devez probablement demande &agrave;
        votre administrateur syst&egrave;me avant de tester un de ces type
        d'installation. Si vous utilisez une adresse IP ou une valeur
        de netmask al&eacute;atoire sur un r&eacute;seau branch&eacute;, il se
        peut que cela ne fonctionne pas, et r&eacute;sultera probablement
        &agrave; un blame de la part de votre administrateur
        syst&egrave;me.</para>

        <para>D&egrave;s que vous avez une connection r&eacute;seau
        fonctionnelle, vous pouvez continuer l'installation via NFS ou
        FTP.</para>
      </sect4>

      <sect4>
        <title>Conseils d'installation via NFS</title>

        <para>L'installation via NFS est tr&egrave;s simple: copiez
        simplement les fichiers des distributions de &os, dont vous
        avez besoin quelque part sur un serveur, et faites pointer le
        m&eacute;dia de selection NFS vers lui.</para>

        <para>Si le serveur ne support que l'acc&egrave;s via les
        <quote>ports privil&eacute;gi&eacute;s</quote> (c'est
        g&eacute;n&eacute;rallement le cas pour les stations de travail Sun ou
        Linux), vous devez activer cette option dans le menu
        <quote>Options</quote> avant de commencer l'installation.</para>

        <para>Si vous disposez de cartes Ethernet de mauvaise
        qualit&eacute;, qui souffrent de mauvais taux de transfert,
        vous devez aussi activer le bon drapeau dans le menu
        <quote>Options</quote>.</para>

        <para>Pour faire fonctionner votre installation via NFS, le
        serveur doit aussi supporter le <quote>montage de
        sous-r&eacute;pertoires</quote>, e.g. si votre r&eacute;pertoire de la
        distribution de &os; r&eacute;side dans
        <filename>wiggy:/usr/archive/stuff/FreeBSD</filename>, alors
        <hostid role="hostname">wiggy</hostid> doit autoriser le
        montage direct de
        <filename>/usr/archive/stuff/FreeBSD</filename> et non pas
        seulement <filename>/usr</filename> ou
        <filename>/usr/archive/stuff</filename>.</para>

        <para>Dans le fichier <filename>/etc/exports</filename> de
        &os; il faut positionner l'option
        <option>-alldirs</option>. Pour d'autres serveurs NFS, il peut
        y avoir d'autres options. Si vous obtenez des messages
        <literal>Permission Denied</literal> du serveur, c'est souvent
        du &agrave; un mauvais param&egrave;trage de cette
        propri&eacute;t&eacute;.</para>
      </sect4>

      <sect4>
        <title>Conseils d'installation via FTP</title>

        <para>L'installation via FTP peut se faire depuis n'importe
        quel site mirroir raisonnablement &agrave; jour de &os;. Un menu
        complet comportant un nombre de choix raisonnalbe pour
        diff&eacute;rents pays se trouve dans le menu site FTP lors de
        l'installation.</para>

        <para>Si vous installez depuis un autre site FTP que un de
        ceux fournit dans le menu, ou si vous avez des soucis avec
        votre serveur de noms, vous pouvez sp&eacute;cifier votre propre URL
        en s&eacute;lectionnant le choix <quote>URL</quote> dans le menu. Une
        URL peut contenir un nom de machine ou une adresse IP, donc
        quelque chose comme ce qui suit doit fonctionner en l'absence
        d'un serveur de nom:</para>

        <screen>ftp://216.66.64.162/pub/FreeBSD/releases/&arch;/4.2-RELEASE</screen>

        <para>Il y a trois modes d'installation FTP disponibles:
	  <itemizedlist>
	    <listitem>
	      <para>FTP:  Cette m&eacute;thode utilise le mode
              <quote>Actif</quote> standard pour les transferts. Ce
              mode peut ne pas fonctionner correctement &agrave; travers la
              plupart des firewalls mais risque de fonctionner tr&egrave;s
              bien avec les vieux serveurs FTP qui ne supporte pas le
              mode passif. Si votre connection se bloque avec le mode
              passif, utilisez ce mode.</para>
	    </listitem>
	    <listitem>
	      <para>FTP Passive:  Ce mode active le mode  FTP
              "Passif". Cette option est la meilleure pour les
              personnes n&eacute;cessitant de traverser des firewalls qui
              n'autorise pas les connexions entrantes sur des ports
              al&eacute;atoires.</para>
	    </listitem>
            <listitem>
	      <para>FTP via an HTTP proxy: Cette option informe &os;
              d'utiliser un proxy HTTP pour toute connexion FTP. Le
              proxy transforme alors les requ&egrave;tes et les envoient au
              serveur FTP. Cela permet &agrave; l'utilisateur de traverser
              certains firewalls qui n'autorisent pas le FTP, mais
              offre une fonction de proxy HTTP. Vous devez fournir
              l'adresse du proxy en plus du nom du serveur FTP.</para>

	      <para>Dans certains cas, tr&egrave;s rare, ou vous disposez
              d'un proxy FTP, mais qui ne supporte pas les requ&egrave;tes
              HTTP, vous pouvez sp&eacute;cifier l'URL comme ceci:</para>

              <screen><userinput>ftp://foo.bar.com:<replaceable>port</replaceable>/pub/FreeBSD</userinput></screen>

              <para>Dans l'URL ci-dessus, <replaceable>port</replaceable>
              correspond au num&eacute;ro du port du serveur FTP proxy.</para>
	    </listitem>
	  </itemizedlist>

      </sect4>
    </sect3>
    <sect3>
      <title>Conseils pour les utilisateurs de console s&eacute;rie</title>

      <para>Si vous d&eacute;sirez installer &os; sur une machine en
      utilisant uniquement un port s&eacute;rie (e.g. si vous ne disposez pas
      d'une carte graphique), suivez les instructions suivantes:</para>

      <procedure>
	<step>
	  <para>Connectez un terminal compatible ANSI (vt100) ou un
          programme d'&eacute;mulation de terminal sur le port
          <devicename>COM1</devicename> du PC sur lequel vous d&eacute;sirez
          installer &os;.</para>
	</step>
	<step>
	  <para>D&eacute;branchez le clavier (oui vous avez bien lu!) et
          essayez de d&eacute;marrer depuis une disquette ou depuis le CDROM
          d'installation, en fonction du type de m&eacute;dia d'installation
          en votre possession, avec le clavier d&eacute;branch&eacute;.</para>
	</step>
	<step>
	  <para>Si vous n'obtenez aucun caract&egrave;re sur votre console
          s&eacute;rie, branchez le clavier et attendez des sonneries. Si
          vous d&eacute;marrez depuis le CDROM, allez &agrave; <xref
	  linkend="hitspace"> aussi vite que possible.</para>
	</step>
	<step>
	  <para>Pour une installation via des disquettes, la premi&egrave;re
          sonnerie indique de retirer la disquette
          <filename>kern.flp</filename> et d'ins&eacute;rer la disquette
          <filename>mfsroot.flp</filename> puis appuyez sur la touche
          <keycap>Enter</keycap> et attendez une autre sonnerie.</para>
	</step>
	<step id="hitspace">
	  <para>Appuyez sur la barre d'espace et entrez</para>

	  <screen><userinput>boot -h</userinput></screen>

	  <para>Et vous deviez enfin voir des choses sur le port
          s&eacute;rie. Si cela ne fonctionne pas, v&eacute;rifier
          votre cablage s&eacute;rie et vos pr&eacute;f&eacute;rences
          de l'&eacute;mulateur de terminal ou le
          p&eacute;riph&eacute;rique. Il doivent &ecirc;tre
          configur&eacute;s en 9600 baud, 8bits, pas de
          parit&eacute;.</para>

	</step>
      </procedure>
    </sect3>
  </sect2>

  <sect2>
    <title>Question and Answer Section for &arch.print; Architecture Users</title>

    <qandaset arch="i386">
      <qandaentry>
        <question>
	  <para>Help!  I have no space!  Do I need to delete
	  everything first?</para>
	</question>
	<answer>
	  <para>If your machine is already running DOS and has little
	  or no free space available for &os;'s installation, all is
	  not lost!  You may find the <application>FIPS</application>
	  utility, provided in the <filename>tools/</filename>
	  subdirectory on the &os; CDROM or on the various &os; ftp
	  sites, to be quite useful.</para>

	  <para><application>FIPS</application> allows you to split an
	  existing DOS partition into two pieces, preserving the
	  original partition and allowing you to install onto the
	  second free piece.  You first <quote>defrag</quote> your DOS
	  partition, using the DOS 6.xx <filename>DEFRAG</filename>
	  utility or the <application>Norton Disk Tools</application>,
	  then run FIPS.  It will
	  prompt you for the rest of the information it needs.
	  Afterwards, you can reboot and install &os; on the new
	  partition.  Also note that FIPS will create the second
	  partition as a <quote>clone</quote> of the first, so you'll
	  actually see that you now have two DOS Primary partitions
	  where you formerly had one.  Don't be alarmed!  You can
	  simply delete the extra DOS Primary partition (making sure
	  it's the right one by examining its size).</para>

	  <para><application>FIPS</application> does NOT currently
          work with NTFS style partitions.  To split up such a
          partition, you will need a commercial product such as
          <application>Partition Magic</application>.  Sorry, but this
          is just the breaks if you've got a Windows partition hogging
          your whole disk and you don't want to reinstall from
          scratch.</para>
	  
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Can I use compressed DOS filesystems from
	  &os;?</para>
	</question>

	<answer>
	  <para>No.  If you are using a utility such as
	  <application>Stacker</application>(tm) or
	  <application>DoubleSpace</application>(tm), &os; will only
	  be able to use whatever portion of the filesystem you leave
	  uncompressed.  The rest of the filesystem will show up as
	  one large file (the stacked/dblspaced file!).  <emphasis>Do
	  not remove that file</emphasis> as you will probably regret
	  it greatly!</para>

	  <para>It is probably better to create another uncompressed DOS
	  extended partition and use this for communications between
	  DOS and &os; if such is your desire.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Can I mount my DOS extended partitions?</para>
	</question>

	<answer>
	  <para>Yes.  DOS extended partitions are mapped in at the end
	  of the other <quote>slices</quote> in &os;, e.g. your <devicename>D:</devicename> drive might
	  be <filename>/dev/da0s5</filename>, your <devicename>E:</devicename> drive <filename>/dev/da0s6</filename>, and so on. This
	  example assumes, of course, that your extended partition is
	  on SCSI drive 0. For IDE drives, substitute <literal>ad</literal> for
	  <literal>da</literal> appropriately. You otherwise mount extended
	  partitions exactly like you would mount any other DOS drive,
	  e.g.:</para>

	  <screen>&prompt.root; <userinput>mount -t msdos /dev/da0s5 /dos_d</userinput></screen>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Can I run DOS binaries under &os;?</para>
	</question>

	<answer>
	  <para>Ongoing work with BSDI's &man.doscmd.1; utility will
	  suffice in many cases, though
	  it still has some rough edges.  If you're interested in
	  working on this, please send mail to the &a.emulation;
	  and indicate that you're interested in joining this ongoing
	  effort!</para>

	  <para>The <filename role="package">emulators/pcemu</filename> port/package in the
	  &os; Ports Collection which emulates an 8088 and enough BIOS
	  services to run DOS text mode applications.  It requires the
	  X Window System (XFree86) to operate.</para>
	</answer>
      </qandaentry>
    </qandaset>

    <qandaset arch="alpha">
      <qandaentry>
        <question>
	  <para>Can I boot from the ARC or Alpha BIOS Console?</para>
	</question>

	<answer>
	  <para>No.  &os;, like Compaq Tru64 and VMS, will only boot
	  from the SRM console.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Help!  I have no space!  Do I need to delete
	  everything first?</para>
	</question>

	<answer>
	  <para>Unfortunately, yes.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Can I mount my Compaq Tru64 or VMS extended partitions?</para>
	</question>

	<answer>
	  <para>No, not at this time.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>What about support for Compaq Tru64 (OSF/1) binaries?</para>
	</question>

	<answer>
	  <para>&os; can run Tru64 applications very well using the
	  <filename role="package">emulators/osf1_base</filename> port/package.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>What about support for Linux binaries?</para>
	</question>

	<answer>
	  <para>&os; can run AlphaLinux binaries with the assistance
	  of the <filename role="package">emulators/linux_base</filename>
	  port/package.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>What about support for NT Alpha binaries?</para>
	</question>

	<answer>
	  <para>&os; is not able to run NT applications natively,
	  although it has the ability to mount NT partitions.</para>
	</answer>
      </qandaentry>
    </qandaset>
  </sect2>
</sect1>
