freebsd/freebsd-src/libexec/bootpd/tools/bootpef/bootpef.8
.\" $FreeBSD: src/libexec/bootpd/tools/bootpef/bootpef.8,v 1.2 1999/08/28 23:08:11 mpp Exp $
.\"
.\" bootpef.8
.TH BOOTPEF 8 "4 Dec 1993" "MAINTENANCE COMMANDS"
.SH NAME
bootpef \- BOOTP Extension File compiler
.SH SYNOPSIS
.LP
.B bootpef
.RI [ "-c chdir" ]
.RI [ "-d debug-level" ]
.RI [ "-f config-file" ]
.RI [ client-name " [...]]"
.SH DESCRIPTION
.B bootpef
builds the
.I Extension Path
files described by RFC 1497 (tag 18).
If any
.I client-name
arguments are specified, then
.I bootpef
compiles the extension files for only those clients.
.SH OPTIONS
.TP
.BI \-c \ chdir\-path
Sets the current directory used by
.I bootpef
while creating extension files.  This is useful when the
extension file names are specified as relative pathnames, and
.I bootpef
needs to use the same current directory as the TFTP server
(typically /tftpboot).
.TP
.BI \-d \ debug\-level
Sets the
.I debug\-level
variable that controls the amount of debugging messages generated.
For example, -d4 or -d 4 will set the debugging level to 4.
.TP
.BI \-f \ config\-file
Set the name of the config file that specifies the option
data to be sent to each client.
.SH "SEE ALSO"
bootpd(8), tftpd(8)
.SH REFERENCES
.TP
RFC951
BOOTSTRAP PROTOCOL (BOOTP)
.TP
RFC1497
BOOTP Vendor Information Extensions


