freebsd/freebsd-src/share/man/man4/man4.aarch64/enetc.4
.\" -
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2021 Alstom Group.
.\" Copyright (c) 2021 Semihalf.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 11, 2021
.Dt ENETC 4
.Os
.Sh NAME
.Nm enetc
.Nd "Freescale ENETC PCIe Gigabit Ethernet driver"
.Sh SYNOPSIS
To compile this driver into the kernel the following lines must be present
in the kernel configuration file:
.sp
.Cd "options SOC_NXP_LS"
.Cd "device pci"
.Cd "device fdt"
.Cd "device iflib"
.Cd "device enetc"
.Sh DESCRIPTION
The
.Nm
driver provides support for ENETC Gigabit Ethernet NIC found in LS1028A SoC.
.Xr iflib 9
is used to communicate with the rest of kernel.
Both physical ports, as well as virtual interfaces connected to the internal
switch are supported.
.Pp
The following hardware offloads have been implemented in this version
of the driver:
.Bd -literal
- Receive IP checksum validation.
- VLAN tag insertion and extraction.
- VLAN tag based packet filtering.
.Ed
.Pp
For more information about configuring this device refer to
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr vlan 4 ,
.Xr ifconfig 8 ,
.Xr iflib 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 14.0 .
