freebsd/freebsd-src/share/man/man4/man4.aarch64/felix.4
.\" -
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2021 Alstom Group.
.\" Copyright (c) 2021 Semihalf.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 21, 2021
.Dt FELIX 4
.Os
.Sh NAME
.Nm felix
.Nd "driver for Microchip Ocelot Felix switch"
.Sh SYNOPSIS
To compile this driver into the kernel the following lines must be present
in the kernel configuration file:
.sp
.Cd "options SOC_NXP_LS"
.Cd "device pci"
.Cd "device fdt"
.Cd "device mdio"
.Cd "device enetc"
.Cd "device etherswitch"
.Cd "device felix"
.Sh DESCRIPTION
The
.Nm
driver provides a management interface to Microchip Ocelot Felix switch (VSC9959)
found in NXP LS1028A SoC. It is a PCI device, part of the larger ENETC
root complex. The driver is using
.Xr etherswitch 4
framework.
.Pp
This driver supports only dot1q vlan. dot1q support port base addtag, striptag,
dropuntagged, dropuntagged.
.Sh EXAMPLES
Configure dot1q vlan by etherswitchcfg command.
.Pp
.Dl # etherswitchcfg config vlan_mode dot1q
.Pp
Configure port 5 is tagging port.
.Pp
.Dl # etherswitchcfg port5 addtag
.Pp
Disable port 5 is tagging port.
.Pp
.Dl # etherswitchcfg port5 -addtag
.Sh SEE ALSO
.Xr etherswitch 4 ,
.Xr etherswitchcfg 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 14.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Kornel Duleba (mindal@semihalf.com)
and
.An Lukasz Hajec (lha@semihalf.com)

