freebsd/freebsd-src/sbin/halt/halt.8
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)halt.8	6.5 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt HALT 8
.Os BSD 4
.Sh NAME
.Nm halt
.Nd stop the processor
.Sh SYNOPSIS
.Nm halt
.Op Fl n
.Op Fl q
.Op Fl y
.Sh DESCRIPTION
.Nm Halt
writes out sandbagged information to the disks and then stops
the processor.  The machine does not reboot, even if the auto-reboot
switch is set on the console.
.Pp
Available options for
.Nm halt :
.Bl -tag -width Ds
.It Fl n
No sync before stopping.
.It Fl q
Quick halt, no graceful shutdown is attempted.
.It Fl y
This option is needed if you are trying to halt the system from a dialup.
.El
.Pp
.Nm Halt
normally logs the shutdown using
.Xr syslog 8
and places a shutdown record in the login accounting file
.Pa /var/log/wtmp.
These actions are inhibited if the
.Fl n
or
.Fl q
options are present.
.Sh SEE ALSO
.Xr reboot 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
.Sh BUGS
It is very difficult to halt a
.Tn VAX ,
as the machine wants to then
reboot itself.  A rather tight loop suffices.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
