freebsd/freebsd-src/usr.sbin/i4b/man/daic.4
.\" Copyright (c) 1997 Martin Husemann <martin@rumolt.teuto.de>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: daic.4,v 1.1 1998/02/03 12:43:07 hm Exp $
.\"
.\"	last edit-date: [Fri Jan 30 22:49:48 1998]
.\"
.\"	-mh	writing manual pages
.\"
.\"
.Dd January 30, 1998
.Dt daic 4
.Sh NAME
.Nm daic
.Nd isdn4bsd driver for EICON.Diehl active isdn cards
.Pp
The
.Nm
driver supports the old Diehl active cards:
.Em S, SX, SXn, SCOM
and
.Em QUADRO.
.Sh SYNOPSIS
.Pp
Use a config line like this
.Cd "daic0 at isa? iomem 0xd8000 irq 10"
.Pp
For a
.Em QUADRO
card use the same, the driver will detect the board type and use
all four ports, each attached as a controller of its own to the
ISDN4BSD system, which can be listed using the isdnctl utility.
.Sh DESCRIPTION
The
.Nm
driver interfaces the isdn card to the ISDN4BSD kernel subsystem.
All lower layer isdn control is handled by the card. This should
allow you to run any national isdn protocol delivered by EICON.Diehl
for your card, but the driver has only been tested with the DSS1
protocol and some parts of the cards interface are isdn protocol
dependend.
.Pp
The 
.Nm
driver is written to conform to the software interface documented
by Diehl in their
.Nm ISDN-Karten Benutzerhandbuch
from 1992.
.Sh MICROCODE DOWNLOAD
Every active card needs its own operating software before it can
work. You have to download this to the card before using it with
ISDN4BSD. Use the isdnctl utility to do this, i.e. call
.Nm "isdnctl -d te_etsi.sx 1"
to download the file
.Nm te_etsi.sx
to controller number 1. Use 
.Nm "isdnctl -l"
to list all available controllers (and ports). You have to select the 
correct isdn protocol file for your isdn interface, see the Diehl documentation
for details.
.Pp
The cards bootstrap process involves another file, which is independend
of the card type you use and the protocol you run. It is called
.Nm download.bin
in current versions of the Diehl software distribution and has to be
copied to the kernel compile directory under
.Nm dev/ic/microcode/daic
and converted into a header file used when compiling the kernel by running
.Nm make
in that directory. Your kernel compile will fail and remind you of this
if you forget to do this. Due to copright restrictions we cannot distribute
the driver with this file integrated. But if you own a card, you do have
the file (or can get it from the Diehl web server).
.Sh BUGS
The driver is not yet finished. It will only compile on NetBSD and
even there will not work. This should be fixed soon and the driver
will be ported to FreeBSD.
.Sh SEE ALSO
.Xr isdnctl 1
