freebsd/freebsd-src/usr.sbin/i4b/man/i4bq931.4
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: i4bq931.4,v 1.1 1998/12/27 21:47:14 phk Exp $
.\"
.\"	last edit-date: [Sat Dec  5 18:39:08 1998]
.\"
.Dd February 3, 1998
.Dt I4BQ931 4
.Os
.Sh NAME
.Nm i4bq931
.Nd isdn4bsd pseudo device driver handling the Q.931 protocol
.Sh FreeBSD SYNOPSIS
.Cd pseudo-device \&"i4bq931\&"
.Sh NetBSD SYNOPSIS
none
.Sh DESCRIPTION
.Nm
is the ISDN D channel layer 2 handler.
.Sh STANDARDS
ITU Recommendation Q.930 and Q.931
.Sh SEE ALSO
.Xr i4bq921 4
.Sh AUTHORS
The
.Nm
driver and this manpage were written by
.An Hellmuth Michaelis Aq hm@kts.org
