freebsd/freebsd-src/usr.sbin/i4b/man/iavc.4
.\"
.\" Copyright (c) 2001 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\"	last edit-date: [Fri May 25 09:45:35 2001]
.\"
.Dd May 22, 2001
.Dt IAVC 4
.Os
.Sh NAME
.Nm iavc
.Nd isdn4bsd AVM B1/T1 driver
.Sh SYNOPSIS
.Cd "device iavc"
.Pp
NOTE:
For the B1 ISA card
.Pp
.Dl hint.iavc.0.at="isa"
.Dl hint.iavc.0.port="0x150"  
.Dl hint.iavc.0.irq="5"
.Pp
must be added to
.Pa /boot/device.hints
.Pp
.Sh DESCRIPTION
The
.Nm
driver is used to access the AVM family of active cards to the
.Xr i4bcapi 4
driver and the
.Em isdn4bsd
package. Currently the AVM B1 PCI, the AVM B1 ISA and the AVM T1 PCI
cards are supported.
.Sh STANDARDS
CAPI 2.0 (http://www.capi.org/)
.Sh SEE ALSO
.Xr i4bcapi 4
.Sh AUTHORS
The
.Nm
device driver was written by
.An Juha-Matti Liukkonen (Cubical Solutions Ltd, Finnland) Aq jml@cubical.fi .
This manpage was written by
.An Hellmuth Michaelis Aq hm@freebsd.org .
