freebsd/freebsd-src/usr.sbin/i4b/man/ihfc.4
.\"
.\" Copyright (c) 2000, 2002 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\"	last edit-date: [Sun Jul 28 16:47:55 2002]
.\"
.Dd July 28, 2002
.Dt IHFC 4
.Os
.Sh NAME
.Nm ihfc
.Nd isdn4bsd ISA Cologne Chip HFC[-S][-SP] 2B[DS0] driver
.Sh SYNOPSIS
.Cd "device ihfc"
.Pp
NOTE:
.Pp
Something like:
.Li hint.ihfc.0.at="isa"
must be added to
.Pa /boot/device.hints
The driver will automatically probe for io-base and irq.
.Sh DESCRIPTION
The
.Nm
driver provides D-channel layer 1 supports as specified in ITU Recommendation
I.430 and layer 1 support for the B-channel.
.Pp
The driver supports some passive ISA ISDN cards based on the
HFC[-S][-SP] 2B[DS0] chips from Cologne Chip, currently this are the
Teles 16.3c ISA PnP, the AcerISDN P10 ISA PnP and the TELEINT ISDN SPEED No.1.
.Sh CAVEATS
The driver is still in an experimental state.
.Sh BUGS
Always at least one left.
.Sh STANDARDS
CCITT Recommendation I.430
.Sh SEE ALSO
.Xr i4bq921 4 ,
.Xr i4bq931 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Hans Petter Selasky Aq hselasky@c2i.net .
.Pp
This manpage was written by
.An Hellmuth Michaelis Aq hm@FreeBSD.org .
