freebsd/freebsd-src/usr.sbin/i4b/man/ihfc.4
.\"
.\" Copyright (c) 2000 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\"	last edit-date: [Fri Jan 12 09:54:31 2001]
.\"
.Dd January 12, 2001
.Dt IHFC 4
.Os
.Sh NAME
.Nm ihfc
.Nd isdn4bsd Cologne Chip Designs HFC[-S][-SP] 2B[DS0] driver
.Sh SYNOPSIS
.Pp
All PnP cards (AcerISDN P10, Teles 16.3c PnP):
.Pp
.Cd "device ihfc                (FreeBSD 4.x/5.x)"
.Pp
Non-PnP cards (TELEINT ISDN SPEED No.1):
.Pp
.Cd "device ihfc0 at isa?       (FreeBSD 4.x)"
.Pp
.Cd "device ihfc                (FreeBSD 5.x)"
NOTE: hint.ihfc.0.at="isa" must be added to /boot/device.hints
.Pp
.Pp
NOTE: The driver will automatically probe for io-base and irq.
.Pp
.Sh DESCRIPTION
The
.Nm
driver provides D-channel layer 1 supports as specified in ITU Recommendation
I.430 and layer 1 support for the B-channel.
.Pp
The driver supports passive ISA ISDN cards based on the HFC[-S][-SP] 2B[DS0]
chips from Cologne Chip Designs such as the Teles 16.3c and
the AcerISDN P10.
.Pp
.Sh CAVEATS
The driver is still in a somewhat experimental state.
.Pp
.Sh BUGS
Always at least one left.
.Sh STANDARDS
CCITT Recommendation I.430
.Sh SEE ALSO
.Xr i4bq921 4 ,
.Xr i4bq931 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Hans Petter Selasky Aq hselasky@c2i.net .
.Pp
This manpage was written by 
.An Hellmuth Michaelis Aq hm@FreeBSD.org .
