freebsd/freebsd-src/usr.sbin/i4b/man/isic.4
.\"
.\" Copyright (c) 1997, 2002 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\"	last edit-date: [Sun Jul 28 20:14:24 2002]
.\"
.Dd July 28, 2002
.Dt ISIC 4
.Os
.Sh NAME
.Nm isic
.Nd isdn4bsd Siemens ISDN Chipset device driver
.Sh SYNOPSIS
.Cd "device isic"
.Sh DESCRIPTION
The
.Nm
driver provides D-channel layer 1 supports as specified in ITU Recommendation
I.430 and layer 1 support for the B-channel.
.Pp
The driver supports several 8 and 16bit passive ISA, ISA PnP and PCI 
ISDN cards from various manufacturers which are all based upon the 
popular Siemens ISDN chipset consisting of the ISDN Subscriber Access 
Controller ISAC (such as the PEB2085 or PSB 2186) and the High-Level 
Serial Communications Controller Extended HSCX (such as the SAB82525 
or PSB21525). 
The newer IPAC chip (which integrates an ISAC and a HSCX in one chip,
with the added benefit of larger FIFO buffers) is also supported.
.Sh SUPPORTED CARDS: ISA bus, NON-PnP
.Bl -tag -width Ds -compact
.It Ar Teles S0/8, Dr. Neuhaus Niccy 1008, Creatix ISDN-S0/8
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options TEL_S0_8
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa"
hint.isic.0.maddr="0xd0000"
hint.isic.0.irq="5"
hint.isic.0.flags="1"
.Ed
.Pp
Notice that this cards must not have a
.Em port
value.
.Pp
Valid values for hint.isic.N.irq are 2, 3, 4, 5, 6 and 7.
.Pp
The i/o ports are memory mapped and the memory start address (hint.isic.N.maddr)
may be in the range 0xA0000 to 0xDF000 and use a region of 4kB of memory.
.Pp
.It Ar Teles S0/16, Creatix ISDN-S0, Dr. Neuhaus Niccy 1016
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options TEL_S0_16
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa"
hint.isic.0.port="0xd80"
hint.isic.0.maddr="0xd0000"
hint.isic.0.irq="5"
hint.isic.0.flags="2"
.Ed
.Pp
These boards have a jumper which specifies an i/o base address
(hint.isic.N.port) of either 0xd80, 0xe80 or 0xf80. 
The remaining necessary configuration values are then
programmed at run time by accessing this i/o port.
.Pp
Valid interrupts (hint.isic.N.irq) are 2, 3, 4, 5, 10, 11, 12 or 15.
.Pp
Valid memory start addresses (hint.isic.N.maddr) are 
0xC0000, 0xC2000, 0xC4000, 0xC6000, 0xC8000, 0xCA000, 0xCC000, 0xCE000, 
0xD0000, 0xD2000, 0xD4000, 0xD6000, 0xD8000, 0xDA000, 0xDC000 and
0xDE000.
.Pp
Notice: Although the jumpers are labeled 0xd80, 0xe80 or 0xf80, they
also require i/o space at addresses 0x180, 0x280 or 0x380.
.Pp
.It Ar Teles S0/16.3
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options TEL_S0_16_3
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa"
hint.isic.0.port="0xd80"
hint.isic.0.irq="5"
hint.isic.0.flags="3"
.Ed
.Pp
This card is completely i/o mapped and must not have an
.Em maddr
statement in the hints file.
.Pp
Valid interrupts (hint.isic.N.irq) are 2, 5, 9, 10, 12 or 15.
.Pp
These boards have a jumper which specifies an i/o base address
(hint.isic.N.port) of either 0xd80, 0xe80 or 0xf80.
.Pp
Notice: Although the switch positions are labeled 0x180, 0x280 and 0x380,
the card is to be configured at 0xd80, 0xe80 or 0xf80 respectively!
.Pp
.It Ar AVM A1 and AVM Fritz!Card
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options AVM_A1
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa" 
hint.isic.0.port="0x340"
hint.isic.0.irq="5"
hint.isic.0.flags="4"
.Ed
.Pp
These boards have a jumper which specifies an i/o base address (hint.isic.N.port)
of either 0x200, 0x240, 0x300 or 0x340.
.Pp
Valid interrupt (hint.isic.N.irq) values are 3, 4, 5, 6, 7, 10, 11, 12 or 15.
.Pp
Older Versions of the AVM A1 also require setting of an IRQ jumper, newer
versions of this and the Fritz!Card only have an i/o base jumper and the
interrupt is setup at runtime by reprogramming a register.
.Pp
.It Ar USRobotics Sportster ISDN TA intern and Stollmann Tina pp
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options USR_STI
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa"   
hint.isic.0.port="0x268"
hint.isic.0.irq="5"
hint.isic.0.flags="7"
.Ed
.Pp
Valid i/o port values (hint.isic.N.port) are 0x200, 0x208, 0x210, 0x218, 
0x220, 0x228, 0x230, 0x238, 0x240, 0x248, 0x250, 0x258, 0x260, 0x268, 
0x270 and 0x278.
.Pp
Valid interrupt (hint.isic.N.irq) values are 5, 7, 10, 11, 12, 14, 15.
.Pp
Notice: this card has a strange address decoding scheme resulting in 
occupying 64 windows of some bytes length over the whole i/o address
range.
.Pp
.It Ar ITK ix1 Micro ( < V.3, non-PnP version )
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options ITKIX1
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa" 
hint.isic.0.port="0x398"
hint.isic.0.irq="10"
hint.isic.0.flags="18" 
.Ed
.Pp
Valid i/o port values must be in the range (<unknown>).
.Pp
Valid interrupt configurations are (<unknown>).
.Pp
.It Ar ELSA MicroLink ISDN/PCC-16 and ELSA PCFpro
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options ELSA_PCC16
.Ed
.Pp
The required entry in 
.Xr device.hints 5
file is:
.Pp
.Bd -literal -offset indent
hint.isic.0.at="isa" 
hint.isic.0.port="0x360"
hint.isic.0.irq="10"
hint.isic.0.flags="20"
.Ed
.Pp
Valid i/o port (hint.isic.N.port) values are 0x160, 0x170, 0x260 and 0x360.
.Pp
Valid interrupt (hint.isic.N.irq) values are 2, 3, 5, 10, 11 and 15.
.Pp
The LED's are not supported and are off.
.Pp
.El
.Sh SUPPORTED CARDS: ISA bus, PnP (Plug 'n Pray)
.Bl -tag -width Ds -compact
.It Ar Teles S0/16.3 PnP
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options TEL_S0_16_3_P
.Ed
.Pp
.It Ar Creatix ISDN-S0 P&P
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options CRTX_S0_P
.Ed
.Pp
.It Ar "Dr. Neuhaus Niccy Go@"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options DRN_NGO
.Ed
.Pp
.It Ar "Sedlbauer Win Speed"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options SEDLBAUER
.Ed
.Pp
.It Ar "Dynalink IS64PH"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options DYNALINK
.Ed
.Pp
.It Ar "ELSA QuickStep 1000pro ISA"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options ELSA_QS1ISA
.Ed
.Pp
The LED's are not supported and are off.
.Pp
.It Ar "Siemens I-Surf 2.0"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options SIEMENS_ISURF2
.Ed
.Pp
.It Ar "Asuscom ISDNlink 128K ISA"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options ASUSCOM_IPAC
.Ed
.Pp
.It Ar "Eicon Diehl DIVA 2.0 and 2.02"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options EICON_DIVA
.Ed
.Pp
.It Ar "Compaq Microcom 610 ISDN card (Compaq series PSB2222I)"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options COMPAQ_M610
.Ed
.Pp
.El
.Sh SUPPORTED CARDS: PCI bus
.Bl -tag -width Ds -compact
.It Ar "ELSA QuickStep 1000pro-PCI"
.Pp
The required entry in the kernel config file is:
.Bd -literal -offset indent
options ELSA_QS1PCI
.Ed
.Pp
The LED's are not supported and are off.
.Pp
.El
.Sh CAVEATS
Note that all of ISA boards with i/o ports actually use several ranges
of port addresses; Teles happen to refer to the 0xd80 range in their
documentation (the board also uses 0x180 etc.), while AVM happen to refer
to the 0x200 range in their documentation (the board also uses 0x600 etc.)
The driver matches the manufacturers' description for the purposes of
configuration, but of course makes use of all the ports in order to
operate the card.
.Sh BUGS
Since there is no hardware documentation available from the manufacturers
of several boards, it is likely that there are many bugs left.
.Sh STANDARDS
CCITT Recommendation I.430
.Sh SEE ALSO
.Xr i4bq921 4 ,
.Xr i4bq931 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver and this manpage were written by
.An Hellmuth Michaelis Aq hm@freebsd.org .
It is based on earlier work of
.An Arne Helme ,
.An Andrew Gordon
and
.An Gary Jennejohn Aq gj@freebsd.org .


