<!--
  The FreeBSD Documentation Project
  The FreeBSD German Documentation Project
  $FreeBSD$
  $FreeBSDde: de-docproj/relnotes/de_DE.ISO8859-1/early-adopter/article.sgml,v 1.4 2002/11/02 02:12:07 ue Exp $
  basiert auf: 1.4
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;

<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;

<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;

<!ENTITY % teams PUBLIC "-//FreeBSD//ENTITIES DocBook Team Entities//EN">
%teams;

<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//DE">
%mailing-lists;

<!ENTITY % release PUBLIC "-//FreeBSD//ENTITIES Release Specification//EN">
%release;
]>

<article>
  <articleinfo>
    <title>Hinweise f&uuml;r die ersten Anwender von &os; 5.0-RELEASE</title>

    <authorgroup>
      <corpauthor>The &os; Release Engineering Team</corpauthor>
    </authorgroup>

    <pubdate>$FreeBSD$</pubdate>

    <copyright>
      <year>2002</year>
      <holder role="mailto:re@FreeBSD.org">The &os; Release
        Engineering Team</holder>
    </copyright>
  </articleinfo>

  <sect1>
    <title>Einf&uuml;hrung</title>

    <para>Nach &uuml;ber zwei Jahren steht mit &os; 5.0 wieder eine
      komplett neue &os;-Version zur Verf&uuml;gung.  Sie bietet nicht
      nur diverse neue M&ouml;glichkeiten, auch und gerade
      <quote>unter der Haube</quote> hat sich einiges verbessert.  Der
      Nachteil dieser Neuerungen ist, da&szlig; gro&szlig;e Teile des
      Systems neu und nicht ausreichend getestet sind.  Im Vergleich
      zu den existierenden 4.<replaceable>X</replaceable> Versionen
      kann der Schritt zu 5.0 zu Verschlechterungen in den Bereichen
      Stabilit&auml;t, Leistung und teilweise auch Funktionalit&auml;t
      f&uuml;hren.</para>

    <para>Aus diesen Gr&uuml;nden warnen wir alle Anwender, ihre
      Systeme <emphasis>nicht</emphasis> blind von &auml;lteren
      &os;-Versionen auf 5.0 zu aktualisieren.  Gerade konservative
      Anwender sollten in der nahen Zukunft
      4.<replaceable>X</replaceable>-Versionen (wie 4.7-RELEASE oder
      das demn&auml;chst erscheinende 4.8-RELEASE) benutzen.  Wir
      meinen, da&szlig; diese Anwender erst zu
      5.<replaceable>X</replaceable> wechseln sollten, nachdem der
      Entwicklungszweig 5-STABLE existiert, der wahrscheinlich nach
      der Ver&ouml;ffentlichung von 5.1-RELEASE oder 5.2-RELEASE
      eingerichtet werden wird.</para>

    <para>Hier zeigt sich das <quote>Henne und Ei</quote> Problem bei
      der Ver&ouml;ffentlichung von &os; 5.0.  Alle am &os;  Project
      beteiligten Personen wollen ein 5.0-RELEASE, das m&ouml;glichst
      stabil und zuverl&auml;ssig ist.  Um dieses Ziel zu erreichen,
      m&uuml;ssen die neue Version und speziell die neuen Komponenten
      von m&ouml;glichst vielen Anwendern getestet werden.
      Dummerweise gibt es bei realistischer Betrachtung nur eine
      M&ouml;glichkeit, eine gr&ouml;&szlig;ere Anzahl an Anwender
      f&uuml;r einen Test zu gewinnen:  Die Ver&ouml;ffentlichung der
      zu testenden Version!</para>

    <para>Dieser Artikel beschreibt einige der Probleme, die bei der
      Installation und Benutzung von &os; 5.0-RELEASE auftreten
      k&ouml;nnen.  Zuerst wird beschrieben, wie eine neue FreeBSD
      Version ver&ouml;ffentlicht wird.  Dann werden die
      interessanteren Neuerungen in FreeBSD 5.0 und die Bereiche, in
      denen (gerade f&uuml;r unvorsichtige Anwender) Probleme
      auftreten k&ouml;nnen, vorgestellt.  Anwender, die erst einmal
      bei Systemen auf Basis von 4-STABLE bleiben m&ouml;chten,
      erhalten einen kurzen Ausblick auf die kurz- und mittelfristigen
      Planungen f&uuml;r diesen Entwicklungszweig.  Zuletzt wird
      besprochen, was bei einer Aktualisierung eines existierenden
      4.<replaceable>X</replaceable> Systems auf 5.0 beachtet werden
      mu&szlig;.</para>
  </sect1>

  <sect1>
    <title>Ver&ouml;ffentlichung neuer &os;-Versionen</title>

    <para>Das Prinzip der &os;-Entwicklung ist die Verwendung mehrerer
      Entwicklungszweige innerhalb eines <quote>CVS
      Repository</quote>.  Der Hauptzweig wird <quote>CURRENT</quote>
      genannt und innerhalb des Repository mit dem symbolischen Namen
      <literal>HEAD</literal> referenziert.  Neuerungen werden
      zun&auml;chst in diesen Zweig eingebracht.  Das bedeutet zwar,
      da&szlig; neue M&ouml;glichkeiten zun&auml;chst einmal nur in
      CURRENT zur Verf&uuml;gung stehen, es bedeutet allerdings auch,
      da&szlig; dieser Zweig von Zeit zu Zeit Kummer bereitet,
      w&auml;hrend die Neuerungen getestet und ihre Fehler entfernt
      werden.</para>

    <para>Wenn eine neue &os;-Version ver&ouml;ffentlicht wird,
      basiert diese in der Regel auf einem der <quote>STABLE</quote>
      (stabil) genannten Entwicklungszweige.  Neuerungen werden nur in
      diese Entwicklungszweige &uuml;bernommen, nachdem sie in CURRENT
      getestet wurden.  Zur Zeit gibt es nur einen aktiven STABLE
      Entwicklungszweig: <quote>4-STABLE</quote>;  dieser Zweig war
      die Grundlage f&uuml;r alle 4.<replaceable>X</replaceable>
      Versionen.  Dieser Zweig wird innerhalb des CVS Repository durch
      den symbolischen Namen <literal>RELENG_4</literal>
      gekennzeichnet.</para>

    <para>Die Basis f&uuml;r &os; 5.0 wird der Entwicklungszweig
      CURRENT sein.  Damit wird zum ersten Mal nach &uuml;ber zwei
      Jahren eine neue Version auf Basis dieses Entwicklungszweiges
      erscheinen (die letzte war &os; 4.0, im M&auml;rz 2000).</para>

    <para>Einige Zeit nach der Ver&ouml;ffentlichung von &os; 5.0 wird
      im &os; CVS Repository der Zweig <quote>5-STABLE</quote> mit dem
      symbolischen Namen <literal>RELENG_5</literal> erzeugt werden.
      Die letzten beiden Entwicklungszweige dieser Art (3-STABLE und
      4-STABLE) wurden unmittelbar nach der Ver&ouml;ffentlichung der
      jeweiligen <quote>Punkt Null</quote> Versionen (3.0 bzw. 4.0)
      erzeugt.  R&uuml;ckblickend m&uuml;ssen wir feststellen,
      da&szlig; dadurch weder CURRENT noch der neue Entwicklungszweig
      gen&uuml;gend Zeit hatten, um einen stabilen Zustand zu
      erreichen.</para>

    <para>Aus diesem Grund wird das Release Engineering Team den neuen
      5-STABLE Entwicklungszweig erst dann im CVS Repository
      einrichten, wenn eine solide Grundlage zur Verf&uuml;gung steht.
      Es ist sehr wahrscheinlich, da&szlig; vorher mehrere
      5.<replaceable>X</replaceable> Versionen erscheinen werden; zur
      Zeit rechnen wir damit, da&szlig; 5-STABLE nach dem Erscheinen
      von 5.1-RELEASE oder 5.2-RELEASE erzeugt werden wird.</para>

    <para>Weitere Informationen &uuml;ber den Ablauf bei der
      Ver&ouml;ffentlichung einer neuen &os; Version finden Sie auf
      den <ulink
      url="http://www.FreeBSD.org/releng/index.html">Release
      Engineering Web pages</ulink> und im Artikel <ulink
      url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/releng/index.html">Release
      Engineering</ulink>.</para>
  </sect1>

  <sect1>
    <title>Neuerungen</title>

    <para>Die Glanzpunkte von &os; 5.0 sind die vielen Neuerungen.
      Diese Neuerungen und die neue Funktionalit&auml;t basieren zum
      gr&ouml;&szlig;ten Teil auf massiven &Auml;nderungen der
      Systemarchitektur, die nicht in den Entwicklungszweig 4-STABLE
      eingepflegt wurden.  Viele in sich abgeschlossene
      &Auml;nderungen wie Treiber f&uuml;r neue Ger&auml;te oder neue
      Benutzerprogramme wurden dagegen schon nach 4-STABLE
      &uuml;bernommen.  Die folgende Liste enth&auml;lt eine kurze
      &Uuml;bersicht &uuml;ber die wichtigsten Neuerungen in &os;
      5.0:</para>

    <itemizedlist>
      <listitem>
	<para>SMPng: Die <quote>n&auml;chste Generation</quote> der
	  Unterst&uuml;tzung f&uuml;r Systeme mit mehreren Prozessoren
	  (noch nicht abgeschlossen).  Es ist jetzt m&ouml;glich,
	  da&szlig; mehrere Prozessoren gleichzeitig den Kernel
	  nutzen.</para>
      </listitem>

      <listitem>
	<para>KSE:  Die <quote>Kernel Scheduled Entities</quote>
	  erlauben es einem Prozess, mehrere Threads auf Kernel-Ebene
	  zu nutzen, analog zur Aktivierung via Scheduler.</para>
      </listitem>

      <listitem>
	<para>Neue Plattformen:  Zus&auml;tzlich zu i386, pc98 und
	  Alpha werden jetzt auch sparc64 und ia64 Systeme
	  unterst&uuml;tzt.</para>
      </listitem>

      <listitem>
	<para>GCC:  Der Compiler und die dazugeh&ouml;irgen Werkzeuge
	  basieren jetzt auf GCC 3.<replaceable>X</replaceable> und
	  nicht mehr auf GCC
	  2.95.<replaceable>X</replaceable>.</para>
      </listitem>

      <listitem>
	<para>MAC:  Unterst&uuml;tzung f&uuml;r erweiterbare
	  <quote>Mandatory Access Control</quote> Regelwerke.</para>
      </listitem>

      <listitem>
	<para>GEOM:  Ein flexibles Ger&uuml;st zur Manipulation von
	  Daten beim Transfer von und zu Festplatten.  Auf dieser
	  Basis wurde ein experimentelles Modul zur
	  Verschl&uuml;sselung des Festplatteninhaltes
	  entwickelt.</para>
      </listitem>

      <listitem>
	<para>FFS: Das Dateisystem unterst&uuml;tzt jetzt
	  Hintergrund-&man.fsck.8; (um das System nach einem Absturz
	  schneller verf&uuml;gbar zu machen) sowie
	  <quote>Schnappsch&uuml;sse</quote>.</para>
      </listitem>

      <listitem>
	<para>UFS2:  Dieses neue Dateisystem unterst&uuml;tzt
	  gr&ouml;&szlig;ere Dateien und zus&auml;tzliche
	  Dateiberechtigungen.</para>
      </listitem>

      <listitem>
	<para>Cardbus:  Cardbus wird jetzt unterst&uuml;tzt.</para>
      </listitem>
    </itemizedlist>

    <para>Eine ausf&uuml;hrlichere &Uuml;bersicht &uuml;ber die
      Neuerungen finden Sie in den <quote>Release Notes</quote>
      f&uuml;r &os; 5.0.</para>
  </sect1>

  <sect1>
    <title>Nachteile f&uuml;r fr&uuml;hre Anwender</title>

    <para>Ein Nachteil der Neuerungen in &os; 5.0 ist, da&szlig; es in
      einigen Bereichen auf Grund der noch nicht abgeschlossenen
      Entwicklung zu Problemen oder zu unerwarteten Effekten kommen
      kann.  Einige (aber nicht alle) der Problemzonen sind in der
      folgenden Liste zusammengefa&szlig;t:</para>

    <itemizedlist>
      <listitem>
	<para>Die Arbeit an diversen Neuerungen ist noch nicht
	  abgeschlossen, dazu geh&ouml;ren unter anderem SMPng und
	  KSE.</para>
      </listitem>

      <listitem>
	<para>Durch die &Auml;nderungen in den Datenstrukturen des
	  Kernels und der Schnittstellen f&uuml;r Anwendungen und
	  Programmierer (ABI/API), m&uuml;ssen Treiber anderer
	  Hersteller angepa&szlig;t werden, damit sie korrekt mit
	  &os; 5.0 zusammenarbeiten.</para>
      </listitem>

      <listitem>
	<para>Einige Teile des &os; Basissystems wurden in die Ports
	  Collection verschoben.  Dazu geh&ouml;ren insbesondere
	  <application>Perl</application>,
	  <application>UUCP</application> und die meisten (nicht alle)
	  Spiele.  Diese Programme werden zwar weiterhin entwickelt
	  und unterst&uuml;tzt, es kann aber verwirren, da&szlig; sie
	  nicht mehr Teil des Basissystems sind.</para>
      </listitem>

      <listitem>
	<para>Viele Ports und Packages, die mit &os; 4-STABLE noch
	  korrekt liefen, k&ouml;nen mit &os; 5.0 nicht genutzt
	  oder nicht compiliert werden.  Der Grund ist in der Regel
	  der neue Compiler oder die Aufr&auml;umarbeiten in den
	  Header-Dateien.</para>
      </listitem>

      <listitem>
	<para>Da &os; 5.0 nach &uuml;ber zwei Jahren Entwicklung
	  die erste Version auf Basis des Entwicklungszweiges CURRENT
	  ist, wurden viele Neuerungen bisher nur auf relativ wenigen
	  Systemen getestet.  Viele dieser Neuerungen (wie SMPng)
	  haben Auswirkungen auf gro&szlig;e Bereiche des
	  Kernels.</para>
      </listitem>

      <listitem>
	<para>Die Neuerungen in &os; 5.0 enthalten noch Routinen
	  zur Unterst&uuml;tzung bei der Fehlersuche und Diagnose.
	  Dadurch kann es dazu kommen, da&szlig; ein System mit
	  &os; 5.0 langsamer ist als mit 4-STABLE.</para>
      </listitem>

      <listitem>
	<para>Neuerungen werden erst in den Entwicklungszweig 4-STABLE
	  &uuml;bernommen, nachdem sie eine Zeit lang in -CURRENT
	  <quote>gereift</quote> sind.  Bei &os; 5.0 fehlt dieser
	  stabilisierende Effekt eines -STABLE Entwicklungszweiges.
	  Der Entwicklungszweig 5-STABLE wird wahrscheinlich erst
	  einige Zeit nach der Ver&ouml;ffentlichung von 5.1-RELEASE
	  oder 5.2-RELEASE eingerichtet werden.</para>
      </listitem>
    </itemizedlist>

    <para>Da einige dieser Probleme auch negative Auswirkungen auf die
      Stabilit&auml;t des Systems haben, r&auml;t das Release
      Engineering Team konservativen Anwendern und Firmen, Versionen
      aus dem Entwicklungszweig 4-STABLE zu verwenden, bis die
      5.<replaceable>X</replaceable> Versionen zuverl&auml;ssiger
      geworden sind.</para>
  </sect1>

  <sect1>
    <title>Die Zukunft des Entwicklungszweiges 4-STABLE</title>

    <para>Die Ver&ouml;ffentlichung von &os; 5.0 bedeutet nicht das
      Ende der Entwicklungszweiges 4-STABLE.  Es wird auf jeden Fall
      noch eine weitere Version auf der Basis dieses
      Entwicklungszweiges geben:  Das voraussichtlich am 1. Februar
      2003 erscheinende 4.8-RELEASE.</para>

    <para>Zum gegenw&auml;rtigen Zeitpunkt hat das Release Engineering
      Team noch keine Entscheidung &uuml;ber weitere Versionen
      (jenseits von 4.8) auf Basis des Entwicklungszweiges 4-STABLE
      getroffen.  Allerdings ist es sehr wahrscheinlich, da&szlig; es
      ein 4.9-RELEASE oder sogar ein 4.10-RELEASE geben wird.  Dies
      h&auml;ngt von mehreren Faktoren ab, der wichtigste davon ist
      die Existenz und Stabilit&auml;t des Entwicklungszweiges
      5-STABLE.  Wenn CURRENT nicht stabil genug ist, um einen
      Entwicklungszweiges 5-STABLE zu rechtfertigen, werden weitere
      Versionen auf Basis des Entwicklungszweiges 4-STABLE
      m&ouml;glich und notwendig sein.  Bis zum Erscheinen der
      offiziell letzten Version auf Basis von 4-STABLE bleibt es den
      Entwicklern &uuml;berlassen, ob sie Neuerungen aus HEAD in
      4-STABLE einpflegen (im Rahmen der schon bestehenden
      Regelungen).</para>

    <para>Bis zu einem gewissen Grad wird das Release Engineering Team
      auch die W&uuml;nsche der Benutzer nach weiteren Versionen auf
      Basis von 4-STABLE beachten.  Allerdings nur, so weit dies im
      Rahmen der beschr&auml;nkten Ressourcen m&ouml;glich
      ist.</para>

    <para>Neue Versionen auf Basis des Entwicklungszweiges 4-STABLE
      werden vom &a.security-officer; im &uuml;blichen Rahmen
      unterst&uuml;tzt werden, genauere Informationen dazu finden Sie
      auf der <ulink
      url="http://www.FreeBSD.org/security/index.html">Security
      page</ulink> auf der &os; Webseite.  In der Regel werden die
      letzten beiden Versionen jedes Entwicklungszweiges durch die
      Ver&ouml;ffentlichung von Sicherheitshinweisen und Patches
      unterst&uuml;tzt; dem Team ist es allerdings freigestellt, diese
      Unterst&uuml;tzung auf weitere Versionen auszudehnen.</para>
  </sect1>

  <sect1>
    <title>Hinweise f&uuml;r die Aktualisierung</title>

    <para>Dieses Kapitel enth&auml;lt Hinweise f&uuml;r Anwender, die
      ihr bestehendes &os; 4.<replaceable>X</replaceable> System auf
      &os; 5.<replaceable>X</replaceable> aktualisieren wollen.  Wie
      bei jeder Aktualisierung ist es auf jeden Fall notwendig, voher
      die Release Notes und die Errata der neuen Version zu lesen; bei
      Aktualisierung &uuml;ber den Quellcode ist
      <filename>src/UPDATING</filename> Pflichtlekt&uuml;re.</para>

    <sect2>
      <title>Aktualisierung ohne Quellcode</title>

      <para>Der einfachste Ansatz ist immer noch
        <quote>Sicherheitskopien erstellen, Platte formatieren, neues
	System installieren, Daten wieder einspielen</quote>.  Dadurch
	werden alle Probleme mit veralteten und nicht kompatiblen
	Programmen und Konfigurationsdateien umgangen.</para>

      <para>Zum gegenw&auml;rtigen Zeitpunkt hat noch niemand
	ausf&uuml;hrlich getestet, ob und wie gut die
	<quote>Upgrade</quote>-Option in &man.sysinstall.8; bei einem
	Update von 4.0 zu 5.0 funktioniert.  Wir raten daher dringend
	von der Verwendung dieser Funktion ab.</para>

      <para>Auf i386 und pc98 Systemen kann die Konfiguration von ISA
	Ger&auml;ten beim Start System mit Werkzeug UserConfig
	eingestellt werden, dies gilt auch beim Start von einem
	Installations-Medium.  Dieses Programm wurde in &os; 5.0 durch
	&man.device.hints.5; ersetzt; dieses stellt zwar die gleiche
	Funktionalit&auml;t bereit, ist aber nicht interaktiv
	nutzbar.</para>

      <para>Bei einer Installation von Diskette kann es notwendig
	werden, die neue Treiber-Diskette zu benutzen.  Das
	<filename>drivers.flp</filename> Diskettenimage sollte im
	allgemeinen &uuml;berall dort verf&uuml;gbar sein, wo auch
	schon die bekannten <filename>kern.flp</filename> und
	<filename>mfsroot.flp</filename> verf&uuml;gbar sind.</para>

      <para>Bei einer Installation von CD-ROM auf einem i386-System
	wird jetzt ein neues Startprogramm mit dem Namen
	<quote>no-emulation boot loader</quote> genutzt.  Dadurch ist
	es unter anderem m&ouml;glich, auf der CD den Standardkernel
	(<literal>GENERIC</literal>) statt des auf den Disketten
	verwendeten Mini-Kernels zu nutzen.  Jedes System, das von den
	Installations-CDs f&uuml;r Windows NT 4.0 booten kann, sollte
	auch mit der &os; 5.0 CD-ROM zurechtkommen.</para>
    </sect2>

    <sect2>
      <title>Aktualisierung mit Quellcode</title>

      <para>Es ist auf jeden Fall erforderlich, vor der Aktualisierung
	<filename>src/UPDATING</filename> zu lesen.  Der Abschnitt
	<quote>To upgrade from 4.x-stable to current</quote>
	enth&auml;lt eine Schritt-f&uuml;r-Schritt Anleitung, der Sie
	unbedingt folgen m&uuml;ssen, die Nutzung der &uuml;blichen
	<quote>Abk&uuml;rzungen</quote> ist nicht
	m&ouml;glich.</para>
    </sect2>

    <sect2>
      <title>Allgemeine Hinweise</title>

      <para><application>Perl</application> wurde aus dem Basissystem
	entfernt und sollte entweder via Package oder &uuml;ber die
	Ports Collection installiert werden.  Die bisher &uuml;bliche
	Praxis, Perl als Teil des Basissystem zu behandeln und mit ihm
	zusammen zu compilieren, f&uuml;hrte zu diversen Problemen,
	die eine Aktualisierung von Perl erschwerten.  Die im
	Standardsystem vorhandenen Programme, die Perl
	ben&ouml;tigten, wurden entweder in einer anderen Sprache neu
	geschrieben (wenn sie noch ben&ouml;tigt wurden) oder
	ersatzlos entfernt (wenn sie &uuml;berfl&uuml;ssig
	waren).</para>

      <para>Es ist zwar m&ouml;glich, Programme aus
	4.<replaceable>X</replaceable> mit
	5.<replaceable>X</replaceable> zu betreiben, allerdings
	mu&szlig; dazu die Distribution <filename>compat4x</filename>
	installiert sein.  Damit <emphasis>k&ouml;nnte</emphasis> es
	auch m&ouml;glich sein, alte Ports zu benutzen.</para>

      <para>Bei der Aktualisierung eines bestehenden Systems auf Basis
	von 4-STABLE, ist es unbedingt notwendig, die alten Dateien in
	<filename>/usr/include</filename> zu l&ouml;schen.  Im
	allgemeinen ist es ausreichend, dieses Verzeichnis vor der
	Installation bzw. vor dem
	<maketarget>installworld</maketarget> zu entfernen.  Wird das
	Verzeichnis nicht entfernt, kann es zu Problemen kommen
	(speziell mit C++-Programmen), da der Compiler dann einen Mix
	aus alten und neuen Headerdateien verwendet.</para>
    </sect2>
  </sect1>

  <sect1>
    <title>Zusammenfassung</title>

    <para>&os; 5.0 enth&auml;lt zwar viele interessante Neuerungen,
      aber es ist noch nicht f&uuml;r alle Anwender geeignet.  Aus
      diesem Grund haben wir in diesem Dokument Informationen
      &uuml;ber die Abl&auml;ufe bei der Ver&ouml;ffentlichung einer
      neuen Version, die interessantesten Neuerungen und
      wahrscheinliche Probleme gegeben.  Weiterhin enthielt er einen
      Ausblick auf die Zukunft des Entwicklungszweiges 4-STABLE und
      Informationen f&uuml;r Anwender, die schon jetzt auf 5.0
      umsteigen wollen.</para>
  </sect1>
</article>
