<!--

$FreeBSD$
$FreeBSDde: de-docproj/relnotes/de_DE.ISO8859-1/installation/common/install.sgml,v 1.2.2.5 2002/05/12 11:45:24 mheinen Exp $
basiert auf: 1.1.2.12

install.sgml

This file has architecture-dependent installation instructions, culled
from {alpha,i386}/INSTALL.TXT.

-->

<sect1>
  <title>Wie installiere ich &os;</title>

  <para>In diesem Kapitel erfahren Sie, wie Sie &os; installieren.
    Der Schwerpunkt liegt dabei auf dem Bezug der &os;
    &release.current; Distribution und dem Start der Installation.  Im
    Kapitel <ulink
    url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/install.html"><quote>Installing
    FreeBSD</quote></ulink> des <ulink
    url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/">FreeBSD
    Handbuch</ulink> finden Sie genauere Informationen &uuml;ber das
    Installationsprogramm, einschlie&szlig;lich einer
    ausf&uuml;hrlichen, bebilderten Installationsleitung.</para>

  <para>Wenn Sie eine &auml;ltere Version von &os; aktualisieren
    wollen, sollten Sie <xref linkend="upgrading">, Aktualisierung von
    FreeBSD, lesen.</para>

  <sect2 id="getting-started">
    <title>Der Einstieg</title>

    <para>Bevor Sie mit der Installation beginnen, sollten Sie auf
      jeden Fall alle Anleitungen, die Sie zusammen mit &os; erhalten
      haben.  Eine &Uuml;bersicht der zu dieser &os;-Version
      geh&ouml;renden Dokumente finden Sie in
      <filename>README.TXT</filename>, die sich normalerweise an der
      gleichen Stelle wie diese Datei befindet.  Die meisten der dort
      erw&auml;hnten Dokumente, wie die Release Notes und Liste der
      unterst&uuml;tzten Ger&auml;te, stehen auch im Men&uuml;
      Dokumentation des Installationsprogramms zur
      Verf&uuml;gung.</para>

    <para>Die elektronischen Versionen des &os; <ulink
      url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/faq/">FAQ</ulink>
      und des <ulink
      url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/">Handbuchs</ulink>
      sind auch auf der <ulink url="http://www.FreeBSD.org/">FreeBSD
      Project Web site</ulink> erh&auml;ltlich, wenn Sie einen
      Internet-Zugang haben.</para>

    <para>Der Umfang der Dokumentation schreckt zwar im ersten Moment
      etwas ab, aber die Zeit, die Sie f&uuml;r die Lekt&uuml;re
      brauchen, wird sich lohnen.  Au&szlig;erdem ist es vorteilhaft,
      die zur Verf&uuml;gung stehenden Ressourcen zu kennen, wenn
      w&auml;hrend der Installation ein Problem auftreten
      sollte.</para>

    <para>Irgend etwas kann immer schiefgehen und wenn Ihnen das
      passiert, sollten Sie einen Blick in <xref
      linkend="trouble"> werfen, wo Sie hilfreiche Informationen
      finden k&ouml;nnen.  Sie sollten ebenfalls einen Blick auf die
      aktuelle Version von <filename>ERRATA.TXT</filename> werfen,
      bevor Sie mit der Installation beginnen, da Sie dort
      Informationen &uuml;ber alle die Probleme finden, die seit der
      Ver&ouml;ffentlichung gefunden wurden.</para>

    <important>
      <para>Das Installationsprogramm f&uuml;r &os; tut sein
        m&ouml;glichstes, um Sie vor Datenverlusten zu bewahren,
        trotzdem ist es denkbar, da&szlig; Sie Ihre <emphasis>gesamte
        Festplatte l&ouml;schen</emphasis>, wenn Sie einen Fehler
        machen.  Stellen Sie sicher, da&szlig; Sie ein brauchbares
        Backup haben, bevor Sie die Installation
        durchf&uuml;hren.</para>
    </important>

  <sect2>
    <title>Hardware-Anforderungen</title>

    <para arch="i386">Wenn Sie &os; auf einem &arch.print; System
      benutzen wollen, mu&szlig; das System mindestens &uuml;ber einen
      80386 Prozessor verf&uuml;gen.  Das Installationsprogramm
      &man.sysinstall.8; ben&ouml;tigt 16 MByte; nach der Installation
      l&auml;uft &os; mit einem entsprechenden Kernel mit 4&ndash;8
      MByte RAM. Sie brauchen mindestens 100 MByte freien Platz auf
      der Festplatte f&uuml;r die absolute Minimalinstallation;  ein
      realistischerer Wert liegt bei 250&ndash;350 MByte.  Weiter
      unten finden Sie Hinweise, wie Sie existierende Partitionen
      verkleinern k&ouml;nnen, um Platz f&uuml;r &os; zu
      schaffen.</para>

    <para arch="alpha">&os; f&uuml;r &arch.print; unterst&uuml;tzt die
      in <filename>HARDWARE.TXT</filename> genannten Systeme.</para>

    <para arch="alpha">Sie ben&ouml;tigen auf jeden Fall eine eigene
      Festplatte f&uuml;r &os;/alpha.  Zum jetzigen Zeitpunkt ist
      es nicht m&ouml;glich, eine Festplatte mit einem anderen
      Betriebssystem zu teilen.  Diese Festplatte mu&szlig; an einen
      SCSI Controller angeschlossen werden, der vom System Ressource
      Manager (SRM) unterst&uuml;tzt wird.  Sie k&ouml;nnen auch eine
      IDE Festplatte verwenden, wenn der SRM in Ihrer Maschine in der
      Lage ist, davon zu booten.</para>

    <para arch="alpha">Damit Sie von einer Festplatte booten
      k&ouml;nnen, mu&szlig; sich das Root Dateisystem in der ersten
      Partition (Partition <literal>a</literal>) befinden.</para>

    <para arch="alpha">Sie ben&ouml;tigen auf jeden Fall die Firmware
      f&uuml;r die SRM Konsole f&uuml;r Ihr System.  In einigen
      F&auml;llen ist es m&ouml;glich, zwischen AlphaBIOS (oder ARC)
      und SRM umzuschalten.  In anderen F&auml;llen ist es notwendig,
      die neue Firmware von der Webseite des Herstellers zu
      beziehen.</para>

    <para>Wenn Sie noch nie Ger&auml;te f&uuml;r &os; konfiguriert
      haben, sollten Sie auf jeden Fall einen Blick in die Datei
      <filename>HARDWARE.TXT</filename> werfen, hier finden Sie
      Informationen, welche Ger&auml;te von &os; unterst&uuml;tzt
      werden.</para>
  </sect2>

  <sect2 id="floppies">
    <title>Erzeugung der Bootdisketten</title>

    <para>In einigen F&auml;llen m&uuml;ssen Sie einen Satz Disketten
      erstellen, um &os; installieren zu k&ouml;nnen.  In diesem
      Kapitel finden Sie die notwendigen Informationen, um diese
      Disketten erstellen zu k&ouml;nnen.  Die notwendigen Daten
      finden Sie auf der &os; CDROM oder im Internet.  Wenn Ihr System
      in der Lage ist, von CDROM zu booten (was heute die Regel ist)
      und Sie &os; von CD installieren, ist dieser Schritt nicht
      notwendig.</para>

    <para>F&uuml;r eine Standard-Installation von CDROM oder &uuml;ber
      ein Netzwerk m&uuml;ssen Sie nur zwei Dateien aus dem
      Verzeichnis <filename>floppies/</filename> auf Disketten
      &uuml;bertragen, dabei handelt es sich um die Disketten-Images
      <filename>kern.flp</filename> und
      <filename>mfsroot.flp</filename>, die f&uuml;r 1.44 MByte
      Diskettenlaufwerke gedacht sind.</para>

    <para>Wenn Sie diese Images &uuml;ber das Internet beziehen
      wollen, brauchen Sie nur Dateien
      <replaceable>release</replaceable><filename>/floppies/kern.flp</filename>
      und
      <replaceable>release</replaceable><filename>/floppies/mfsroot.flp</filename>
      von <ulink url="&release.url;"></ulink> oder einem der vielen
      Mirrors beziehen.  Eine Liste aller Mirrors finden Sie im
      Kapitel <ulink
      url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/mirrors-ftp.html">FTP
      Sites</ulink> des Handbuchs oder auf dem Server <ulink
      url="http://www.freebsdmirrors.org/"></ulink>.</para>

    <para>Sie ben&ouml;tigen zwei leere, formatierte Disketten und
      &uuml;bertragen Sie das Image <filename>kern.flp</filename> auf
      die erste und das Image <filename>mfsroot.flp</filename> auf die
      zweite Diskette.  Diese Images sind <emphasis>keine</emphasis>
      DOS Dateien.  Sie k&ouml;nnen Sie nicht ganz normal auf eine
      DOS- oder UFS-Diskette kopieren, sondern m&uuml;ssen ein
      spezielles Programm verwenden.  Wenn Sie DOS benutzen, brauchen
      Sie das Programm <filename>fdimage.exe</filename>, das Sie im
      Verzeichnis <filename>tools</filename> der CDROM bzw. auf dem
      &os; FTP Server finden.  Wenn Sie UNIX benutzen, brauchen Sie
      &man.dd.1;.</para>

    <para>Ein Beispiel: Wenn Sie das Image der Kernel-Diskette
      &uuml;bertragen wollen und DOS benutzen, m&uuml;ssen Sie den
      folgenden Befehl verwenden:</para>

    <screen><prompt>C></prompt> <userinput>fdimage kern.flp a:</userinput></screen>

    <para>Dazu m&uuml;ssen Sie <filename>fdimage.exe</filename> und
      <filename>kern.flp</filename> in ein Verzeichnis kopiert haben.
      Logischerweise m&uuml;ssen Sie die Prozedur f&uuml;r
      <filename>mfsroot.flp</filename> wiederholen.</para>

    <para>Wenn Sie die Bootdisketten auf einem UNIX System erzeugen
    wollen, sollte:</para>

    <screen>&prompt.root; <userinput>dd if=floppies/kern.flp of=/dev/rfd0</userinput></screen>

    <para>oder</para>

    <screen>&prompt.root; <userinput>dd if=floppies/kern.flp of=/dev/floppy</userinput></screen>

    <para>funktionieren; dies h&auml;ngt allerdings vom jeweiligen
      System und der UNIX-Variante ab (die Namen f&uuml;r die
      Diskettenlaufwerke sind nicht standardisiert).</para>

    <para arch="alpha">Wenn Sie &os; auf einer Alpha installieren, welche
      die Disketten-Images &uuml;ber das Netzwerk booten kann; oder
      auf einem x86 System installieren, das entweder &uuml;ber ein
      2.88 MByte Diskettenlaufwerk oder &uuml;ber eine LS-120
      Superfloppy verf&uuml;gt, k&ouml;nnen Sie auch
      <filename>boot.flp</filename> verwenden.  Dieses Image
      enth&auml;lt den Inhalt von <filename>kern.flp</filename> und
      <filename>mfsroot.flp</filename>, deswegen ist
      es auch doppelt so gro&szlig;.  Wenn Sie eine bootf&auml;hige
      CD im <quote>El Torito</quote> Format erstellen wollen,
      mu&szlig; diese Datei als Boot-Image verwendet werden.  Weitere
      Informationen zu diesem Thema finden Sie in der Onlinehilfe zu
      &man.mkisofs.8;.</para>
  </sect2>

  <sect2 id="start-installation">
    <title>&os;-Installation von CD oder via Internet</title>

    <para arch="i386">Die einfachste Variante ist die Installation von
      CD.  Wenn Sie die &os;-CD und ein unterst&uuml;tztes CDROM
      Laufwerk besitzen, gibt es zwei M&ouml;glichkeiten, um die
      Installation zu beginnen:  
      <itemizedlist>
        <listitem>
          <para>Wenn Ihr System direkt von der CD booten kann (eine
            Option, die Sie normalerweise explizit auf Ihrem
            SCSI-Controller oder im PC-BIOS aktivieren m&uuml;ssen)
            und Sie diese Option aktiviert haben, dann reicht es aus,
            die CD in das CDROM Laufwerk einzulegen und das System neu
            zu starten.</para>
        </listitem>

        <listitem>
          <para>Alternativ k&ouml;nnen Sie einen Satz &os;
            Bootdisketten verwenden, die notwendigen Zutaten finden
            Sie im bei jeder &os; Distribution im Verzeichnis
            <filename>floppies/</filename>.  Wenn Sie eine DOS-Shell
            benutzen, k&ouml;nnen Sie das Script
            <filename>makeflp.bat</filename> verwenden.  Weitere
            Informationen zu diesem Thema finden Sie im Kapitel <xref
            linkend="floppies">.  Danach m&uuml;ssen Sie nur noch von
            der ersten Diskette booten, um die &os;-Installation zu
            starten.</para>
        </listitem>
      </itemizedlist>
    </para>

    <para arch="i386">Wenn Ihr Rechner kein CDROM Laufwerk hat (oder
      nicht von nicht von CD booten kann), k&ouml;nnen Sie &os;
      auch direkt &uuml;ber das Internet installieren, wenn Sie PPP,
      SLIP oder eine feste Verbindung haben.  In diesem Fall
      m&uuml;ssen Sie ebenfalls die beiden &os; Bootdisketten aus den
      Dateien <filename>floppies/kern.flp</filename> and
      <filename>floppies/mfsroot.flp</filename> erzeugen, wie in
      <xref linkend="floppies"> beschrieben.  Booten Sie Ihren
      Rechner von der Diskette mit <filename>kern.flp</filename>; und
      legen Sie die Diskette mit <filename>mfsroot.flp</filename> ein,
      sobald Sie dazu aufgefordert werden.  Weitere Informationen zu
      dieser Art der Installation finden Sie in <xref
      linkend="ftpnfs">.</para>

    <para arch="alpha">Die einfachste Variante ist die Installation
      von CD.  Wenn Sie die &os; Installations-CD und ein
      unterst&uuml;tztes CDROM haben, k&ouml;nnen Sie &os; einfach
      von der CD starten.  Legen Sie CD in das Laufwerk ein und geben Sie
      den folgenden Befehl ein, um die Installation zu beginnen (den
      Namen des CDROM Laufwerks m&uuml;ssen Sie eventuell
      anpassen):</para>

    <screen arch="alpha">&gt;&gt;&gt;<userinput>boot dka0</userinput></screen>

    <para arch="alpha">Sie k&ouml;nnen das Installationsprogramm auch
      von Disketten starten.  Dazu m&uuml;ssen Sie die &os;
      Bootdisketten aus den Dateien
      <filename>floppies/kern.flp</filename> und
      <filename>floppies/mfsroot.flp</filename> erzeugen, wie in
      <xref linkend="floppies"> beschrieben.  Legen Sie die
      Diskette mit dem Inhalt von <filename>kern.flp</filename> ein
      und geben Sie an der Eingabeaufforderung des SRM
      (<literal>&gt;&gt;&gt;</literal>) den folgenden Befehl ein, um
      mit der Installation zu beginnen:</para>

    <screen arch="alpha">&gt;&gt;&gt;<userinput>boot dva0</userinput></screen>

    <para arch="alpha">Legen Sie die Diskette mit
      <filename>mfsroot.flp</filename> ein, wenn Sie dazu aufgefordert
      werden.  Nach einiger Zeit sehen den ersten Bildschirm des
      Installationsprogramms.</para>
  </sect2>

  <sect2>
    <title>Details zu den Installationsarten</title>

    <para>Wenn Sie die erste Meldung des Installationsprogramms vor
      sich haben, k&ouml;nnen Sie sich einfach die diversen Men&uuml;s
      ansehen und Ihren eigenen Weg finden.  Wenn Sie &os; noch nie
      installiert haben, sollten Sie auf jeden Fall einen Blick in die
      Texte werfen, die im Submen&uuml; Dokumentation zur
      Verf&uuml;gung stehen.  Das gleiche gilt f&uuml;r die
      allgemeinen Informationen, die im Hauptmen&uuml; unter
      <quote>Usage</quote> zu finden sind.</para>

    <note>
      <para>Wenn Sie ein Problem haben, dr&uuml;cken Sie einfach
        <keycap>F1</keycap>, um sich die Onlinehilfe f&uuml;r die
        jeweilige Situation anzusehen.</para>
    </note>

    <para>Unabh&auml;ngig davon, ob Sie schon einmal &os; installiert
      haben, empfehlen wir Ihnen die Benutzung der
      <quote>Standard</quote> Installation.  Damit ist sichergestellt,
      da&szlig; Sie alle wichtigen Einstellungen treffen k&ouml;nnen
      und nichts vergessen.  Wenn Sie schon mehr Erfahrung mit der
      Installation von &os; haben und <emphasis>genau</emphasis>
      wissen, was Sie tun, k&ouml;nnen Sie auch die Men&uuml;punkte
      <quote>Express</quote> oder <quote>Custom</quote> w&auml;hlen.
      Wenn Sie ein bestehendes System aktualisieren wollen, sollten
      Sie den Men&uuml;punkt <quote>Upgrade</quote> nutzen.</para>

    <para>Das Installationsprogramm von &os; unterst&uuml;tzt die
      folgenden Installationsmedien: Disketten, DOS-Partitionen,
      Bandlaufwerke, CDROM, FTP, NFS und UFS Partitionen.  In den
      n&auml;chsten Kapiteln finden Sie Informationen, was Sie bei
      der Installation von diesen Medien beachten m&uuml;ssen.</para>

    <para arch="alpha">Wenn die Installation abgeschlossen ist,
      k&ouml;nnen Sie &os;/&arch; starten, indem Sie den folgenden
      Befehl an der Eingabeaufforderung des SRM eingeben:</para>

    <screen arch="alpha">&gt;&gt;&gt;<userinput>boot dkc0</userinput></screen>

    <para arch="alpha">Damit booten Sie Ihr System von der angegebenen
      Festplatte.  Mit dem Befehl <literal>show device</literal>
      k&ouml;nnen Sie herausfinden, welche Namen der SRM f&uuml;r die
      Festplatten in Ihrem System benutzt:</para>

    <screen arch="alpha">&gt;&gt;&gt;<userinput>show device</userinput>
dka0.0.0.4.0               DKA0           TOSHIBA CD-ROM XM-57  3476
dkc0.0.0.1009.0            DKC0                       RZ1BB-BS  0658
dkc100.1.0.1009.0          DKC100             SEAGATE ST34501W  0015
dva0.0.0.0.1               DVA0
ewa0.0.0.3.0               EWA0              00-00-F8-75-6D-01
pkc0.7.0.1009.0            PKC0                  SCSI Bus ID 7  5.27
pqa0.0.0.4.0               PQA0                       PCI EIDE
pqb0.0.1.4.0               PQB0                       PCI EIDE</screen>

    <para arch="alpha">Die Ausgabe stammt von einer Digital Personal
      Workstation 433au und zeigt die drei an das System
      angeschlossenen Ger&auml;te.  Das erste Ger&auml;t ist ein CDROM
      mit dem Namen <devicename>dka0</devicename>, die anderen beiden
      sind Festplatten mit den Namen <devicename>dkc0</devicename> und
      <devicename>dkc100</devicename>.</para>

    <para arch="alpha">Mit den Schaltern <option>-file</option> und
      <option>-flags</option> k&ouml;nnen Sie angeben, welcher Kernel
      gebootet und welche Optionen gesetzt werden sollen:</para>

    <screen arch="alpha"><prompt>&gt;&gt;&gt;</prompt> <userinput>boot -file kernel.old -flags s</userinput></screen>

    <para arch="alpha">Wenn &os;/&arch; automatisch starten soll,
      m&uuml;ssen Sie die folgenden Befehle eingeben:</para>

    <screen arch="alpha"><prompt>&gt;&gt;&gt;</prompt> <userinput>set boot_osflags a</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>set bootdef_dev dkc0</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>set auto_action BOOT</userinput></screen>

    <sect3>
      <title>Installation von einem CDROM im Netzwerk</title>

      <para>Wenn Sie von einem lokalen CDROM installieren wollen,
        sollten Sie nicht dieses Kapitel lesen, sondern
        <xref linkend="start-installation">.  Wenn in Ihrem System
        kein CDROM vorhanden ist und Sie eine &os; CD benutzen wollen,
        die in einem CDROM Laufwerk eines anderen Systems liegt und
        Sie dieses System &uuml;ber ein Netzwerk erreichen
        k&ouml;nnen, dann gibt es mehrere M&ouml;glichkeiten:</para>

      <itemizedlist>
        <listitem>
          <para>Wenn Sie bei der Installation von &os; die Daten
            direkt per FTP vom CDROM eines anderen &os; Systems
            beziehen wollen, ist das sehr einfach:  Benutzen Sie
            &man.vipw.8;, um die folgende Zeile in die
            Pa&szlig;wortdatei des anderen Systems
            einzuf&uuml;gen:</para>

          <screen>ftp:*:99:99::0:0:FTP:/cdrom:/sbin/nologin</screen>

          <para>Auf der Maschine, auf der das Installationsprogramm
            l&auml;uft, wechseln Sie in das Men&uuml; Options, um die
            Einstellung Release Name auf den Wert
            <literal>any</literal> zu &auml;ndern.  Danach k&ouml;nnen
            Sie <literal>Media Type</literal> auf den Wert
            <literal>FTP</literal> setzen.  In der Auswahl der
            FTP-Server w&auml;hlen Sie den Punkt <quote>URL</quote>
            und geben als Wert
            <filename>ftp://<replaceable>machine</replaceable></filename>
            an.</para>

          <warning>
            <para>Durch diese &Auml;nderung kann jedes System im
              lokalen Netzwerk oder sogar im Internet eine
              <quote>anonymous FTP</quote> Verbindung zu dem System
              mit dem CDROM aufbauen, was nicht unbedingt
              erw&uuml;nscht ist.</para>
          </warning>
        </listitem>

	<listitem>
          <para>Alternativ k&ouml;nnen Sie NFS benutzen, um den Inhalt
            des CDROM direkt f&uuml;r die Maschine, auf der Sie
            installieren wollen, zu exportieren.  Dazu mu&szlig; auf
            dem System mit dem CDROM die Datei
            <filename>/etc/exports</filename> um einen Eintrag
            erweitert werden.  Dieser Eintrag erlaubt zum Beispiel der
            Maschine <hostid role="hostname">ziggy.foo.com</hostid>,
            das CDROM w&auml;hrend der Installation direkt per NFS zu
            mounten:</para>

	  <screen>/cdrom          -ro             ziggy.foo.com</screen>

          <para>Das System mit dem CDROM mu&szlig; nat&uuml;rlich als
            NFS Server konfiguriert sein.  Wenn Sie nicht wissen, wie
            man das System so konfiguriert, sollten Sie vielleicht
            eine andere Variante benutzen, falls Sie nicht bereit
            sind, die Onlinehilfe zu &man.rc.conf.5; zu lesen und das
            System entsprechend zu konfigurieren.  Wenn das gelingt,
            sollten Sie in der Lage sein,
            <filename><replaceable>cdrom-system</replaceable>:/cdrom</filename>
            als Pfad f&uuml;r die NFS Installation anzugeben, also
            z.B.  <filename>wiggy:/cdrom</filename>.</para>
        </listitem>
      </itemizedlist>
    </sect3>

    <sect3>
      <title>Installation von Disketten</title>

      <para>Wenn Sie wirklich von Diskette installieren wollen, weil
        Ihre Hardware nicht unterst&uuml;tzt wird oder Sie es
        vorziehen, Dinge auf die harte Tour zu erledigen, m&uuml;ssen
        Sie zun&auml;chst einmal die Disketten f&uuml;r die
        Installation vorbereiten.</para>

      <para>Der erste Schritt ist die Erstellung der Bootdisketten,
        wie in <xref linkend="floppies"> beschrieben.</para>

      <para>Der zweite Schritt ist, einen Blick in <xref
        linkend="layout"> zu werfen.  Das Kapitel <quote>Distribution
        Format</quote> ist besonders wichtig, da Sie hier erfahren,
        welche Dateien Sie auf Diskette &uuml;bertragen m&uuml;ssen
        und welche Sie ignorieren k&ouml;nnen.</para>

      <para>Danach brauchen Sie so mindestens so viele 1.44 MByte
        Disketten, da&szlig; Sie alle Dateien im Verzeichnis
        <filename>bin</filename> (binary distribution) auf Disketten
        unterbringen k&ouml;nnen.  Wenn Sie Disketten mit DOS
        vorbereiten, <emphasis>m&uuml;ssen</emphasis> Sie sie mit dem
        MS-DOS Befehl <filename>FORMAT</filename> formatieren.  Wenn
        Sie Windows benutzen, benutzen Sie die Option Formatieren des
        Dateimanagers.</para>

      <important>
        <para>Neue Disketten sind in der Regel
          <quote>vorformatiert</quote>.  Das ist zwar eine sehr
          angenehme Variante, allerdings haben &uuml;ber Jahre viele
          F&auml;lle erlebt, in denen es Probleme mit diesen
          vorformatierten Disketten gab.  Im Zweifelsfalle sollten Sie
          auch diese Disketten selbst formatieren, um wirklich sicher
          zu gehen.</para>
      </important>

      <para>Wenn Sie die Disketten auf einem anderen &os; System
        erzeugen, kann eine Formatierung nicht schaden, obwohl die
        Disketten kein DOS-Dateisystem enthalten m&uuml;ssen.  Sie
        k&ouml;nnen die Programme &man.disklabel.8; and &man.newfs.8;
        benutzen, um auf den Disketten ein UFS Dateisystem anzulegen.
        Dazu sind die folgenden Befehle notwendig:</para>

      <screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</userinput></screen>

      <para>Nachdem Sie die Disketten formatiert haben, m&uuml;ssen
        Sie die Dateien auf die Disketten kopieren.  Die Dateien der
        einzelnen Distributionen sind so aufgeteilt worden, da&szlig;
        f&uuml;nf von Ihnen auf eine normale 1.44 MByte Diskette
        passen.  Nehmen Sie sich ihren Diskettenstapel, kopieren Sie
        so viele Dateien wie m&ouml;glich auf jede Diskette, bis Sie
        alle gew&uuml;nschten Distributionen auf die Disketten
        verteilt haben.  Dabei sollten jede Distribution in ein
        eigenes Verzeichnis auf der Diskette haben, also z.B.
        <filename>a:\bin\bin.inf</filename>,
        <filename>a:\bin\bin.aa</filename>,
        <filename>a:\bin\bin.ab</filename>, ...</para>

      <important>
        <para>Die Datei <filename>bin.inf</filename> mu&szlig; auf der
          ersten Diskette des <filename>bin</filename> Satzes liegen,
          da das Installationsprogramm sie auswertet, um die Anzahl
          der Dateien f&uuml;r diese Distribution zu erfahren.  Wenn
          Sie andere Distributionen auf Diskette kopieren,
          <emphasis>mu&szlig;</emphasis> die Datei
          <filename>distname.inf</filename> immer auf der ersten
          Diskette des jeweiligen Diskettensatzes liegen.  Dies wird
          auch in <filename>README.TXT</filename>
          erkl&auml;rt.</para>
      </important>

      <para>Wenn Sie bei der Installation den Dialog Medien erreicht
        haben, w&auml;hlen Sie Punkt <quote>Floppy</quote> aus und
        folgen Sie danach den Anweisungen.</para>
    </sect3>

    <sect3 arch="i386">
      <title>Installation von einer DOS-Partition</title>

      <para>Um die Installation von einer DOS-Partition vorzubereiten,
        brauchen Sie nur die Dateien der Distribution in ein
        Verzeichnis mit dem Namen <filename>FREEBSD</filename>
        kopieren.  Dieses Verzeichnis mu&szlig; in der obersten Ebene
        der prim&auml;ren DOS-Partition (<devicename>C:</devicename>)
        liegen.  Wenn Sie zum Beispiel die Dateien f&uuml;r eine
        minimale Installation auf eine DOS-Partition kopieren wollen,
        sollten Sie wie folgt vorgehen:</para>

      <screen><prompt>C:\></prompt> <userinput>MD C:\FREEBSD</userinput>
<prompt>C:\></prompt> <userinput>XCOPY /S E:\BIN C:\FREEBSD\BIN</userinput></screen>

      <para>Wobei <devicename>E:</devicename> f&uuml;r den
        Laufwerksbuchstaben f&uuml;r das CDROM mit der &os;-CD
        steht.</para>

      <para>Wenn Sie mehr als eine Distribution von einer
        DOS-Partition installieren wollen, kopieren Sie jede in ein
        eigenes Unterverzeichnis des Ordners
        <filename>C:\FREEBSD</filename> - die Distribution
        <filename>BIN</filename> ist nur die
        Minimalanforderung.</para>

      <para>Wenn Sie Daten in die DOS-Partition kopiert haben,
        k&ouml;nnen Sie ganz normal von der Bootdiskette booten und im
        Dialog Medien den Punkt <quote>DOS</quote>
        ausw&auml;hlen.</para>
    </sect3>

    <sect3>
      <title>Installation von einem QIC/SCSI Bandlaufwerk</title>

      <para>Wenn Sie vom Band installieren, erwartet das
        Installationsprogramm, da&szlig; die Dateien im tar-Format auf
        dem Band liegen.  Um ein solches Band anzulegen, m&uuml;ssen
        Sie sich zun&auml;chst alle Dateien f&uuml;r die
        Distributionen besorgen, die Sie installieren wollen und sie
        dann mit &man.tar.1; auf Band schreiben, ungef&auml;hr
        so:</para>

      <screen>&prompt.root; <userinput>cd <replaceable>/where/you/have/your/dists</replaceable></userinput>
&prompt.root; <userinput>tar cvf /dev/rsa0 <replaceable>dist1</replaceable> .. <replaceable>dist2</replaceable></userinput></screen>

      <para>Bei der eigentlichen Installation m&uuml;ssen Sie darauf
        achten, da&szlig; Sie in einem tempor&auml;ren Verzeichnis
        (das Sie selbst bestimmen k&ouml;nnen) genug Platz f&uuml;r den
        <emphasis>gesamten</emphasis> Inhalt des Bandes lassen.  Da
        man nicht beliebig auf den Inhalt eines Bandes zugreifen kann,
        braucht diese Art der Installation eine Menge tempor&auml;ren
        Speicherplatz.  Sie sollten davon ausgehen, da&szlig; Sie die
        gleiche Menge tempor&auml;ren Speicherplatz ben&ouml;tigen,
        wie Sie vorher auf das Band geschrieben haben.</para>

      <note>
        <para>Bei dieser Art der Installation m&uuml;ssen sich das
          Band im Laufwerk befinden, <emphasis>bevor</emphasis> Sie
          von den Disketten booten.  Andernfalls kann es sein,
          da&szlig; die Installation das Laufwerk nicht
          <quote>erkennt</quote>.</para>
      </note>

      <para>Der letzte Schritt ist die Erzeugung der Bootdisketten,
        siehe <xref linkend="floppies">.</para>
    </sect3>

    <sect3 id="ftpnfs">
      <title>Netzwerk-Installation mit FTP oder NFS</title>

      <para>Wenn Sie die Bootdisketten erzeugt haben, wie in <xref
        linkend="floppies"> beschrieben, k&ouml;nnen Sie die restliche
        Installation &uuml;ber eine Netzwerk-Verbindung
        durchf&uuml;hren, wobei drei Arten von Netzwerkverbindungen
        unterst&uuml;tzt werden: seriell, parallel, oder
        Ethernet.</para>

      <sect4>
        <title>Serielle Schnittstelle</title>

        <para>Die Unterst&uuml;tzung f&uuml;r SLIP ist sehr
          rudiment&auml;r und auf feste Verbindungen, wie ein
          Nullmodemkabel zwischen zwei Rechnern, beschr&auml;nkt.  Der
          Grund f&uuml;r die Einschr&auml;nkung ist, da&szlig; Sie bei
          SLIP keine W&auml;hlverbindung aufbauen k&ouml;nnen.  Wenn
          Sie sich einw&auml;hlen m&uuml;ssen oder sonst in
          irgendeiner Form die Verbindung aufbauen m&uuml;ssen,
          sollten Sie PPP verwenden.</para>

        <para>Wenn Sie PPP verwenden, m&uuml;ssen Sie die IP-Adresse
          und die DNS-Informationen f&uuml;r Ihres Internet-Providers
          kennen, da Sie diese im ersten Teil des Installationsvorgangs
          ben&ouml;tigen.  Es kann auch sein, da&szlig; Sie Ihre
          eigene IP-Adresse kennen m&uuml;ssen, allerdings
          unterst&uuml;tzt PPP dynamisch zugewiesene IP-Adressen und
          sollte daher in der Lage sein, diese Information selbst
          herauszufinden, sofern Ihr Internet-Provider dies
          unterst&uuml;tzt.</para>

        <para>Weiterhin m&uuml;ssen Sie die notwendigen <quote>AT
        Befehle</quote> f&uuml;r die Anwahl kennen, da sich die
	Unterst&uuml;tzung f&uuml;r die Anwahl auf eine einfache
	Terminalemulation beschr&auml;nkt.</para>
      </sect4>

      <sect4>
        <title>Parallele Schnittstelle</title>

        <para>Falls Sie &uuml;ber eine feste Verbindung zu einem
          anderen &os; oder Linux System verf&uuml;gen, sollten Sie
          eine Installation &uuml;ber ein <quote>Laplink</quote> Kabel
          an den parallelen Schnittstellen in Betracht ziehen.  Die
          &Uuml;bertragungsgeschwindigkeit der parallelen
          Schnittstelle liegt deutlich &uuml;ber dem Maximum einer
          seriellen Schnittstelle (bis zu 50 KByte/sec), was die
          Installation deutlich beschleunigt.  Im Normalfall ist es
          auch nicht notwendig, <quote>echte</quote> IP Adressen zu
          benutzen, wenn Sie eine Punkt-zu-Punkt Verbindung &uuml;ber
          ein paralleles Kabel verwenden, verwenden Sie einfach die in
          RFC1918 definierten Adre&szlig;bereiche f&uuml;r die beiden
          Seiten der Verbindung (z.B. <hostid
          role="ipaddr">10.0.0.1</hostid>, <hostid
          role="ipaddr">10.0.0.2</hostid>, etc).</para>

        <important>
          <para>Wenn Sie statt einem &os; System einen Linux-Rechner
            am anderen Ende der Leitung haben, m&uuml;ssen Sie im
            Dialog TCP/IP setup im Feld <quote>extra options for
            ifconfig</quote> den Wert <option>link0</option> angeben,
            da Linux eine leicht abweichende Variante des
            PLIP-Protokolls benutzt.</para>
        </important>
      </sect4>

      <sect4>
        <title>Ethernet</title>

        <para>&os; unterst&uuml;tzt viele h&auml;ufig verwendete
          Netzwerkkarten, eine &Uuml;bersicht ist Teil der &os;
          Hardware Notes.  Diese finden Sie in der Datei
          <filename>HARDWARE.TXT</filename> im Men&uuml; Dokumentation
          des Installationsprogramms und auf der CD.  Wenn Sie eine
          der unterst&uuml;tzten PCMCIA-Netzwerkkarten benutzen,
          sollten Sie diese einstecken, <emphasis>bevor</emphasis> Sie
          den Laptop einschalten.  Der Wechsel der Karten im Betrieb
          wird w&auml;hrend der Installation leider zur Zeit nicht
          unterst&uuml;tzt.</para>

        <para>Sie m&uuml;ssen Sie den Namen und die IP-Adresse Ihres
          Systems sowie die <option>Netzmaske</option> f&uuml;r Ihr
          Netzwerk kennen.  Diese Angaben k&ouml;nnen Sie von Ihrem
          Systemadministrator erhalten.  Wenn Sie andere System mit
          deren Namen und nicht mit ihren IP-Adressen ansprechen
          wollen, brauchen Sie zus&auml;tzlich die Adresse eines
          Nameservers und unter Umst&auml;nden auch die Adresse des
          Gateways, das Sie ansprechen m&uuml;ssen, um den Nameserver
          abzufragen (wenn Sie PPP verwenden, ist das die IP-Adresse
          Ihres Internet-Providers).  Wenn Sie einen HTTP-Proxy
          f&uuml;r FTP (Details dazu finden Sie weiter unten)
          verwenden wollen, brauchen Sie auch die Adresse des
          Proxies.</para>

        <para>Wenn Sie die Antworten auf diese Fragen nicht kennen,
          sollten Sie auf jeden Fall mit Ihrem Systemadministrator
          reden, <emphasis>bevor</emphasis> Sie diese Installationsart
          ausprobieren.  Wenn Sie in einem aktiven Netzwerk einfach
          irgendeine IP-Adresse oder Netzmaske nutzen, ist ein
          Fehlschlag so gut wie sicher; au&szlig;erdem k&ouml;nnen Sie
          sich schonmal auf einem Anschi&szlig; durch Ihren
          Systemadministrator einstellen.</para>

        <para>Wenn die Netzwerkverbindung erst einmal steht,
          k&ouml;nnen Sie die Installation &uuml;ber NFS oder FTP
          fortsetzen.</para>
      </sect4>

      <sect4>
        <title>Tips zur Installation &uuml;ber NFS</title>

        <para>Die Installation &uuml;ber NFS ist einfach:  Kopieren
          Sie die Daten aus der &os; Distribution auf irgendeinen
          Server und geben Sie diesen als als Installationsmedium
          an.</para>

        <para>Wenn dieser Server nur Verbindungen von einem
          <quote>privileged port</quote> erlaubt (die
          Standardeinstellung f&uuml;r Sun und Linux Workstations),
          m&uuml;ssen Sie im Men&uuml; Option diese Einstellung
          aktivieren, bevor Sie mit der Installation
          fortfahren.</para>

        <para>Wenn Sie eine schlechte Netzwerkanbindung und daher
          unter niedrigen &Uuml;bertragungsraten leiden, sollten Sie
          die Einstellung <quote>NFS Slow</quote> aktivieren.</para>

        <para>Eine weitere Voraussetzung f&uuml;r die Installation
          &uuml;ber NFS ist, da&szlig; der Server <quote>subdir
          mounts</quote> unterst&uuml;tzen mu&szlig;.  Wenn die &os;
          Distribution zum Beispiel im Verzeichnis
          <filename>wiggy:/usr/archive/stuff/FreeBSD</filename>, dann
          mu&szlig;  <hostid role="hostname">wiggy</hostid> den
          direkten Zugriff auf
          <filename>/usr/archive/stuff/FreeBSD</filename> erlauben,
          nicht nur <filename>/usr</filename> oder
          <filename>/usr/archive/stuff</filename>.</para>

        <para>Bei &os; erlauben Sie diese Art des Zugriffs durch die
          Angabe der Option <option>-alldirs</option> in der Datei
          <filename>/etc/exports</filename>.  Bei anderen NFS Servern
          gibt es &auml;hnliche Konventionen.  Wenn Sie 
          die Meldung <literal>Permission Denied</literal>
          erhalten, liegt es meistens daran, da&szlig; diese
	  Einstellung nicht richtig ist.</para>
      </sect4>

      <sect4>
        <title>Tips zur Installation &uuml;ber FTP</title>

        <para>Wenn Sie &uuml;ber FTP installieren, k&ouml;nnen Sie
          jeden Server benutzen, auf dem eine aktuelle Version von
          &os; verf&uuml;gbar.  Eine Liste passender Server f&uuml;r
          fast jeden Ort der Welt wird Ihnen w&auml;hrend der
          Installation angezeigt.</para>

        <para>Wenn Sie von einem Server installieren wollen, der nicht
          in dieser Liste steht oder wenn Sie Problem mit dem DNS
          haben, k&ouml;nnen Sie auch eine URL angeben, wenn Sie den
          Punkt <quote>URL</quote> aus der Liste ausw&auml;hlen.  Da
          eine URL sowohl einen Hostname als auch eine Adresse
          enthalten kann, k&ouml;nnen Sie eine URL dieser Art
          verwenden, wenn Sie keinen Zugriff auf einen Nameserver
          haben:</para>

        <screen>ftp://216.66.64.162/pub/FreeBSD/releases/&arch;/4.2-RELEASE</screen>

        <para>Sie k&ouml;nnen eine dieser drei Varianten der
          FTP-Installation nutzen:</para>

        <itemizedlist>
          <listitem>
            <para>FTP:  Diese Variante nutzt bei der
              Daten&uuml;bertragung den <quote>aktiven</quote> Modus,
              bei dem der Server eine Verbindung zum Client aufbaut.
              Diese Variante funktioniert meistens nicht, wenn ein
              Firewall im Spiel ist; allerdings unterst&uuml;tzen
              &auml;tere Server meistens nur diese Methode.  Wenn Ihre
              Verbindungen im passiven Modus steckenbleiben, sollten
              Sie diese Variante versuchen.</para>
          </listitem>

          <listitem>
            <para>FTP Passive:  Diese Variante nutzt den FTP-Modus
              "Passive", damit der Server keine Verbindungen zum
              Client aufbaut.  Sie sollten diese Variante verwenden,
              wenn Ihr Netzwerk durch eine Firewall abgesichert ist,
              da die meisten Firewalls die vom Server ausgehenden
              Verbindungen nicht erlauben.</para>
          </listitem>

          <listitem>
            <para>FTP via an HTTP proxy: Mit dieser Option weisen Sie
              &os; an, eine HTTP-Verbindung zu einem Proxy aufzubauen,
              wenn es Daten per FTP &uuml;bertragen will.  Der Proxy
              &uuml;bersetzt die Anforderungen und schickt Sie zum
              eigentlichen FTP Server.  Diese Methode sollten Sie
              verwenden, wenn ein Firewall FTP vollst&auml;ndig
              verbietet, daf&uuml;r aber einen HTTP Proxy zur
              Verf&uuml;gung stellt.  Bei dieser Variante m&uuml;ssen
              Sie nicht nur den FTP-Server, sondern auch den Namen des
              Proxy-Servers angeben.</para>

            <para>Falls Sie einen echten FTP Proxy benutzen, der nicht
              auf HTTP aufsetzt, sollten Sie die folgende URL wie
              folgt angeben:</para>

            <screen><userinput>ftp://foo.bar.com:<replaceable>port</replaceable>/pub/FreeBSD</userinput></screen>

            <para>Dabei m&uuml;ssen Sie f&uuml;r
              <replaceable>port</replaceable> die Portnummer des
              FTP-Proxy-Servers eingeben.</para>
          </listitem>
        </itemizedlist>
      </sect4>
    </sect3>

    <sect3>
      <title>Hinweise zur seriellen Konsole</title>

      <para>Wenn Sie bei der Installation von &os; nur die serielle
        Schnittstelle benutzen wollen (weil Sie keine Graphikkarte
        haben oder benutzen wollen), m&uuml;ssen Sie wie folgt
        vorgehen:</para>

      <procedure>
        <step>
          <para>Schlie&szlig;en Sie ein ANSI (vt100) kompatibles
            Terminal oder Terminalprogramm an die
            <devicename>COM1</devicename> Schnittstelle des Systems
            an, auf dem Sie &os; installieren wollen.</para>
        </step>

        <step>
          <para>Ziehen Sie das Tastaturkabel ab (ja, das haben Sie
            richtig gelesen) und versuchen Sie, von der Bootdiskette
            oder der Installations-CD zu booten, w&auml;hrend die
            Tastatur nicht angeschlossen ist.</para>
        </step>

        <step>
          <para>Wenn Sie keine Meldungen auf Ihrer seriellen Konsole
            sehen, m&uuml;ssen Sie die Tastatur wieder einstecken und
            auf ein Tonsignal warten.  Wenn Sie von CD booten, machen
            Sie bei <xref linkend="hitspace"> weiter, wenn Sie das
            Tonsignal h&ouml;ren..</para>
        </step>

        <step>
          <para>Wenn Sie von den Disketten booten, ist das erste
            Tonsignal die Aufforderung, die Diskette mit
            <filename>kern.flp</filename> zu entfernen, die Diskette
            mit <filename>mfsroot.flp</filename> einzulegen, auf
            <keycap>Enter</keycap> zu dr&uuml;cken und auf das
            n&auml;chste Tonsignal zu warten.</para>
        </step>

        <step id="hitspace">
          <para>Dr&uuml;cken Sie die Leertaste und geben Sie</para>

	  <screen><userinput>boot -h</userinput></screen>

	  <para>ein, danach sollte die serielle Konsole zum Leben
	  erwachen.  Wenn sich immer noch nichts tut, sollten Sie das
	  Kabel und die Einstellungen Ihres Terminals bzw.
	  Terminalprogramms &uuml;berpr&uuml;fen.  Diese sollten auf
	  9600 Baud, 8 Bit, keine Parit&auml;t eingestellt sein.</para>
	</step>
      </procedure>
    </sect3>
  </sect2>

  <sect2>
    <title>Fragen und Antworten f&uuml;r Benutzer von &arch.print;</title>

    <qandaset arch="i386">
      <qandaentry>
        <question>
          <para>Hilfe!  Ich habe keinen Platz frei!  Mu&szlig; ich
            alles anderen l&ouml;schen?</para>
        </question>

        <answer>
          <para>Wenn auf Ihrem Rechner schon DOS installiert ist und
            nur wenig oder gar kein Platz frei ist, mu&szlig; das
            nicht unbedingt den Untergang bedeuten.  Eventuell kann
            Ihnen das Programm <application>FIPS</application>, das
            Sie im Verzeichnis <filename>tools/</filename> auf der
            &os; CD bzw. auf den &os; FTP Server finden,
            weiterhelfen.</para>

          <para>Mit <application>FIPS</application> k&ouml;nnen Sie
            eine vorhandene DOS Partition in zwei Teile aufteilen.
            Die urspr&uuml;nglich vorhandene Partition bleibt dabei
            erhalten, w&auml;hrend Sie im zweiten Teil &os;
            installieren k&ouml;nnen.  Sie m&uuml;ssen Ihre DOS
            Partition mit dem ab DOS 6.xx vorhandenen Programm
            <filename>DEFRAG</filename> oder den <application>Norton
            Disk Tools</application> defragmentieren, bevor Sie FIPS
            starten.  Es wird alle weiteren Informationen abfragen.
            Danach k&ouml;nnen Sie Ihren Rechner neu starten und &os;
            auf der neuen Partition installieren.  Beachten Sie bitte,
            da&szlig; die zweite Partition aus der ersten
            <quote>clont</quote>, Sie werden also zwei prim&auml;re
            DOS Partitionen vorfinden, obwohl Sie vorher nur eine
            hatten.  Keine Panik, Sie k&ouml;nnen die zus&auml;tzliche
            prim&auml;re DOS Partition einfach l&ouml;schen (aber
            achten Sie darauf, da&szlig; Sie die richtige Partition
            l&ouml;schen, indem Sie auf die Gr&ouml;&szlig;e der
            Partition achten).</para>

          <para><application>FIPS</application> kann die FAT32 und
            VFAT Partitionen, die von neueren Version von Windows 95
            benutzt werden, nicht bearbeiten.  F&uuml;r diese
            Partitionen brauchen Sie ein kommerzielles Programm wie
            <application>Partition Magic</application>.</para>
<!--
Was soll mir denn das sagen???? ue
Sorry, but this is just the breaks if you've got a Windows partition
hogging your whole disk and you don't want to reinstall from
scratch.</para>
-->
        </answer>
      </qandaentry>

      <qandaentry>
        <question>
          <para>Unterst&uuml;tzt &os; komprimierte DOS
            Dateisysteme?</para>
        </question>

        <answer>
          <para>Nein.  Wenn Sie ein Programm wie
            <application>Stacker</application>(tm) oder
            <application>DoubleSpace</application>(tm) benutzen, kann
            &os; nur auf den nicht komprimierten Teil des Dateisystems
            zugreifen.  Der Rest steckt in einer gro&szlig;en Datei.
            <emphasis>L&ouml;schen Sie diese Datei nicht</emphasis>,
            da Sie damit alle komprimierten Dateien
            l&ouml;schen.</para>

          <para>Die bessere Alternative ist, eine separates, nicht
            komprimiertes logisches Laufwerk anzulegen und dieses
            f&uuml;r den Austausch von Daten zwischen DOS und &os; zu
            benutzen (wenn es Ihnen darum ging).</para>
        </answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Kann ich auf logische DOS-Laufwerke zugreifen?</para>
	</question>

	<answer>
          <para>Ja.  Die logischen DOS-Laufwerke werden in &os; hinter
            allen anderen <quote>slices</quote> eingeblendet.
            Beispielweise k&ouml;nnte Ihr Laufwerk
            <devicename>D:</devicename> zu
            <filename>/dev/da0s5</filename> werden, das Laufwerk
            <devicename>E:</devicename> zu
            <filename>/dev/da0s6</filename>, und so weiter.  Dieses
            Beispiel gilt nat&uuml;rlich nur, wenn Ihr logisches
            Laufwerk auf der ersten SCSI-Festplatte liegt.  Wenn Sie
            IDE benutzen, ersetzen Sie <literal>da</literal> durch
            <literal>ad</literal>.  Abgesehen vom Namen k&ouml;nnen
            Sie auf logische Laufwerke genauso wie auf jedes andere
            DOS-Laufwerk zugreifen:</para>

	  <screen>&prompt.root; <userinput>mount -t msdos /dev/da0s5 /dos_d</userinput></screen>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Laufen DOS-Programme unter &os;?</para>
	</question>

	<answer>
          <para>In vielen F&auml;llen k&ouml;nnen Sie das von BSDI
            stammende Programm &man.doscmd.1; benutzen.  Allerdings
            ist dieses Programm noch nicht vollst&auml;ndig und es
            gibt noch einige Probleme damit.  Wenn Sie interessiert
            sind, an diesem Programm mitzuarbeiten, schreiben Sie eine
            Mail an die Mailingliste &a.emulation;.</para>

          <para>Sie k&ouml;nnen auch das Package <filename
            role="package">emulators/pcemu</filename> aus der &os;
            Ports Collection benutzen, das einen 8088 und die BIOS
            Funktionen f&uuml;r textbasierte DOS Programme emuliert.
            Allerdings braucht es zum Betrieb das X Window System
            (XFree86).</para>
        </answer>
      </qandaentry>
    </qandaset>

    <qandaset arch="alpha">
      <qandaentry>
        <question>
          <para>Kann ich von der ARC oder Alpha BIOS Console
            booten?</para>
        </question>

        <answer>
          <para>Nein.  Wie Compaq Tru64 und VMS kann &os; nur von der
            SRM Konsole booten.</para>
        </answer>
      </qandaentry>

      <qandaentry>
        <question>
          <para>Hilfe!  Ich habe keinen freien Platz!  Mu&szlig; ich
            alles andere l&ouml;schen?</para>
        </question>

	<answer>
	  <para>Leider ja.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
          <para>Kann ich auf die erweiterten Compaq Tru64 oder VMS
            Partitionen zugreifen?</para>
        </question>

	<answer>
	  <para>Nein, zur Zeit noch nicht.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Laufen Compaq Tru64 (OSF/1) Programme?</para>
	</question>

        <answer>
          <para>Wenn Sie den Port oder das Package <filename
            role="package">emulators/osf1_base</filename>
            installieren, k&ouml;nnen Sie Tru64 Programme problemlos
            unter &os;  verwenden.</para>
        </answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Wie sieht es mit der Unterst&uuml;tzung f&uuml;r Linux Programme aus?</para>
	</question>

        <answer>
          <para>AlphaLinux Programm k&ouml;nnen in &os; benutzt
            werden, wenn sie den Port/das Package <filename
            role="package">emulators/linux_base</filename> installiert
            werden.</para>
        </answer>
      </qandaentry>

      <qandaentry>
        <question>
          <para>Wie sieht es mit der Unterst&uuml;tzung f&uuml;r NT
            Alpha Programme?</para>
        </question>

        <answer>
          <para>&os; kann keine NT Programme ausf&uuml;hren,
            allerdings kann es auf NT Partitionen zugreifen.</para>
        </answer>
      </qandaentry>
    </qandaset>
  </sect2>
</sect1>
