/*	$NetBSD: pdqreg.h,v 1.14 2001/06/13 10:46:03 wiz Exp $	*/

/*-
 * Copyright (c) 1995, 1996 Matt Thomas <matt@3am-software.com>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * Id: pdqreg.h,v 1.11 1997/03/21 21:16:04 thomas Exp
 * $FreeBSD$
 *
 */

/*
 * DEC PDQ FDDI Controller; PDQ port driver definitions
 *
 */

#ifndef _PDQREG_H
#define	_PDQREG_H

#if !defined(KERNEL) && !defined(_KERNEL)
#include <stddef.h>
#elif !defined(offsetof)
#define	offsetof(t, m)	((char *) (&((t *)0L)->m) - (char *) 0L)
#endif
#if defined(PDQTEST) && !defined(PDQ_NDEBUG)
#include <assert.h>
#define	PDQ_ASSERT	assert
#else
#define	PDQ_ASSERT(x)	do { } while(0)
#endif

#define	PDQ_RING_SIZE(array)	((sizeof(array) / sizeof(array[0])))
#define	PDQ_ARRAY_SIZE(array)	((sizeof(array) / sizeof(array[0])))
#define	PDQ_RING_MASK(array)	(PDQ_RING_SIZE(array) - 1)
#define	PDQ_BITMASK(n)		(1L << (pdq_uint32_t) (n))

#define	PDQ_FDDI_MAX		4495
#define	PDQ_FDDI_LLC_MIN	20
#define	PDQ_FDDI_SMT_MIN	37

#define	PDQ_FDDI_SMT		0x40
#define	PDQ_FDDI_LLC_ASYNC	0x50
#define	PDQ_FDDI_LLC_SYNC	0xD0
#define	PDQ_FDDI_IMP_ASYNC	0x60
#define	PDQ_FDDI_IMP_SYNC	0xE0

#define	PDQ_FDDIFC_C		0x80
#define	PDQ_FDDIFC_L		0x40
#define	PDQ_FDDIFC_F		0x30
#define	PDQ_FDDIFC_Z		0x0F

#define	PDQ_FDDI_PH0		0x20
#define	PDQ_FDDI_PH1		0x38
#define	PDQ_FDDI_PH2		0x00

typedef pdq_uint32_t pdq_physaddr_t;

struct _pdq_lanaddr_t {
    pdq_uint8_t lanaddr_bytes[8];
};

typedef struct {
    pdq_uint8_t fwrev_bytes[4];
} pdq_fwrev_t;

enum _pdq_state_t {
    PDQS_RESET=0,
    PDQS_UPGRADE=1,
    PDQS_DMA_UNAVAILABLE=2,
    PDQS_DMA_AVAILABLE=3,
    PDQS_LINK_AVAILABLE=4,
    PDQS_LINK_UNAVAILABLE=5,
    PDQS_HALTED=6,
    PDQS_RING_MEMBER=7
};

struct _pdq_csrs_t {
    pdq_bus_memoffset_t csr_port_reset;			/* 0x00 [RW] */
    pdq_bus_memoffset_t csr_host_data;			/* 0x04 [R]  */
    pdq_bus_memoffset_t csr_port_control;		/* 0x08 [RW] */
    pdq_bus_memoffset_t csr_port_data_a;		/* 0x0C [RW] */
    pdq_bus_memoffset_t csr_port_data_b;		/* 0x10 [RW] */
    pdq_bus_memoffset_t csr_port_status;		/* 0x14 [R]  */
    pdq_bus_memoffset_t csr_host_int_type_0;		/* 0x18 [RW] */
    pdq_bus_memoffset_t csr_host_int_enable;		/* 0x1C [RW] */
    pdq_bus_memoffset_t csr_type_2_producer;		/* 0x20 [RW] */
    pdq_bus_memoffset_t csr_cmd_response_producer;	/* 0x28 [RW] */
    pdq_bus_memoffset_t csr_cmd_request_producer;	/* 0x2C [RW] */
    pdq_bus_memoffset_t csr_host_smt_producer;		/* 0x30 [RW] */
    pdq_bus_memoffset_t csr_unsolicited_producer;	/* 0x34 [RW] */
    pdq_bus_t csr_bus;
    pdq_bus_memaddr_t csr_base;
};

struct _pdq_pci_csrs_t {
    pdq_bus_memoffset_t csr_pfi_mode_control;		/* 0x40 [RW] */
    pdq_bus_memoffset_t csr_pfi_status;			/* 0x44 [RW] */
    pdq_bus_memoffset_t csr_fifo_write;			/* 0x48 [RW] */
    pdq_bus_memoffset_t csr_fifo_read;			/* 0x4C [RW] */
    pdq_bus_t csr_bus;
    pdq_bus_memaddr_t csr_base;
};

#define PDQ_PFI_MODE_DMA_ENABLE		0x01	/* DMA Enable */
#define PDQ_PFI_MODE_PFI_PCI_INTR	0x02	/* PFI-to-PCI Int Enable */
#define PDQ_PFI_MODE_PDQ_PCI_INTR	0x04	/* PDQ-to-PCI Int Enable */

#define PDQ_PFI_STATUS_PDQ_INTR		0x10	/* PDQ Int received */
#define PDQ_PFI_STATUS_DMA_ABORT	0x08	/* PDQ DMA Abort asserted */

#define	PDQ_EISA_BURST_HOLDOFF			0x0040
#define	PDQ_EISA_SLOT_ID			0x0C80
#define	PDQ_EISA_SLOT_CTRL			0x0C84
#define	PDQ_EISA_MEM_ADD_CMP_0			0x0C85
#define	PDQ_EISA_MEM_ADD_CMP_1			0x0C86
#define	PDQ_EISA_MEM_ADD_CMP_2			0x0C87
#define	PDQ_EISA_MEM_ADD_HI_CMP_0		0x0C88
#define	PDQ_EISA_MEM_ADD_HI_CMP_1		0x0C89
#define	PDQ_EISA_MEM_ADD_HI_CMP_2		0x0C8A
#define	PDQ_EISA_MEM_ADD_MASK_0			0x0C8B
#define	PDQ_EISA_MEM_ADD_MASK_1			0x0C8C
#define	PDQ_EISA_MEM_ADD_MASK_2			0x0C8D
#define	PDQ_EISA_MEM_ADD_LO_CMP_0		0x0C8E
#define	PDQ_EISA_MEM_ADD_LO_CMP_1		0x0C8F
