freebsd/freebsd-src/sbin/mount_nwfs/mount_nwfs.8
.\" $FreeBSD$
.Dd Oct 14, 1999
.Dt MOUNT_NWFS 8
.Os FreeBSD 4.0
.Sh NAME
.Nm mount_nwfs
.Nd mount NetWare volume from a NetWare file server
.Sh SYNOPSIS
.Nm mount_nwfs
.Op Fl Chv
.Ar -S Ar server
.Ar -U Ar user
.Ar "[connection options]"
.Ar -V Ar volume
.Op Fl M Ar mode
.Op Fl c Ar case
.Op Fl d Ar mode
.Op Fl f Ar mode
.Op Fl g Ar gid
.Op Fl l Ar locale
.Op Fl n Ar os2
.Op Fl u Ar uid
.Op Fl w Ar scheme
.Ar node
.Nm mount_nwfs
.Op Fl options
.Ar /server:user/volume/path
.Ar node
.Sh DESCRIPTION
The
.Nm
command allow to mount volume from a NetWare server. It may use either
existing connection or create new: if no usable connection was found
it will try to establish a new one. Connection has count of references to it,
so when last mount will be dismounted connection will be closed. It is
possible to create connection without any mounts (but use it for them) with
.Xr ncplogin 1 .
.Pp
Note two forms of command line. In the first form, server and user specified
via 
.Fl S
and
.Fl U
options respectively. In the second form server and user specified in
.Ar special
part of 
.Xr mount 8
command line arguments (the
.Fl S ,
.Fl U
and
.Fl V
options aren't used in this case). This allows use of fstab file (see EXAMPLES below).
.Pp
The options are:
.Bl -tag -width indent
.It Fl S Ar server
name of NetWare server to connect. For native IP you will need also
.Fl A
option.
.It Fl U Ar user
name of user used in login sequence.
.It Fl "[connection options]"
See
.Xr ncplogin 1
for details.
.It Fl V Ar volume
Volume name to mount. Volume name can also be specified after all options and
before
.Ar mount-point .
.It Ar node
Path to mount volume.
.It Fl c Ar case
Selects a
.Ar case 
option which affects on name representation.
.Ar Case 
can be one of the following:
.Bd -literal -offset indent
Value   Meaning
l	All existing file names converted to lower case. 
	Newly created file gets a lower case under OS2 name
	space. This is default when mounting volumes with DOS
	name space.
L	Same as 'l' but file system tries to be case
	insensitive. May not work well.
n	No case conversion is performed. 
	Warning! Warning!: use this option with DOS name
	space only as a last resort, because creating a lower
	case name in the DOS name space can lead to an
	unpredictable results. This is default when mounting
	volume with OS2 name space.
u	All existing file names converted to upper case. Newly
	created	file gets an upper case under OS2 name space.
U	Same as 'u' but file system tries to be case insensitive.
	May not	work well.
.Ed
.It Fl f Ar mode, Fl d Ar mode
specifies permissions that should be assigned to files and directories.
The values must be specified as octal numbers. Default value for the file mode
taken from mount point, default value for the dir mode adds execute permission
where the file mode gives read permission.

Note that these permissions can differ from the rights granted by NetWare
server. 
.It Fl n Ar namespace
don't use
.Ar namespace .
Currently only
.Ar OS2
can be here.
.It Fl v
prints version number.
.It Fl u Ar uid, Fl g Ar gid
User id and group id assigned to files. The default is owner and group id from
directory where volume is mounted.
.It Fl l Ar locale
Sets the locale for case conversion. By default
.Nm
tries to use an environment variable
.Ar LC_* .
.It Fl w Ar scheme
Selects a
.Ar scheme 
used to convert file names between NetWare and FreeBSD. Currently only 
.Ar koi2cp866 
and 
.Ar asis 
can be here. Please note, that scheme should be enabled at compile 
time in config.mk file.
.It Fl M Ar mode
See 
.Xr ncplogin 1 
for details. If this option is omitted, connection permissions
assumed the same as directory mode (
.Ar -d )
option.
.El
.Sh FILES
.Bl -tag -width /var/log/wtmp -compact
.It Pa ~/.nwfsrc
keeps description for each connection. See
.Xr nwfsrc 8
for details.

.Sh NOTES
Before any NCP connection can be established kernel must be configured
for IPX support, IPXrouted and KLD nwfs.ko should be loaded.
.Sh EXAMPLES
Next examples illustrates how to connect to NetWare server
.Ar nwserv
as user
.Ar GUEST
and mount volumes
.Ar SYS
and
.Ar VOL1 :
.Bd -literal -offset indent
mount_nwfs -S nwserv -U guest -V sys /nw/s1/sys
mount_nwfs /nwserv:guest/sys /nw/s1/sys
mount -t nwfs /nwserv:guest/vol1 /nw/s1/vol1
mount -t nwfs /nwserv:boris/sys/home/boris /home/boris/nw/home
.Ed
.Pp
The last example mounts only subdirectory on a volume and equivalent
to NetWare 'map root' command.
.Pp
It is possible to use fstab for nwfs mounts:
.Bd -literal -offset indent
/nwserv:guest/sys       /nw/s1/sys     nwfs  rw,noauto 0   0
/nwserv:guest/vol1      /nw/s1/vol2    nwfs  rw,noauto 0   0
.Ed

.Sh BUGS
to number a few

.Sh CREDITS
In development of NetWare client for FreeBSD, the following sources were used:
.Pp
Documentation from NetWare NDK.
.Pp
ncpfs for Linux - written by Volker Lendecke (lendecke@math.uni-goettingen.de).
He granted me permission to publish parts of his code under BSD-style license,
.Pp
"Interrupt List" from Ralf Brown,
.Pp
Many files from /sys directory.

.Sh AUTHOR
.An Boris Popov Aq bp@butya.kz ,
.Aq rbp@chat.ru
