freebsd/freebsd-src/usr.sbin/atm/atmarpd/atmarpd.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) $FreeBSD: src/usr.sbin/atm/atmarpd/atmarpd.8,v 1.3 1999/08/28 01:15:31 peter Exp $
.\"
.\"
.de EX		\"Begin example
.ne 5
.if n .sp 1
.if t .sp .5
.nf
.in +.5i
..
.de EE
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.TH ATMARPD 8 "1998-08-04" "HARP"

.SH NAME
atmarpd \- ATMARP/SCSP interface daemon
.SH SYNOPSIS
.B atmarpd
[\fB-l\fP <log file>]
[\fB-d\fP]
<netif> ...

.SH DESCRIPTION
\fIAtmarpd\fP provides an interface between the ATMARP server in the
kernel and the SCSP daemon for the Host ATM Research Platform
(HARP) networking software.
\fIAtmarpd\fP reads the ATMARP cache from the kernel periodically
and passes any updated entries to \fIscspd\fP so they will be
propagated to remote servers.
It also accepts updated entries that remote servers have sent to
\fIscspd\fP and, if they are
new or more up to date than current entries, installs them
in the kernel's ATMARP cache.
Both \fIatmarpd\fP and \fIscspd\fP must be running before any ATMARP
cache synchronization can take place.

When \fIatmarpd\fP starts, it parses its command line and puts
itself into the background.

The command-line options are:
.IP "\fB-l\fP <log file>" 15
Specifies that \fIatmarpd\fP is to write log messages to the 
file named <log file> rather than to the system log.
.IP "\fB-d\fP" 15
Specifies that \fIatmarpd\fP is to be run in debug mode.
In debug mode, \fIatmarpd\fP is not put into the background.
Log messages are written to standard output instead of to
the log file.
.IP "<netif>" 15
Specifies the network interface(s) for which the host is providing
ATMARP service and whose caches are to be synchronized using SCSP.
If multiple network interface names are specified, \fIatmarpd\fP
will provide an interface to \fIscspd\fP for the servers on all the
specified interfaces.

.SH SIGNAL PROCESSING
The following signals can be used to control \fIatmarpd\fP:

.IP \fBSIGINT\fP 10
Dump debugging information to a file.
When it receives a SIGINT signal, \fIatmarpd\fP dumps a summary of
its control blocks to a text file (see "\fBFILES\fB").

.SH FILES

.IP "/tmp/atmarpd.<pid>.<seq>.out"
Debugging information dump file name.
\fIAtmarpd\fP writes a summary of its control blocks to this file
when it receives a SIGINT signal.
<pid> is the process ID of the daemon and <seq> is a sequence
number which is incremented every time a dump is taken.

.SH "SEE ALSO"
\fIatm\fP (8);
\fIscspd\fP (8);
RFC 1577, \fIClassical IP and ARP over ATM\fP;
RFC 2225, \fIClassical IP and ARP over ATM\fP;
RFC 2334, \fIServer Cache Synchronization Protocol (SCSP)\fP;
draft-ietf-ion-scsp-atmarpd-00.txt, \fIA Distributed ATMARP Service
Using SCSP\fP.


.SH BUGS
Results are unpredictable if multiple instantiations of
\fIatmarpd\fP are run simulatneously for a given network interface.

Please report any bugs to harp-bugs@magic.net.

.SH COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.

.SH AUTHORS
John Cavanaugh, Network Computing Services, Inc.
.br
Mike Spengler, Network Computing Services, Inc.
.br
Joe Thomas, Network Computing Services, Inc.
.fi
.SH ACKNOWLEDGMENTS
This software was developed with the support of the Defense
Advanced Research Projects Agency (DARPA).
