freebsd/freebsd-src/sbin/atm/ilmid/ilmid.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) $FreeBSD: src/sbin/atm/ilmid/ilmid.8,v 1.3 2000/03/01 11:27:46 sheldonh Exp $
.\"
.\"
.de EX		\"Begin example
.ne 5
.if n .sp 1
.if t .sp .5
.nf
.in +.5i
..
.de EE
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.TH ILMID 8 "1998-09-14" "HARP"
.SH NAME
ilmid \- Simple ILMI ATM address registration daemon
.SH SYNOPSIS
.B ilmid
[-d level]
[-f]
[-r]
.sp
.fi
.SH DESCRIPTION
.B ilmid
is a HARP ATM daemon that performs the ILMI ATM address registration 
procedures with an ATM network switch.  It is normally invoked at boot time 
from the ATM startup script.
.fi
.PP
For each ATM interface with a UNI signalling manager attached, 
.B ilmid
will open an ILMI PVC (VPI = 0, VCI = 16) and register the interface's 
ATM address with the switch.  As part of the address registration procedure,
the ATM switch will notify the endsystem (local host) of the 
"network prefix" portion of the endsystem's ATM address and 
.B ilmid
will notify the switch of the endsystem's "user part" of its address
(typically the interface card MAC address).
.fi
.SH OPTIONS
.TP
.B \-d level
Specify the debug level for optional protocol tracing.
Messages are
written to /var/log/ilmid.
.TP
.B \-f
Causes
.B ilmid
to run in the foregroud.
.TP
.B \-r
Causes
.B ilmid
to issue a coldStart TRAP on all ATM interfaces it's able to open and exit.
.fi
.SH NOTES
.PP
This daemon does not fully conform to the ATM Forum ILMI specifications. 
In particular, it
does not make any queries of the network side to ensure
that the ATM Address table is empty.
It also does not implement any
of the ATM Forum MIB that is specified as part of ILMI.
.fi
.PP
.B ilmid
will increment the debug level when it receives a SIGUSR1 signal and will
decrement the debug level when it receives a SIGUSR2 signal.
.SH "SEE ALSO"
.PP
The ATM Forum, \fIATM User-Network Interface, Version 3.1 (UNI 3.1) 
Specification\fP for details on the ILMI protocols and address registration 
procedures.
.fi
.SH BUGS
Please report any bugs to harp-bugs@magic.net.
.fi
.SH COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.
.fi
.SH AUTHORS
John Cavanaugh, Network Computing Services, Inc.
.br
Mike Spengler, Network Computing Services, Inc.
.br
Joseph Thomas, Network Computing Services, Inc.
.fi
.SH ACKNOWLEDGMENTS
This software was developed with the support of the
Defense Advanced Research Projects Agency (DARPA).
