freebsd/freebsd-src/usr.sbin/sendmail/mailstats/mailstats.8
.\"	@(#)mailstats.8	8.1 (Berkeley) 9/21/96
.Dd April 25, 1996
.Dt MAILSTATS 1
.Os BSD 3
.Sh NAME
.Nm mailstats
.Nd display mail statistics
.Sh SYNOPSIS
.Nm mailstats
.Op Fl o
.Op Fl C Ar cffile
.Op Fl f Ar stfile
.Sh DESCRIPTION
The
.Nm mailstats
utility displays the current mail statistics.
.Pp
First, the time at which statistics started being kept is displayed,
in the format specified by
.Xr ctime 3 .
Then,
the statistics for each mailer are displayed on a single line,
each with the following whitespace separated fields:
.Pp
.Bl -tag -width 10n -offset indent -compact
.It Sy M
The mailer number.
.It Sy msgsfr
Number of messages from the mailer.
.It Sy bytes_from
Kbytes from the mailer.
.It Sy msgsto
Number of messages to the mailer.
.It Sy bytes_to
Kbytes to the mailer.
.It Sy Mailer
The name of the mailer.
.El
.Pp
After this display, a line totaling the values for all of the mailers
is displayed,
separated from the previous information by a line containing only equals
.Pq Dq \&=
characters.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl C
Read the specified file instead of the default
.Nm sendmail
.Dq cf
file.
.It Fl f
Read the specified statistics file instead of the statistics file
specified in the
.Nm sendmail
.Dq cf
file.
.It Fl o
Don't display the name of the mailer in the output.
.El
.Pp
The
.Nm mailstats
utility exits 0 on success, and >0 if an error occurs.
.Sh FILES
.Bl -tag -width /var/log/sendmail.stXX -compact
.It Pa /etc/sendmail.cf
The default
.Nm sendmail
.Dq cf
file.
.It Pa /var/log/sendmail.st
The default
.Nm sendmail
statistics file.
.El
.Sh SEE ALSO
.Xr mailq 1 ,
.Xr sendmail 8
