freebsd/freebsd-src/eBones/usr.sbin/kdb_destroy/kdb_destroy.8
.\" from: kdb_destroy.8,v 4.1 89/01/23 11:08:02 jtkohl Exp $
.\" $FreeBSD$
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <Copyright.MIT>.
.\"
.TH KDB_DESTROY 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kdb_destroy \- destroy Kerberos key distribution center database
.SH SYNOPSIS
kdb_destroy
.SH DESCRIPTION
.I kdb_destroy
deletes a Kerberos key distribution center database.
.PP
The user is prompted to verify that the database should be destroyed.  A
response beginning with `y' or `Y' confirms deletion.
Any other response aborts deletion.
.SH DIAGNOSTICS
.TP 20n
"Database cannot be deleted at /kerberos/principal"
The attempt to delete the database failed (probably due to a system or
access permission error).
.TP
"Database not deleted."
The user aborted the deletion.
.SH FILES
.TP 20n
/etc/kerberosIV/principal.db
DBM file containing database
.TP
/etc/kerberosIV/principal.ok
Semaphore indicating that the DBM database is not being modified.
.SH SEE ALSO
kdb_init(8)
