<sect1>
  <title>Installation von &os;</title>

  <para>Hier finden Sie Informationen, wie Sie die &arch; Version
    installieren und booten k&ouml;nnen.  Wenn Sie diese Version
    benutzen, sollten Sie sich auf jeden Fall auf der Mailingliste &a.sparc;
    eintragen.</para>

  <warning>
    <para>Die weiter unten genannten Programme und Kernel sind
      experimenteller Natur; z.B. enth&auml;lt der Kernel
      &Auml;nderungen bei der Behandlung von ATA und EEPOMS, die
      potentiell gef&auml;hrlich sind.  Wenn Sie sich nicht mit &os;
      und &arch; auskennen oder nicht bereit sind, selbst Hand
      anzulegen, um Probleme und Sch&auml;den zu beseitigen, sollten
      Sie besser die Finger von dieser Version lassen.</para>
  </warning>

  <para>[Anmerkung des &Uuml;bersetzers: Diese Warnung ist nicht im
    Sinne der &uuml;blichen <quote>Bitte nutzen Sie Ihre Mikrowelle
    nicht zum Trocknen von kleinen Kindern und Hunden</quote> Hinweise
    zu verstehen, die meinen das ernst.]</para>

  <para>F&uuml;r &os;/&arch; gibt das von &os;/i386 und &os;/alpha
    verwendete &man.sysinstall.8; nicht.  Zur Installation m&uuml;ssen
    Sie einen Kernel (von CD oder &uuml;ber ein Netzwerk) auf das
    &arch; System laden, das Root-Dateisystem liegt entweder auf der
    CD oder wird via NFS exportiert.  Die Programme auf dem
    Root-Dateisystem k&ouml;nnen dann dazu genutzt werden, die lokale
    Festplatte zu partitionieren.  Sie k&ouml;nnen danach die &os;
    Distribution auf die lokale Festplatte kopieren, um ein
    eigenst&auml;ndiges System zu bekommen.</para>

  <sect2>
    <title>Vorbereitungen</title>

    <para>Es gibt zwei Varianten bei der Installation von &os;/&arch;
      auf einem System.  Die einfachere Variante ist die Installation
      von CD, dadurch k&ouml;nnen Sie &os; installieren, ohne auf
      andere Rechner angewiesen zu sein.</para>

    <para>Wenn Sie nicht von CD installieren k&ouml;nnen oder wollen,
      k&ouml;nnen Sie alternativ auch &uuml;ber ein Netzwerk
      installieren.  Dazu ben&ouml;tigen Sie eine andere Maschine, die
      so konfiguriert ist, da&szlig; sie der neuen Maschine Boot
      Loader, Kernel und Root-Dateisystem zur Verf&uuml;gung stellt.
      Dazu werden RARP, TFTP und BOOTP oder DHPC genutzt.  Dieser
      <literal>netboot</literal> Server kann ein anderes &os; System
      sein, aber das ist nicht unbedingt notwendig.</para>

    <para>Sie m&uuml;ssen sich f&uuml;r eine der beiden Varianten
      entscheiden, da Sie f&uuml;r die beiden Versionen
      unterschiedliche Dateien ben&ouml;tigen; au&szlig;erdem
      unterscheidet sich die Vorgehensweise bei den beiden Varianten
      deutlich.</para>

    <sect3 id="downloading">
      <title>Download der ben&ouml;tigten Dateien</title>

      <para>In diesem Abschnitt finden Sie eine Liste der f&uuml;r die
        Installation von &os;/&arch; ben&ouml;tigten Dateien.  Obwohl
        die URLs auf den prim&auml;ren &os; FTP Server zeigen, sollten
        Sie nach M&ouml;glichkeit einen der Mirrors nutzen.</para>

      <important>
        <para>Die hier genannten URLs sind vorl&auml;ufig und
          k&ouml;nnen sich jederzeit &auml;ndern.  Sie sollten im
          Zweifelsfall einen Blick in das Archiv der Mailingliste &a.sparc; werfen,
          um die derzeit aktuellen URLs zu erhalten.  Wenn sich die
          Situation stabilisiert hat, wird dieser Hinweis
          entfernt.</para>

        <para>[Anmerkung des &Uuml;bersetzers:  Aus genau diesem Grund
          finden Sie hier noch keine Verweise auf deutsche
          Server.</para>
      </important>

      <sect4>
        <title>Ben&ouml;tigte Dateien f&uuml;r die Installation von
          CD</title>

        <para>Wenn Sie von CD installieren wollen, finden Sie ein ISO
          Image mit einem Schnappschu&szlig; der aktuellen Version von
          &os;/&arch; bei <ulink url="&release.url;"></ulink>.  Mit
          dieser Datei k&ouml;nnen Sie eine bootf&auml;hige CD
          erzeugen, auf der sich alle notwendigen Dateien f&uuml;r den
          Systemstart und die Erzeugung einer minimalen &os;
          Installation befinden.</para>
        <!-- XXX ISO location?-->
      </sect4>

      <sect4>
        <title>Ben&ouml;tigte Dateien f&uuml;r die
          Netzwerk-Installation</title>

        <para>Wenn Sie &uuml;ber ein Netzwerk installieren wollen,
          brauchen Sie mehrere Dateien.  Die erste ist der &os;/&arch;
          Loader, der von &man.tftpd.8; f&uuml;r Ihr &arch; System
          bereitgestellt wird.  Der Nutzer benutzt entweder TFTP oder
          NFS, um den &os; Kernel vom Netboot Server zu laden.
          F&uuml;r jede dieser beiden Methoden gibt es einen separaten
          Loader (also einen f&uuml;r TFTP und einen f&uuml;r NFS).
          Sie brauchen also nur eine dieser beiden Dateien:</para>

        <itemizedlist>
          <listitem>
            <para><ulink
              url="&release.url;loader-tftp.gz"></ulink></para>
          </listitem>

          <listitem>
            <para><ulink
              url="&release.url;loader-nfs.gz"></ulink></para>
          </listitem>
        </itemizedlist>

        <para>Die zweite Datei ist der Kernel, der dem bootenden
          System zur Verf&uuml;gung gestellt wird.  Diese Datei finden
          Sie auf <ulink url="&release.url;"></ulink>.</para>
        <!-- XXX kernel filename?-->

        <para>Die dritte (und letzte) Datei ist das &man.tar.1;
          Archiv mit den Programmen und Konfigurationsdateien des
          Basissystems.  Dieses Archiv finden Sie hier:  <ulink
          url="&release.url;distrib.tar.gz"></ulink>.</para>
      </sect4>
    </sect3>

    <sect3 id="getting-to-prom-prompt">
      <title>Start von OpenBoot</title>

      <para>Die meisten &arch; Systeme booten automatisch von
        Festplatte.  Wenn Sie &os; installieren wollen, m&uuml;ssen
        Sie den Startvorgang abbrechen, um zur OpenBoot
        Eingabeaufforderung zu gelangen.</para>

      <para>Dazu m&uuml;ssen Sie das System und auf die Boot-Meldung
        warten.  Diese ist zwar modellabh&auml;ngig, sollte aber wie
        folgt aussehen:</para>

      <screen>Sun Blade 100 (UltraSPARC-IIe), Keyboard Present
Copyright 1998-2001 Sun Microsystems, Inc.  All rights reserved.
OpenBoot 4.2, 128 MB memory installed, Serial #51090132.
Ethernet address 0:3:ba:b:92:d4, Host ID: 830b92d4.</screen>

      <para>Wenn Ihr System jetzt von Festplatte startet, m&uuml;ssen
        Sie die Tastenkombination <keycombo
        action="simul"><keycap>L1</keycap><keycap>A</keycap></keycombo>
        oder <keycombo
        action="simul"><keycap>Stop</keycap><keycap>A</keycap></keycombo>
        dr&uuml;cken.  Wenn Sie eine serielle Konsole verwenden,
        m&uuml;ssen Sie ein <command>BREAK</command> senden (z.B.
        durch die Eingabe von <command>~#</command> in &man.tip.1;
        oder &man.cu.1;).  Danach sollten Sie die Eingabeaufforderung
        von OpenBoot sehen, die wie folgt aussieht:</para>

      <screen><prompt>ok </prompt>      # Systeme mit nur einer CPU
<prompt>ok {0} </prompt>      # SMP-Systeme</screen>
    </sect3>
  </sect2>

  <sect2>
    <title>Installation von CD</title>

    <para>Legen Sie die CD ein, und wechseln Sie wie oben beschrieben
      zur Eingabeaufforderung von OpenBoot.  Geben Sie jetzt
      <command>boot cdrom</command> ein.  Das System sollte jetzt in
      Single-User-Mode starten, danach k&ouml;nnen Sie die Festplatte
      partitionieren und das Basissystem installieren, wie in <xref
      linkend="creating-disk-label"> und <xref
      linkend="creating-root-filesystem"> beschrieben.</para>
  </sect2>

  <sect2>
    <title>Netzwerk-Installation</title>

    <sect3>
      <title>Konfiguration des Netboot Servers</title>

      <para>Um den &os;/&arch; Kernel zu starten, mu&szlig; die
        Firmware den <application>Loader</application> laden und
        starten, dieser l&auml;dt und startet dann den eigentlichen
        Kernel.  Dazu m&uuml;ssen Sie &man.rarpd.8; und &man.tftpd.8;
        (f&uuml;r die Firmware) bzw. &man.bootpd.8; (f&uuml;r den
        <application>Loader</application>) konfigurieren.  Der Loader
        kann TFTP oder NFS nutzen, um den Kernel zu laden.  Weitere
        Informationen dazu finden Sie in den folgenden
        Kapiteln.</para>

      <sect4>
        <title>rarpd</title>

        <para>Sie m&uuml;ssen die Ethernet-Adresse Ihres &os;/&arch;
          System auf dem Netboot Server in die Datei
          <filename>/etc/ethers</filename> eintragen.  Die
          Eintr&auml;ge sehen wie folgt aus:</para>

        <programlisting>0:3:ba:b:92:d4 your.host.name</programlisting>

        <para>Sie finden die Ethernet-Adresse in der Boot-Meldung
          Ihres Systems.</para>

        <para>Vergewissern Sie sich, da&szlig; in
          <filename>/etc/hosts</filename> ein Eintrag f&uuml;r
          <hostid>your.host.name</hostid> steht.  Alternativ
          k&ouml;nnen Sie einen entsprechenden DNS-Eintrag verwenden
          oder gleich eine IP-Adresse verwenden.  Danach m&uuml;ssen
          Sie &man.rarpd.8; auf einem Netzwerk-Interface starten, das
          sich im gleichen Subnetz wie Ihr &os;/&arch; System
          befindet.</para>
      </sect4>

      <sect4>
        <title>tftpd</title>

        <para>In der Konfiguration von &man.inetd.8; mu&szlig;
          &man.tftpd.8; aktiviert werden.  Dazu m&uuml;ssen Sie in der
          Datei <filename>/etc/inetd.conf</filename> das
          Kommentarzeichen vor der folgenden Zeile entfernen:</para>

        <programlisting>tftp dgram udp  wait nobody /usr/libexec/tftpd tftpd /tftpboot</programlisting>

        <para>Entpacken Sie den Loader und kopieren Sie ihn in das
          Verzeichnis <filename>/tftpboot</filename>.  Allerdings
          k&ouml;nnen Sie der Datei keinen beliebigen Namen geben.
          Der Dateiname mu&szlig; die IP-Adresse des &os;/&arch; in
          hexadezimaler Notation in Gro&szlig;buchstaben und ohne
          Punkte sein.  Es ist nicht notwendig, die Datei
          umzubenennen, Sie k&ouml;nnen auch einen symbolischen Link
          verwenden.  Wenn die IP-Adresse des &os;/&arch; Systems
          <hostid>192.168.0.16</hostid> ist, w&uuml;rde Ihr
          <filename>/tftpboot</filename>-Verzeichnis so
          aussehen:</para>

        <screen>  lrwx------  1 tmm users       9 Jul 24 17:05 /tftpboot/C0A80010 -> boot/loader
  -rw-r--r--  1 tmm users 1643021 Oct 20 18:04 /tftpboot/boot/loader</screen>

        <para>Wenn Sie Probleme beim Systemstart haben, sollten Sie
          die TFTP Anfragen mit &man.tcpdump.1; kontrollieren.
          Dadurch sehen Sie, welchen Dateinamen Sie f&uuml;r den
          Loader benutzen m&uuml;ssen.  Fehlermeldungen des TFTP
          Servers werden in der Regel durch falsche Berechtigungen
          verursacht.</para>
      </sect4>

      <sect4>
        <title>Konfiguration von bootpd/dhcpd</title>

        <para>Sie k&ouml;nnen entweder BOOTP oder DHCP (nicht beide
          gleichzeitig) verwenden, um den Loader mit Informationen
          (wie der IP-Adresse des Systems) zu versorgen.  Wenn Sie ein
          &os;  System als Netboot Server benutzen, wird die BOOTP
          Funktionalit&auml;t von &man.bootpd.8; bereitgestellt, der
          ein Teil des &os;  Basissystems ist.  In der &os; Ports
          Collection finden Sie verschiedene DHCP Server.</para>

        <para>Wenn Sie &man.bootpd.8; benutzen, m&uuml;ssen Sie in
          <filename>/etc/bootptab</filename> entsprechende
          Eintr&auml;ge (Details finden Sie in &man.bootptab.5;)
          f&uuml;r Ihr &os;/&arch; System erzeugen:</para>

        <programlisting>.default:\
  :bf="kernel":dn=local:ds=<replaceable>name-server-ip-address</replaceable>:\
  :gw=<replaceable>gateway-ip-address</replaceable>:ht=ether:hd="/tftpboot/boot/kernel":hn:\
  :sa="<replaceable>tftp-server-ip-address</replaceable>":\
  :rp="<replaceable>tftp-server-ip-address</replaceable>:<replaceable>nfs-root-directory</replaceable>":\
  :sm=<replaceable>ip-netmask</replaceable>

&lt;Name des Eintrags>:\
  ha=<replaceable>sparc64-ethernet-address</replaceable>:ip=<replaceable>sparc64-ip-address</replaceable>:tc=.default</programlisting>

        <para>Die Ethernet-Adresse mu&szlig; mit der Adresse
          &uuml;bereinstimmen, die Sie f&uuml;r TFTP verwendet haben;
          allerdings mu&szlig; hier die hexadezimale Notation ohne
          Doppelpunkte verwendet werden (f&uuml;r das oben verwendete
          Beispiel w&auml;re das <literal>0003ba0b92d4</literal>).
          Sie k&ouml;nnen die NFS/TFTP-spezifischen Eintr&auml;ge
          weglassen, wenn Sie diese Variante nicht verwenden.  Die
          Werte f&uuml;r <literal>hd</literal> und
          <literal>bf</literal> werden zusammengesetzt, um Dateinamen
          der zu bootenden Datei zu erhalten.  Wenn der Dateiname
          Ihres Kernels anders ist oder Sie ein anderes Verzeichnis
          verwenden, m&uuml;ssen Sie diese Werte anpassen.  Wenn Sie
          NFS verwenden, sollten Sie die Einstellungen
          <literal>bf</literal> und <literal>hd</literal> entfernen
          oder dort das Verzeichnis und den Dateinamen im NFS Root
          Dateisystem eintragen, in dem der Kernel liegt.
          &Uuml;blicherweise wird f&uuml;r den Namen des Eintrags der
          Hostname des Zielsystems ohne die Domain verwendet.</para>

        <para>Wenn Sie einen DHCP Server verwenden, brauchen Sie einen
          Eintrag in der <filename>dhcpd.conf</filename>.  Ein
          Beispiel f&uuml;r einen solchen Eintrag f&uuml;r den
          <application>ISC DHCP</application> Version 2 (in der &os;
          Ports Collection als <filename
          role="package">net/isc-dhcp2</filename> erh&auml;ltlich)
          finden Sie weiter unten:</para>

        <programlisting>host <replaceable>name-of-entry</replaceable> {
  hardware ethernet <replaceable>sparc64-ethernet-address</replaceable>;
  option host-name "<replaceable>sparc64-fully-qualified-domain-name</replaceable>";
  fixed-address <replaceable>sparc64-ip-address</replaceable>;
  always-reply-rfc1048 on;
  filename "kernel";
  option root-path "<replaceable>tftp-server-ip-address</replaceable>:<replaceable>nfs-root-directory</replaceable>";
}</programlisting>

        <para>Die Option <literal>filename</literal> entspricht dem
          zusammengesetzten Wert von <literal>hd</literal> und
          <literal>bf</literal> in <filename>/etc/bootptab</filename>.
          Die Ethernet-Adresse wird in Hexadezimaler Notation mit
          Doppelpunkten angaben, genau wie bei &man.rarpd.8;.
          <literal>options root-path</literal> entspricht der
          <literal>rp</literal> in <filename>/etc/bootptab</filename>.
          Wenn der in <literal>option host-name</literal> angegebene
          Name aufgel&ouml;st werden kann, also einen Eintrag im DNS
          oder in <filename>/etc/hosts</filename> hat, kann auf die
          Angabe von <literal>fixed-address</literal> verzichtet
          werden.</para>
      </sect4>
    </sect3>

    <sect3>
      <title>Laden des Kernels</title>

      <para>Wenn Sie die Daemonen auf dem Netboot Server konfiguriert
        haben, m&uuml;ssen Sie im n&auml;chsten Schritt den Kernel an
        die richtige Stelle kopieren (Informationen, woher Sie den
        Kernel bekommen k&ouml;nnen, finden Sie in <xref
        linkend="downloading">).  Es gibt zwei M&ouml;glichkeiten, um
        den Kernel &uuml;ber ein Netzwerk zu laden:  TFTP oder NFS.
        Welche der beiden Alternativen Sie verwenden, haben Sie
        bereits bei der Auswahl des Loaders festgelegt.</para>

      <para>Sowohl bei TFTP als auch bei NFS wird der Loader die via
        BOOTP oder DHCP erhaltenen Informationen verwenden, um den
        Kernel zu finden.</para>

      <sect4>
        <title>Laden des Kernels mit TFTP</title>

        <para>Legen Sie den Kernel an die Stelle, die Sie in der
          <filename>/etc/bootptab</filename> mit <literal>bf</literal>
          und <literal>hd</literal> bzw. in der
          <filename>dhcpd.conf</filename> mit
          <literal>filename</literal> angegeben haben.</para>
      </sect4>

      <sect4>
        <title>Laden des Kernels via NFS</title>

        <para>Exportieren Sie das Verzeichnis, das Sie in der
          <filename>/etc/bootptab</filename> unter
          <literal>rp</literal> bzw. in der
          <filename>dhcpd.conf</filename> mit
          <literal>root-path</literal> definiert haben (siehe
          &man.exports.5;).  Kopieren Sie den Kernel in das
          Verzeichnis, das Sie in der
          <filename>/etc/bootptab</filename> mit <literal>bf</literal>
          und <literal>hd</literal> bzw. in der
          <filename>dhcpd.conf</filename> mit
          <literal>filename</literal> angegeben haben.</para>
      </sect4>
    </sect3>

    <sect3>
      <title>Installation des Basissystems auf dem NetBoot
        Server</title>

      <para>Sie m&uuml;ssen das Archiv mit dem Verzeichnis entpacken,
        das Sie in der <filename>/etc/bootptab</filename> unter
        <literal>rp</literal> bzw. in der
        <filename>dhcpd.conf</filename> mit
        <literal>root-path</literal> definiert haben.  Dieses
        Verzeichnis wird nach dem Start des Kernels zum Root
        Dateisystem f&uuml;r &arch; werden.  Neben den &uuml;blichen
        Benutzerprogrammen enth&auml;lt es alle notwendigen Programme,
        um das Basissystem auf der lokalen Festplatte des &arch;
        Systems zu installieren.</para>

      <para>Sie werden wahrscheinlich die auf dem Netboot Server zur
        Verf&uuml;gung stehenden Programme verwenden wollen, um die
        von &arch; verwendete <filename>/etc/fstab</filename> und
        <filename>/etc/rc.conf</filename> anzupassen und das
        <username>root</username> Pa&szlig;wort zu
        &auml;ndern.</para>
    </sect3>

    <sect3>
      <title>Start des Systems</title>

      <para>Wenn Sie alles richtig gemacht haben, sollten Sie jetzt
        &os; auf Ihrem &arch; System starten, indem Sie zur
        Eingabeaufforderung von OpenBoot wechseln, wie in <xref
        linkend="getting-to-prom-prompt"> beschrieben.  Wenn sie jetzt
        <command>boot net</command> eingeben, sollte das System
        hochfahren.  Um genau zu sein, der Loader wird mit TFTP
        geladen, setzt dann einen BOOTP Request ab und l&auml;dt den
        Kernel via TFTP oder NFS, je nach verwendeter Variante des
        Loaders.  Danach sollte es 10 Sekunden auf eine Eingabe warten
        und anschlie&szlig;end den Kernel starten.</para>

      <para>Wenn irgend etwas nicht funktioniert und Sie ein Problem
        mit TFTP/NFS/BOOTP vermuten, sollten Sie zur Fehlersuche
        <application>Ethereal</application> (<filename
        role="package">net/ethereal</filename> in der &os; Ports
        Collection) verwenden.  In den meisten F&auml;llen werden die
        Probleme durch falsche Zugriffsrechte f&uuml;r die Dateien
        verursacht.  Weiterhin ist es in einigen F&auml;llen
        m&ouml;glich, da&szlig; &man.rarpd.8; nicht reagiert, weitere
        Informationen finden Sie in der Onlinehilfe.</para>
    </sect3>
  </sect2>

  <sect2 id="creating-disk-label">
    <title>Aufteilung der Festplatte</title>

    <para>Der Kernel unterst&uuml;tzt das von Sun f&uuml;r den
      <literal>Disk Label</literal> verwendete Format, sie k&ouml;nnen
      die f&uuml;r &os; verwendete Platte also auch mit Solaris
      partitionieren.</para>

    <para>Da es f&uuml;r &os;/&arch; noch kein &man.sysinstall.8;
      gibt, m&uuml;ssen Sie das Disk Label manuell erzeugen, wenn Sie
      &os;/&arch; &os; verwenden.  Weitere Informationen zu diesem
      Thema k&ouml;nnen Sie dem <ulink
      url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/">FreeBSD
      Handbuch</ulink> entnehmen.</para>

    <para>Bei &os;/&arch; mu&szlig; ein Sun-kompatibles Label in das
      &os; Label eingebettet werden, damit OpenBoot von der Platte
      booten kann.  Dadurch ergibt sich eine zus&auml;tzliche
      Einschr&auml;nkung:  Der Anfang der Partitionen mu&szlig; auf
      einer Zylindergrenze liegen.</para>

    <para>Um ein Disk Label zu erzeugen, sollten Sie wie folgt
      vorgehen:</para>

    <procedure>
      <step>
        <para>Erzeugen sie mit <command>disklabel -w -r
          <replaceable>device</replaceable> auto</command> ein leeres
          Standard-Label.  Der dritte Parameter ist der Name des
          Ger&auml;tes, nicht der komplette Pfad zur Node f&uuml;r
          dieses Ger&auml;t (z.B. <devicename>ad0</devicename>
          f&uuml;r die erste ATA Festplatte).</para>
      </step>

      <step>
        <para>Mit dem Befehl <command>disklabel -e
          <replaceable>device</replaceable></command> starten Sie
          einen Editor, in dem Sie das Disk Label bearbeiten
          k&ouml;nnen.  Das Disk Label sieht wie folgt aus:</para>

        <screen># /dev/ad6c:
type: unknown
disk: amnesiac
label:
flags:
bytes/sector: 512
sectors/track: 63
tracks/cylinder: 16
sectors/cylinder: 1008
cylinders: 79780
sectors/unit: 80418240
rpm: 3600
interleave: 1
trackskew: 0
cylinderskew: 0
headswitch: 0           # milliseconds
track-to-track seek: 0  # milliseconds
drivedata: 0

8 partitions:
#        size   offset    fstype   [fsize bsize bps/cpg]
  c: 80418240        0    unused        0     0         # (Cyl.    0 - 79779)</screen>

        <para>Sie k&ouml;nnen jetzt weitere Partitionen definieren,
          diese m&uuml;ssen in dem Format vorliegen, das auch f&uuml;r
          Partition <literal>c</literal> verwendet.  Sie k&ouml;nnen
          Sich das Leben etwas einfacher machen, wenn Sie f&uuml;r das
          Feld <literal>offset</literal> immer den Wert
          <literal>*</literal> angeben.  Weitere Informationen finden
          Sie in der Onlinehilfe zu &man.disklabel.8;.</para>

        <para>Damit die oben genannte Einschr&auml;nkung eingehalten
          wird, mu&szlig; die Gr&ouml;&szlig;e jeder Partition ein
          ganzzahliges Vielfaches des Produktes aus der Anzahl der
          Bytes pro Sektors (<literal>bytes/sector</literal>) und der
          Anzahl der Sektoren pro Zylinder
          (<literal>sectors/cylinder</literal>) sein.  In diesem
          Beispiel w&auml;ren das 516096 (512*1008) Byte.</para>

        <para>Wenn Sie alle Partitionen definiert haben, m&uuml;ssen
          Sie die &Auml;nderungen speichern und den Editor verlassen,
          dadurch wird automatisch ein neues Disk Label
          geschrieben.</para>

        <warning>
          <para>Dadurch wird ein bereits existierendes Disk Label
            komplett &uuml;berschrieben.  Wenn auf der Festplatte
            bereits Dateisysteme existieren, m&uuml;ssen Sie im alten
            und neuen Label <emphasis>absolut identisch</emphasis>
            definiert sein.  Sind sie das nicht, werden die
            Dateisysteme und alle Daten auf diesen Dateisystemen
            gel&ouml;scht.</para>
        </warning>
      </step>

      <step>
        <para>Wenn Sie mit &os;/&arch; von dieser Platte wollen,
          m&uuml;ssen Sie sie mit <command>disklabel -B</command>
          bootf&auml;hig machen.</para>

        <warning>
          <para>Durch die Verwendung von <command>disklabel
            -B</command> &uuml;berschreiben Sie einen bereits
            existierenden Bootsektor.  Wenn auf der Platte ein anderes
            Betriebssystem installiert ist, werden Sie es
            anschlie&szlig;end nicht mehr starten k&ouml;nnen.</para>
        </warning>

        <para>Wenn Sie den Bootsektor nicht &uuml;berschreiben wollen,
          ist es m&ouml;glich, den <application>Loader</application>
          wie oben beschrieben via TFTP zu starten und ihn dann den
          Kernel von Festplatte starten zu lassen.  Dazu brauchen Sie
          eine spezielle Version des Loaders, die bei <ulink
          url="ftp://ftp.FreeBSD.org/pub/FreeBSD/development/sparc64/loader-ufs.gz"></ulink>
          erh&auml;ltlich ist.</para>
      </step>
    </procedure>
  </sect2>

  <sect2 id="creating-root-filesystem">
    <title>Erzeugung des Root Dateisystems</title>

    <para>Wenn Sie von der lokalen Platte booten wollen, brauchen Sie
      ein Root Dateisystem, das die Benutzerprogramme und
      Konfigurationsdateien des Basissystems enth&auml;lt.
      Nat&uuml;rlich kann es auch weitere Dateisysteme aufnehmen, die
      z.B. unter <filename>/usr</filename> und
      <filename>/var</filename> gemountet werden.</para>

    <para>Der Kernel unterst&uuml;tzt Sun Disklabel, Sie k&ouml;nnen
      also Solaris Festplatten benutzen und diese sogar in Solaris mit
      <application>newfs</application> vorbereiten.  Das Disk Label
      und die Dateisysteme von NetBSD werden von &os;  ebenfalls
      unterst&uuml;tzt.</para>

    <warning>
      <para>Sie d&uuml;rfen <emphasis>auf gar keinen Fall</emphasis>
        den <application>fsck</application> von Solaris auf
        Dateisystemen nutzen, die von &os; verwendet werden, da dieser
        s&auml;mtliche Zugriffsrechte &uuml;berschreibt.</para>
    </warning>

    <para>Um die Dateisysteme zu erzeugen und das Basissystem zu
      erzeugen, starten Sie Ihr System von CD oder via NFS und legen
      Sie dann wie in <xref linkend="creating-disk-label"> beschrieben
      ein Disk Label an.</para>

    <para>Wenn Sie das System zum ersten Mal starten und Ihr Root
      Dateisystem noch nicht in <filename>/etc/fstab</filename>
      eingetragen haben, m&uuml;ssen Sie wahrscheinlich Ihr Root
      Dateisystem beim Start angeben.  Wenn Sie die entsprechende
      Eingabeaufforderung erhalten, sollten Sie das Format
      <command>ufs:<replaceable>disk</replaceable><replaceable>partition</replaceable></command>
      verwenden, also keine Slice angaben.  Wenn der Kernel versucht,
      automatisch von einem anderen Dateisystem zu booten,
      dr&uuml;cken Sie eine Taste au&szlig;er <keycap>Enter</keycap>,
      sobald der <application>Loader</application> die folgende
      Meldung ausgibt:</para>

    <screen>Hit [Enter] to boot immediately, or any other key for command prompt.</screen>

    <para>Starten Sie den Kernel danach mit <command>boot -a
      -s</command>, dadurch werden Sie automatisch nach dem
      Root-Dateisystem gefragt, bevor das System in den
      Single-User-Modus geht.  Sobald das richtige Root Dateisystem in
      der <filename>/etc/fstab</filename> steht, sollte es beim
      n&auml;chsten Start des System automatisch als
      <filename>/</filename> gemountet werden.</para>

    <para>Wenn Sie &uuml;ber ein Netzwerk booten (mit NFS), sollten
      die oben genannte Eintr&auml;ge BOOTP ausreichend sein, damit
      der Kernel das Root Dateisystem via NFS finden und mounten
      kann.</para>
  </sect2>

  <sect2 id="installing-base-system">
    <title>Installation des Basissystems</title>

    <para>Wenn Sie &uuml;ber ein Netzwerk gebootet haben, haben Sie
      vorher ein &man.tar.1; Archive von heruntergeladen und es mit
      NFS vom Netboot Server exportiert.  Sie k&ouml;nnen das gleiche
      Archiv auf der lokalen Festplatte auspacken, um einen autonomes
      System zu erhalten.  Denken Sie daran, da&szlig; Sie den Kernel
      ebenfalls kopieren m&uuml;ssen.</para>

    <para>Wenn Sie Ihr System von CD gestartet haben, finden Sie das
      Archiv im Verzeichnis <filename>/root/</filename> auf der
      CDROM.</para>

    <para>Bevor Sie das neue System booten, sollten Sie
      <filename>/etc/fstab</filename> und
      <filename>/etc/rc.conf</filename> anpassen und ein Pa&szlig;wort
      f&uuml;r <username>root</username> vergeben.</para>

    <para>Bitte beachten Sie, da&szlig; Sie einige Programme des
      Basissystems in dem Archiv fehlen oder noch nicht fehlerfrei
      funktionieren.</para>
  </sect2>
</sect1>
<!--
  $FreeBSD$
  $FreeBSDde: de-docproj/relnotes/de_DE.ISO8859-1/installation/sparc64/install.sgml,v 1.2 2002/03/17 10:26:36 ue Exp $
  basiert auf: 1.7
  This file contains sparc64-specific installation instructions.
-->
