/*-
 * Copyright(c) 2002-2011 Exar Corp.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification are permitted provided the following conditions are met:
 *
 *    1. Redistributions of source code must retain the above copyright notice,
 *       this list of conditions and the following disclaimer.
 *
 *    2. Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *
 *    3. Neither the name of the Exar Corporation nor the names of its
 *       contributors may be used to endorse or promote products derived from
 *       this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */
/*$FreeBSD$*/

#ifndef	VXGE_HAL_REGS_H
#define	VXGE_HAL_REGS_H

__EXTERN_BEGIN_DECLS

#pragma pack(1)
/* Using this strcture to calculate offsets */
typedef struct vxge_hal_pci_config_le_t {
	u16	vendor_id;		/* 0x00 */
	u16	device_id;		/* 0x02 */

	u16	command;		/* 0x04 */
	u16	status;			/* 0x06 */

	u8	revision;		/* 0x08 */
	u8	pciClass[3];		/* 0x09 */

	u8	cache_line_size;	/* 0x0c */
	u8	latency_timer;		/* 0x0d */
	u8	header_type;		/* 0x0e */
	u8	bist;			/* 0x0f */

	u32	base_addr0_lo;		/* 0x10 */
	u32	base_addr0_hi;		/* 0x14 */

	u32	base_addr1_lo;		/* 0x18 */
	u32	base_addr1_hi;		/* 0x1C */

	u32	base_addr2_lo;		/* 0x20 */
	u32	base_addr2_hi;		/* 0x24 */

	u32	cardbus_cis_pointer;	/* 0x28 */

	u16	subsystem_vendor_id;	/* 0x2c */
	u16	subsystem_id;		/* 0x2e */

	u32	rom_base;		/* 0x30 */
	u8	capabilities_pointer;	/* 0x34 */
	u8	rsvd_35[3];		/* 0x35 */
	u32	rsvd_38;		/* 0x38 */

	u8	interrupt_line;		/* 0x3c */
	u8	interrupt_pin;		/* 0x3d */
	u8	min_grant;		/* 0x3e */
	u8	max_latency;		/* 0x3f */

	u8	rsvd_b1[VXGE_HAL_PCI_CONFIG_SPACE_SIZE - 0x40];
} vxge_hal_pci_config_le_t;	/* 0x100 */

typedef struct vxge_hal_pci_config_t {
#if defined(VXGE_OS_HOST_BIG_ENDIAN)
	u16	device_id;		/* 0x02 */
	u16	vendor_id;		/* 0x00 */

	u16	status;			/* 0x06 */
	u16	command;		/* 0x04 */

	u8	pciClass[3];		/* 0x09 */
	u8	revision;		/* 0x08 */

	u8	bist;			/* 0x0f */
	u8	header_type;		/* 0x0e */
	u8	latency_timer;		/* 0x0d */
	u8	cache_line_size;	/* 0x0c */

	u32	base_addr0_lo;		/* 0x10 */
	u32	base_addr0_hi;		/* 0x14 */

	u32	base_addr1_lo;		/* 0x18 */
	u32	base_addr1_hi;		/* 0x1C */

	u32	not_Implemented1;	/* 0x20 */
	u32	not_Implemented2;	/* 0x24 */

	u32	cardbus_cis_pointer;	/* 0x28 */

	u16	subsystem_id;		/* 0x2e */
	u16	subsystem_vendor_id;	/* 0x2c */

	u32	rom_base;		/* 0x30 */
	u8	rsvd_35[3];		/* 0x35 */
	u8	capabilities_pointer;	/* 0x34 */
	u32	rsvd_38;		/* 0x38 */

	u8	max_latency;		/* 0x3f */
	u8	min_grant;		/* 0x3e */
	u8	interrupt_pin;		/* 0x3d */
	u8	interrupt_line;		/* 0x3c */
#else
	u16	vendor_id;		/* 0x00 */
	u16	device_id;		/* 0x02 */

	u16	command;		/* 0x04 */
	u16	status;			/* 0x06 */

	u8	revision;		/* 0x08 */
	u8	pciClass[3];		/* 0x09 */

	u8	cache_line_size;	/* 0x0c */
	u8	latency_timer;		/* 0x0d */
	u8	header_type;		/* 0x0e */
	u8	bist;			/* 0x0f */

	u32	base_addr0_lo;		/* 0x10 */
	u32	base_addr0_hi;		/* 0x14 */

	u32	base_addr1_lo;		/* 0x18 */
	u32	base_addr1_hi;		/* 0x1C */

	u32	not_Implemented1;	/* 0x20 */
	u32	not_Implemented2;	/* 0x24 */

	u32	cardbus_cis_pointer;	/* 0x28 */

	u16	subsystem_vendor_id;	/* 0x2c */
	u16	subsystem_id;		/* 0x2e */

	u32	rom_base;		/* 0x30 */
	u8	capabilities_pointer;	/* 0x34 */
	u8	rsvd_35[3];		/* 0x35 */
	u32	rsvd_38;		/* 0x38 */

	u8	interrupt_line;		/* 0x3c */
	u8	interrupt_pin;		/* 0x3d */
	u8	min_grant;		/* 0x3e */
	u8	max_latency;		/* 0x3f */

#endif
	u8	rsvd_b1[VXGE_HAL_PCI_CONFIG_SPACE_SIZE - 0x40];
} vxge_hal_pci_config_t;	/* 0x100 */

#define	VXGE_HAL_EEPROM_SIZE	(0x01 << 11)

#if defined(VXGE_OS_HOST_BIG_ENDIAN)
#define	VXGE_HAL_PCI_CAP_ID(ptr)	*((ptr) + 3)
#define	VXGE_HAL_PCI_CAP_NEXT(ptr)	*((ptr) + 2)
#else
#define	VXGE_HAL_PCI_CAP_ID(ptr)	*(ptr)
#define	VXGE_HAL_PCI_CAP_NEXT(ptr)	*((ptr) + 1)
#endif

/* Capability lists */

#define	VXGE_HAL_PCI_CAP_LIST_ID	0	/* Capability ID */
#define	VXGE_HAL_PCI_CAP_ID_PM		0x01	/* Power Management */
#define	VXGE_HAL_PCI_CAP_ID_AGP		0x02	/* Accelerated Graphics Port */
#define	VXGE_HAL_PCI_CAP_ID_VPD		0x03	/* Vital Product Data */
#define	VXGE_HAL_PCI_CAP_ID_SLOTID	0x04	/* Slot Identification */
#define	VXGE_HAL_PCI_CAP_ID_MSI		0x05	/* Message Signalled Intr */
#define	VXGE_HAL_PCI_CAP_ID_CHSWP	0x06	/* CompactPCI HotSwap */
#define	VXGE_HAL_PCI_CAP_ID_PCIX	0x07	/* PCIX */
#define	VXGE_HAL_PCI_CAP_ID_HT		0x08	/* Hypertransport */
