freebsd/freebsd-src/usr.sbin/bluetooth/bcmfw/bcmfw.8
.\" bcmfw.8
.\" 
.\" Copyright (c) 2003 Maksim Yevmenkin <m_evmenkin@yahoo.com>
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.\" $Id: bcmfw.8,v 1.4 2003/04/28 17:10:56 max Exp $
.\" $FreeBSD$
.Dd March 31, 2003
.Dt BCMFW 8
.Os
.Sh NAME
.Nm BCMFW
.Nd Firmware download utility for Broadcom BCM2033 chip based Bluetooth USB devices
.Sh SYNOPSIS
.Nm
.Op Fl n Ar device name
.Op Fl m Ar mini-driver file name
.Op Fl f Ar firmware file name
.Op Fl h
.Sh DESCRIPTION
The
.Nm
utility downloads specified mini-driver and firmware files to the specified
device.
.Pp
This utility will
.Em only
work with Broadcom BCM2033 chip based Bluetooth USB devices. The identification
is currently based on USB vendor ID/product ID pair. The vendor ID should be
0x0a5c (
.Dv USB_VENDOR_BROADCOM
) and the product ID should be 0x2033.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl n Ar device name
Specify device name.
.It Fl m Ar mini-driver file name
Specify mini-driver file name for download.
.It Fl f Ar firmware file name
Specify firmware file name for download.
.It Fl h
Display usage message and exit.
.El
.Sh FILES
.Bl -tag -width xxxxxxxxxxxxxxxxx -compact
.It BCM2033-MD.hex
Mini-driver image.
.It BCM2033-FW.bin
Firmware image.
.It Pa /dev/ubtbcmfw Ns Ar N  Ns Pa \&. Ns Ar EE
Endpoint
.Ar EE
of device   
.Ar N .
.El
.Sh Examples
.Bl -tag -width foo
.It bcmfw -n ubtbcmfw0 -m BCM2033-MD.hex -f BCM2033-FW.bin
.Pp
Will download firmware into 
.Pa /dev/ubtbcmfw Ns Ar 0
device.
.El
.Sh BUGS
Most likely. Please report if found. This code
.Em was not
tested on a real BCM2033 based hardware.
.Sh DIAGNOSTICS
.Ex -std
.Sh SEE ALSO
.Xr ugen 4 ,
.Xr ubtbcmfw 4
.Sh AUTHORS
.An Maksim Yevmenkin Aq m_evmenkin@yahoo.com
