freebsd/freebsd-src/usr.bin/scrshot/scrshot.1
.\" Copyright (c) 2001 Nik Clayton
.\" All rights reserved
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 17, 2001
.Dt SCRSHOT 1
.Os
.Sh NAME
.Nm scrshot
.Nd capture the contents of a syscons terminal
.Sh SYNOPSIS
.Nm
.Ar device
.Sh DESCRIPTION
The
.Nm
utility uses the
.Xr syscons 4
.Dv CONS_SCRSHOT
.Xr ioctl 2
to capture the current contents of the video buffer corresponding to the
terminal device given as the first argument.
.Nm
writes version and additional information to the standard output, followed by
the contents of the terminal device.
.Sh IMPLEMENTATION NOTES
PC video memory is typically arranged in two byte tuples, one per character
position.
In each tuple, the first byte will be the character code, and the
second byte is the character's color attribute.
.Pp
The color attribute byte is further broken down in to the low nibble, which
specifies which of 16 different foreground colors is active, and the high
nibble, which specifies which of 16 different background colors is active.
.Pp
.Bl -hang -offset indent -compact
.It 0
Black
.It 1
Blue
.It 2
Green
.It 3
Cyan
.It 4
Red
.It 5
Magenta
.It 6
Brown
.It 7
White
.It 8
Grey
.It 9
Light Blue
.It 10
Light Green
.It 11
Light Cyan
.It 12
Light Red
.It 13
Light Magenta
.It 14
Yellow
.It 15
White
.El
.Pp
It can be seen that the last 8 colors are brighter versions of the first 8.
.Pp
For example, the two bytes
.Pp
.Dl "65 158"
.Pp
specify an uppercase A (character code 65), in yellow (low nibble 15) on a
light blue background (high nibble 9).
.Pp
The
.Nm
output contains a small header which includes additional information which may
be useful to utilities processing the output.
.Pp
The first 10 bytes are always arranged as follows:
.Bl -column "Byte range" "Contents" -offset indent
.It Sy "Byte Range	Contents"
.It "1 thru 8	Literal text" Dq Li SCRSHOT_
.It "9	File format version number"
.It "10	Remaining number of bytes in the header"
.El
.Pp
Subsequent bytes depend on the version number.
.Bl -column "Version" "13 and up" -offset indent
.It Sy "Version	Byte	Meaning"
.It "1	11	Terminal width, in characters"
.It "	12	Terminal depth, in characters"
.It "	13 and up	The snapshot data"
.El
.Pp
So a dump of an 80x25 screen would start (in hex)
.Bd -literal -offset indent
53 43 52 53 48 4f 54 5f 01 02 50 19
----------------------- -- -- -- --
          |              |  |  |  ` 25 decimal
          |              |  |  `--- 80 decimal
          |              |  `------ 2 remaining bytes of header data
          |              `--------- File format version 1
          `------------------------ Literal "SCRSHOT_"
.Ed
.Sh EXAMPLES
The command:
.Pp
.Dl "scrshot /dev/ttyv0 > shot.scr"
.Pp
will capture the contents of the first virtual terminal, and redirect the
output to the
.Pa shot.scr
file.
.Sh DIAGNOSTICS
The
.Nm
utility exits 0 on success or >0 if an error occurred.
.Sh SEE ALSO
.Xr syscons 4 ,
.Xr ascii 7 ,
.Xr watch 8
.Pp
The various
.Li shot2*
utilities in the
.Li textproc
category of the ports collection.
.Sh HISTORY
A
.Nm
utility first appeared in
.Fx 4.4 .
.Sh AUTHORS
.An Joel Holveck Aq joelh@gnu.org
.An Nik Clayton Aq nik@FreeBSD.org
