freebsd/freebsd-src/sbin/slattach/slattach.8
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)slattach.8	6.4 (Berkeley) 3/16/91
.\"
.\"	$Id: slattach.8,v 1.7 1993/10/13 07:16:39 rgrimes Exp $
.\"
.Dd April 4, 1993
.Dt SLATTACH 8
.Os BSD 4.3
.Sh NAME
.Nm slattach
.Nd attach serial lines as network interfaces
.Sh SYOPNSIS
.Nm Slattach
.Op \-a
.Op \-c
.Op \-e exit-command
.Op \-f
.Op \-h
.Op \-l
.Op \-n
.Op \-r redial-command
.Op \-s baudrate
.Op \-u unit-command
.Op \-z
.Ar ttyname 
.Sh DESCRIPTION
.Nm Slattach
is used to assign a tty line to a network interface,
and to define the network source and destination addresses.
The following operands are supported by
.Nm slattach :
.Bl -tag -width Ar
.It Ar \-a
Autoenable the VJ header compression option, if the other end of the link
is capable of VJ header compression then it will be used otherwise normal
headers will be used.
.It Ar \-c
Enables the VJ header compression option.  Note that both ends of the link
must be able to use VJ header compression for this to work.
.It Ar \-e exit-command
Specifies a command to be invoked within a shell (sh -c exit-command)
before slattach exits.
.It Ar \-f
Disables the invocation of daemon() to run slattach in the background.
.It Ar \-h
Turn on cts/rts style flow control on the slip port, by default no flow
control is done.
.It Ar \-l
disable modem control (CLOCAL) and ignore carrier detect on the slip
port.  By default the redial-command is invoked upon carrier drop and
slattach aborts if no redial-command is specified.
.It Ar \-n
Throw away ICMP packets.  The slip interface will ignore ICMP packets
to prevent slow lines being saturated by ICMP responses.
.It Ar \-r redial-command
Specifies a command to be invoked within a shell (sh -c
redial-command) whenever carrier is lost on the line.
.It Ar \-s baudrate
Specifies the speed of the connection. If not specified, the
default of 9600 is used.
.It Ar \-u unit-command
When the line is switched to slip discipline, run
.Ql sh \-c unit-command <last> <current> 
where <last> and <current> are the slip unit numbers when the line was
last opened and the unit number of the current slip connection
respecitvely.  The unit number can change after redialing if you are
using more than one slip line.  Slattach will abort if the unit number
changes and
.Ql \-u unit-command
was not specified.
.It Ar \-z
forces redial
redial-cmd upon startup irrespective of carrier.
.It Ar ttyname
Specifies the name of the tty device.
.Ar Ttyname
should be a string of the form 
.Ql ttyXX or
.Ql /dev/ttyXX.
.El
.Pp
Only the super-user may attach a network interface.
.Pp
To detach the interface, use
.Dq Li ifconfig interface-name down
after killing off the
.Nm slattach
process using
.Ql kill -INT .
.Ar Interface-name
is the name that is shown by
.Xr netstat 1
.Pp
To setup slattach to redial the phone when carrier is lost, use the
.Ql \-r redial-cmd
option to specify a script or executable that will reconnect the
serial line to the slip server.  For example, the script could redial
the server and log in, etc.
.Pp
To reconfigure the network interface in case the slip unit number
changes, use the
.Ql \-u unit-cmd
option to specify a script or executable that will be invoked as 
.Ql sh \-c unit-cmd old new,
where old and new are the slip unit numbers before and after
reconnecting the line.  The unit number can change if you have more
than one line disconnect at the same time.  The first to succeed in
reconnecting will get the lowest unit number.
.Pp
To kill slattach use
.Ql kill -INT
(SIGINT) which causes it to close the tty and exit.
.Pp
To force a redial, use
.Ql kill -HUP
(SIGHUP) which causes slattach to think carrier was lost and thus invoke 
.Ql sh -c redial-command
to reconnect to the server.
.Pp
If you use a hard-wired connection rather than a modem, invoke
slattach with the
.Ql \-l
option in order to ignore carrier on the slip line.
.Sh EXAMPLES
.Bd -literal -offset indent -compact
slattach ttyh8
slattach \-s 4800 /dev/tty01
slattach \-c \-s 38400 /dev/sio01
slattach \-r 'kermit -y dial.script >kermit.log 2>&1'
.Ed
.Sh DIAGNOSTICS
Look for error messages in /var/log/messages (slattach is a daemon).
Messages indicating the specified interface does not exit, the
requested address is unknown, the user is not privileged and tried to
alter an interface's configuration are logged there.  Slattach also
logs failure to set the controlling terminal or failure to install
signal handlers.  Upon connection and redial the ttyname and baud rate
are logged and on shutdown the ttyname is logged.
.Pp
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
