freebsd/freebsd-src/sys/modules/osf1/osf1.8
.\" Copyright (c) 1999
.\" The FreeBSD Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/sys/modules/osf1/osf1.8,v 1.1.2.3 2001/12/21 10:07:20 ru Exp $
.\"
.Dd December 31, 1998
.Dt OSF1 8
.Os
.Sh NAME
.Nm osf1
.Nd load the OSF/1 emulator kernel module
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
utility loads the OSF/1 image activator kernel module.
.Sh FILES
.Bl -tag -width /modules/osf1.ko
.It Pa /modules/osf1.ko
OSF/1 image activator loadable kernel module.
.El
.Sh SEE ALSO
.Xr kld 4 ,
.Xr kldload 8 ,
.Xr kldstat 8 ,
.Xr kldunload 8
