freebsd/freebsd-src/share/man/man4/man4.sparc64/auxio.4
.\"-
.\" Copyright (c) 2004 Pyun YongHyeon
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 8, 2004
.Dt AUXIO 4 sparc64
.Os
.Sh NAME
.Nm auxio
.Nd "Sun Auxiliary I/O"
.Sh SYNOPSIS
.Cd "device auxio"
.Cd "device sbus"
.Cd "device ebus"
.Sh DESCRIPTION
The
.Nm
device provides auxiliary I/O functions required by Sun
.Tn UltraSPARC
workstation and server models.
The front panel LED is also controlled by the device.
This LED can be made to blink by writing
.Tn ASCII
strings to the
.Pa /dev/led/auxioled
device.
.Sh FILES
.Bl -tag -width ".Pa /dev/led/auxioled"
.It Pa /dev/led/auxioled
Auxiliary I/O device node
.El
.Sh SEE ALSO
.Xr led 4
.Sh HISTORY
The
.Nm
driver appeared in
.Fx 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was ported by
.An Pyun YongHyeon
.Aq yongari@FreeBSD.org
from the
.Nx
driver written by
.An Matthew R. Green .
