freebsd/freebsd-src/share/man/man4/man4.sparc64/machfb.4
.\"-
.\" Copyright (c) 2002 Jason L. Wright (jason@thought.net)
.\" Copyright (c) 2005 Marius Strobl <marius@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: OpenBSD: creator.4,v 1.20 2005/03/05 01:48:59 miod Exp
.\" $FreeBSD$
.\"
.Dd June 18, 2005
.Dt MACHFB 4 sparc64
.Os
.Sh NAME
.Nm machfb
.Nd "accelerated color frame buffer"
.Sh SYNOPSIS
.Cd "device machfb"
.Sh DESCRIPTION
The
.Tn ATI Mach64
family of chips are color frame buffers with graphics acceleration.
The
.Nm
driver interfaces those frame buffers with the
.Xr syscons 4
console driver.
.Pp
.Tn ATI Mach64
chips are very common as low-end graphics chips in
.Tn PCI
based
.Tn UltraSparc
systems.
They are found on-board in
.Tn Sun Blade 100 ,
.Tn Sun Blade 150 ,
.Tn Sun Ultra 5
and
.Tn Sun Ultra 10
as well as on
.Tn Sun
OEM mainboards like the
.Tn Sun AXe .
They are also used on add-on cards like the
.Tn Sun PGX8
and
.Tn Sun PGX64 .
.Sh HARDWARE
The
.Nm
driver provides support for the following chips:
.Pp
.Bl -bullet -compact
.It
.Tn ATI 3D Rage II+
.It
.Tn ATI 3D Rage IIC
.It
.Tn ATI 3D Rage I/II
.It
.Tn ATI 3D Rage LT
.It
.Tn ATI 3D Rage LT Pro
.It
.Tn ATI 3D Rage Pro
.It
.Tn ATI 3D Rage Pro Turbo
.It
.Tn ATI Mach64 CT
.It
.Tn ATI Mach64 VT
.It
.Tn ATI Mach64 VT4
.It
.Tn ATI Mach64 VTB
.It
.Tn ATI Rage L Mobility
.It
.Tn ATI Rage Mobility
.It
.Tn ATI Rage Mobility M1
.It
.Tn ATI Rage Mobility M3
.It
.Tn ATI Rage XC
.It
.Tn ATI Rage XL
.El
.Pp
The
following add-on cards are known to work with the
.Nm
driver at this time:
.Pp
.Bl -bullet -compact
.It
.Tn ATI 3D Charger PCI
.It
.Tn Sun PGX64
.El
.Sh CAVEATS
Font loading and mode switching are not implemented.
.Sh SEE ALSO
.Xr creator 4 ,
.Xr syscons 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0 .
The first
.Fx
version to include it was
.Fx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An "Marius Strobl" Aq marius@FreeBSD.org
based on the
.Nx
driver written by
.An "Bang Jun-Young" .
