freebsd/freebsd-src/sbin/mount_nandfs/mount_nandfs.8
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" Copyright (c) 1999 Semen Ustimenko
.\" Copyright (c) 2005 Jean-Sébastien Pédron
.\" Copyright (c) 2010 Semihalf
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd February 28, 2012
.Dt MOUNT_NANDFS 8
.Os
.Sh NAME
.Nm mount_nandfs
.Nd "mount a NandFS file system"
.Sh SYNOPSIS
.Nm
.Op Fl n
.Op Fl f Ar cleanerd_config
.Op Fl c Ar snapshot
.Op Fl o Ar options
.Ar special
.Ar node
.Sh DESCRIPTION
The
.Nm
utility attaches the NandFS file system residing on the device
.Ar special
to the global file system namespace at the location
indicated by
.Ar node .
.Pp
This command is normally executed by
.Xr mount 8
at boot time, but can be used by any user to mount a
NandFS file system on any directory that they own (provided,
of course, that they have appropriate access to the device that
contains the file system).
.Pp
The options are as follow:
.Bl -tag -width indent
.It Fl n
Don't run
.Xr cleanerd 8 .
.It Fl f Ar cleanerd_config
Run 
.Xr cleanerd 8 
with config
.Ar cleanerd_config .
.It Fl c Ar snapshot
Mount specified snapshot.
.It Fl o Ar options
Options are specified by a comma separated string of options.  
See the mount(8) man page for possible options and their meanings.
.El
.Sh EXAMPLES
To mount a NandFS volume located in
.Pa /dev/md0 :
.Pp
.Dl "mount_nandfs /dev/md0 /mnt"
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh AUTHORS
.An Grzegorz Bernacki
.An Jakub Klama
