freebsd/freebsd-src/sbin/ipfw/diffuse_collector/diffuse_collector.8
.\"
.\" Copyright (c) 2010
.\"	Swinburne University of Technology, Melbourne, Australia.
.\" Copyright (c) 2011 The FreeBSD Foundation
.\" All rights reserved.
.\"
.\" This software was developed at the Centre for Advanced Internet
.\" Architectures, Swinburne University of Technology, by Sebastian Zander, made
.\" possible in part by a gift from The Cisco University Research Program Fund, a
.\" corporate advised fund of Silicon Valley Community Foundation.
.\"
.\" Portions of this documentation were written at the Centre for Advanced
.\" Internet Architectures, Swinburne University of Technology, Melbourne,
.\" Australia by Lawrence Stewart under sponsorship from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR
.\" ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 23, 2011
.Dt diffuse_collector 8
.Os
.Sh NAME
.Nm diffuse_collector
.Nd receive flow information from one or more flow information sources and
manage local firewall and/or traffic shaper actions.
.Sh SYNOPSIS
.Nm
.Op Fl hnv
.Op Fl c Ar config-file
.Op Fl s Ar sctp-port
.Op Fl t Ar tcp-port
.Op Fl u Ar udp-port
.Sh DESCRIPTION
The
.Nm
utility receives flow information directly from classifier nodes via UDP, or
indirectly from
.Xr diffuse_exporter
instances via UDP, TCP or SCTP.
.Nm
uses the flow information received to manage local firewall and/or traffic
shaper actions.
.Pp
.Nm
was tested with the
.Xr ipfw 4
firewall, but provisions exist in the code to simplify adding support for
different firewalls in future.
.Pp
The following options are available:
.Bl -tag -width "Ar actions-file" -offset indent
.It Fl c Ar config-file
Path to the plain text INI-style configuration file.
.It Fl h
Show help.
.It Fl n
Do not generate firewall commands.
Useful for testing.
.It Fl s Ar sctp-port
SCTP port to listen on.
.It Fl t Ar tcp-port
TCP port to listen on.
.It Fl u Ar udp-port
UDP port to listen on.
.It Fl v
Increase verbosity.
.El
.Sh CONFIGURATION FILE
The
.Nm
configuration file uses an INI style layout with key-value pair configuration
items.
There are currently three sections:
.Qq general ,
.Qq firewall
and
.Qq classactions .
The example configuration file mentioned in the
.Sx FILES
section documents the available configuration options and their syntax.
.Sh FILES
.Bl -tag -width "conf" -compact -offset 0
.It Pa /usr/share/examples/diffuse/collector.conf
An example collector configuration file using
.Xr ipfw 4
for the underlying firewall.
.El
.Sh EXAMPLES
Listen for flow information on UDP and TCP port 5000 and parse the
/etc/collector.conf configuration file to obtain the rest of the required
configuration:
.Bd -literal -offset indent
.Nm Ns
 -c /etc/collector.conf -u 5000 -t 5000
.Ed
.Sh SEE ALSO
.Xr diffuse 4 ,
.Xr dummynet 4 ,
.Xr ipfw 4 ,
.Xr diffuse_exporter 8 ,
.Xr ipfw 8
.Sh ACKNOWLEDGEMENTS
Development and testing of this software were made possible in part by grants
from the FreeBSD Foundation and The Cisco University Research Program Fund, a
corporate advised fund of Silicon Valley Community Foundation.
.Sh HISTORY
The
.Nm
utility is part of the DIFFUSE architecture and first appeared in
.Fx 10.0 .
.Pp
DIFFUSE
.Ns ( Em DI Ns stributed
.Em F Ns irewall
and
.Em F Ns low-shaper
.Em U Ns sing
.Em S Ns tatistical
.Em E Ns vidence )
was first released in 2010 by Sebastian Zander whilst working on the DIFFUSE
research project at Swinburne University of Technology's Centre for Advanced
Internet Architectures, Melbourne, Australia, which was made possible in part by
a gift from The Cisco University Research Program Fund, a corporate advised fund
of Silicon Valley Community Foundation.
More details are available at:
.Pp
http://caia.swin.edu.au/urp/diffuse/
.Sh AUTHORS
.An -nosplit
The
.Nm
was written by
.An Sebastian Zander Aq szander@swin.edu.au
and later extended by
.An Lawrence Stewart Aq lstewart@FreeBSD.org .
.Pp
This manual page was written by
.An Sebastian Zander Aq szander@swin.edu.au
and
.An Lawrence Stewart Aq lstewart@FreeBSD.org .
.Sh BUGS
.Bl -dash
.It
IPv6 is currently unsupported.
.El
