freebsd/freebsd-src/7/usr.sbin/jls/jls.8
.\"
.\" Copyright (c) 2003 Mike Barcroft <mike@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 29, 2008
.Dt JLS 8
.Os
.Sh NAME
.Nm jls
.Nd "list jails"
.Sh SYNOPSIS
.Nm
.Op Fl av
.Sh DESCRIPTION
The
.Nm
utility lists all jails.
By default only active jails are listed.
.Pp
The options are as follows:
.Bl -tag -width ".Fl a"
.It Fl a
Show jails in all states, not only active ones.
.It Fl v
Show more verbose information.
This also lists cpusets, jail state, multi-IP, etc. instead of the
classic single-IP jail output.
.El
.Pp
Each jail is represented by rows which, depending on
.Fl v ,
contain the following columns:
.Bl -item -offset indent -compact
.It
jail identifier (JID), hostname and path
.It
jail state and name
.It
jail cpuset
.It
followed by one IP adddress per line.
.El
.Sh SEE ALSO
.Xr jail 2 ,
.Xr jail 8 ,
.Xr jexec 8
.Sh HISTORY
The
.Nm
utility was added in
.Fx 5.1 .
