freebsd/freebsd-src/usr.bin/vmstat/vmstat.8
.\" Copyright (c) 1986, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)vmstat.8	8.1 (Berkeley) 6/6/93
.\"	$Id$
.\"
.Dd June 6, 1996
.Dt VMSTAT 8
.Os BSD 4
.Sh NAME
.Nm vmstat
.Nd report virtual memory statistics
.Sh SYNOPSIS
.Nm vmstat
.\" .Op Fl fimst
.Op Fl ims
.Op Fl c Ar count
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
.Op Ar disks
.Sh DESCRIPTION
.Nm Vmstat
reports certain kernel statistics kept about process, virtual memory,
disk, trap and cpu activity.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl c
Repeat the display
.Ar count
times.
The first display is for the time since a reboot and each subsequent report
is for the time period since the last display.
If no
.Ar wait
interval is specified, the default is 1 second.
.\" .It Fl f
.\" Report on the number
.\" .Xr fork 2
.\" and
.\" .Xr vfork 2
.\" system calls since system startup, and the number of pages of virtual memory
.\" involved in each.
.It Fl i
Report on the number of interrupts taken by each device since system
startup.
.It Fl M
Extract values associated with the name list from the specified
.Ar core 
instead of the default 
.Pa /dev/kmem .
.It Fl N
Extract the name list from the specified 
.Ar system 
instead of the default
.Pa /kernel .
.It Fl m
Report on the usage of kernel dynamic memory listed first by size of
allocation and then by type of usage.
.It Fl s
Display the contents of the
.Em sum
structure, giving the total number of several kinds of paging related
events which have occurred since system startup.
.\" .It Fl t
.\" Report on the number of page in and page reclaims since system startup,
.\" and the amount of time required by each.
.It Fl w
Pause
.Ar wait
seconds between each display.
If no repeat
.Ar count
is specified, the default is infinity.
.El
.Pp
By default,
.Nm vmstat
displays the following information:
.Pp
.Bl -tag -width indent
.It procs
Information about the numbers of processes in various states.
.Pp
.Bl -tag -width indent -compact
.It r
in run queue
.It b
blocked for resources (i/o, paging, etc.)
.It w
runnable or short sleeper (< 20 secs) but swapped
.El
.It memory
Information about the usage of virtual and real memory.
Virtual pages (reported in units of 1024 bytes) are considered active if
they belong to processes which are running or have run in the last 20
seconds.
.Pp
.Bl -tag -width indent -compact
.It avm
active virtual pages
.It fre	
size of the free list
.El
.It page
Information about page faults and paging activity.
These are averaged each five seconds, and given in units per second.
.Pp
.Bl -tag -width indent -compact
.It flt
total number of page faults
.It re
page reclaims (simulating reference bits)
.\" .It at
.\" pages attached (found in free list)
.It pi
pages paged in
.It po
pages paged out
.It fr
pages freed per second
.\" .It de
.\" anticipated short term memory shortfall
.It sr
pages scanned by clock algorithm, per-second
.El
.It disks
Disk operations per second (this field is system dependent).
Typically paging will be split across the available drives.
The header of the field is the first character of the disk name and
the unit number.
If more than four disk drives are configured in the system,
.Nm vmstat
displays only the first four drives.
To force
.Nm vmstat
to display specific drives, their names may be supplied on the command line.
.It faults
Trap/interrupt rate averages per second over last 5 seconds.
.Pp
.Bl -tag -width indent -compact
.It in
device interrupts per interval (including clock interrupts)
.It sy
system calls per interval
.It cs
cpu context switch rate (switches/interval)
.El
.It cpu
Breakdown of percentage usage of CPU time.
.Pp
.Bl -tag -width indent -compact
.It us
user time for normal and low priority processes
.It sy
system time
.It id
cpu idle
.El
.El
.Sh EXAMPLES
The command:
.Dl vmstat -w 5
will print what the system is doing every five
seconds; this is a good choice of printing interval since this is how often
some of the statistics are sampled in the system.
Others vary every second and running the output for a while will make it
apparent which are recomputed every second.
.Sh FILES
.Bl -tag -width /dev/kmemxxx -compact
.It Pa /kernel
default kernel namelist
.It Pa /dev/kmem
default memory file
.El
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr iostat 8 ,
.Xr pstat 8
.Pp
The sections starting with ``Interpreting system activity'' in
.%T "Installing and Operating 4.3BSD" .
.Sh BUGS
The 
.Fl c
and
.Fl w
options are only available with the default output.
