freebsd/freebsd-src/eBones/usr.sbin/kdb_init/kdb_init.8
.\" from: kdb_init.8,v 4.1 89/01/23 11:09:02 jtkohl Exp $
.\" $Id: kdb_init.8,v 1.2 1994/07/19 19:27:29 g89r4222 Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <Copyright.MIT>.
.\"
.TH KDB_INIT 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kdb_init \- Initialize Kerberos key distribution center database
.SH SYNOPSIS
kdb_init [ 
.B realm
]
.SH DESCRIPTION
.I kdb_init
initializes a Kerberos key distribution center database, creating the
necessary principals.
.PP
If the optional
.I realm
argument is not present,
.I kdb_init
prompts for a realm name (defaulting to the definition in /usr/include/krb.h).
After determining the realm to be created, it prompts for
a master key password.  The master key password is used to encrypt
every encryption key stored in the database.
.SH DIAGNOSTICS
.TP 20n
"/kerberos/principal: File exists"
An attempt was made to create a database on a machine which already had
an existing database.
.SH FILES
.TP 20n
/kerberos/principal.pag, /kerberos/principal.dir
DBM files containing database
.TP
/usr/include/krb.h
Include file defining default realm
.SH SEE ALSO
kdb_destroy(8)
