<!--
  $FreeBSD$
  $FreeBSDde: de-docproj/relnotes/de_DE.ISO8859-1/hardware/i386/proc-i386.sgml,v 1.13 2003/05/24 21:49:22 ue Exp $
  basiert auf: 1.11
-->

<sect1 id="proc">
  <title>Unterst&uuml;tzte Prozessoren und Mainboards</title>

  <para>&os;/i386 kann auf vielen <quote>IBM PC kompatiblen</quote>
    Maschinen benutzt werden.  Es ist nicht m&ouml;glich, hier alle
    unterst&uuml;tzten Kombinationen aufzuf&uuml;hren, die von &os;
    unterst&uuml;tzt werden, da es viel zu viele M&ouml;glichkeiten
    gibt.  Dennoch ist es m&ouml;glich, einige allgemeine Hinweise zu
    geben.</para>

  <para>Fast alle i386-kompatiblen Prozessoren werden
    unterst&uuml;tzt.  Alle Prozessoren von Intel ab dem 80386 werden
    unterst&uuml;tzt, also 80386, 80486, Pentium, Pentium Pro, Pentium
    II, Pentium III, Pentium 4, und die Modellvarianten dieser
    Prozessoren, wie der Xeon und Celeron.  Der 80386sx wird zwar
    unterst&uuml;tzt, wir raten aber dringend von der Verwendung
    dieser CPU ab).  Alle i386-kompatiblen Prozessoren von AMD werden
    unterst&uuml;tzt, dazu geh&ouml;ren Am486, Am5x86, K5, K6 (alle
    Varianten), Athlon (einschlie&szlig;lich Athlon-MP, Athlon-XP,
    Athlon-4 und Athlon Thunderbird) und Duron.  Der integrierte
    Prozessor AMD &Eacute;lan SC520 wird unterst&uuml;tzt.  Der
    Transmeta Crusoe wird erkannt und unterst&uuml;tzt, das gleiche
    gilt f&uuml;r die i386-kompatiblen Prozessoren von Cyrix und
    NexGen.</para>

  <para>F&uuml;r diese Plattform gibt es ganz Reihe verschiedener
    Mainboards.  F&uuml;r Mainboards mit ISA, VLB, EISA, AGP, und PCI
    Steckpl&auml;tzen ist die Unterst&uuml;tzung ausgezeichnet.  Der
    MCA (<quote>MicroChannel</quote>) Bus, der in den IBM PS/2
    Computern zu finden ist, wird nur teilweise
    unterst&uuml;tzt.</para>

  <para>Symmetrische Multi-Prozessor (SMP) Systeme werden im
    allgemeinen von &os; unterst&uuml;tzt.  Allerdings kommt es in
    einigen F&auml;llen zu Problemen, weil das BIOS oder das Mainboard
    fehlerhaft sind.  Ein Blick in der Archive der Mailingliste &a.smp;
    kann hier weiterhelfen.</para>

  <para>&os; nutzt HyperThreading (HTT) auf Intel CPUs, wenn die CPU
    dies unterst&uuml;tzt.  Wenn in der Konfigurationsdatei f&uuml;r
    den angepa&szlig;ten Kernel die Zeile
    <literal>options&nbsp;SMP</literal> angegeben ist, erkennt und
    aktiviert der Kernel die zus&auml;tzlichen logischen Prozessoren.
    Der Standard-Scheduler in &os; behandelt diese logischen
    Prozessoren genau so wie zus&auml;tzliche physikalische
    Prozessoren.  Mit anderen Worten, der Scheduler
    ber&uuml;cksichtigt bei seinen Entscheidungen nicht, da&szlig;
    sich die logischen Prozessoren auf einer CPU bestimmte Ressourcen
    teilen.  Da dieses sehr einfache Vorgehen zu schlechter
    Performance f&uuml;hren kann, werden die logischen CPUs beim
    Systemstart standardm&auml;&szlig;ig deaktiviert.  Sie k&ouml;nnen
    mit der sysctl-Variable
    <varname>machdep.hlt_logical_cpus</varname> aktiviert werden.  Es
    ist au&szlig;erdem m&ouml;glich, jede CPU anzuhalten, die sich im
    Idle-Loop befindet, dazu dient die sysctl-Variable
    <varname>machdep.hlt_cpus</varname>.  Weitere Informationen finden
    Sie in &man.smp.4;.</para>

  <para>Unterst&uuml;tzt die CPU die Physical Address Extension (PAE),
    kann &os; diese Erweiterung nutzen, wenn in der
    Konfigurationsdatei f&uuml;r den angepa&szlig;ten Kernel die
    Option <literal>PAE</literal> angegeben wird.  In diesem Fall
    wird der Speicher oberhalb von 4 GByte erkannt und steht f&uuml;r
    die Nutzung durch das System zur Verf&uuml;gung.  Allerdings sind
    nicht alle Teile von &os; und alle Treiber kompatibel zu
    <literal>PAE</literal>.  Weitere Informationen finden Sie in
    &man.pae.4;.</para>

  <para>&os; l&auml;uft normalerweise auf Laptops mit i386-Prozessoren,
    allerdings gibt es keinen einheitlichen Standard f&uuml;r die
    Unterst&uuml;tzung bestimmter Ausstattungsmerkmale wie Audio,
    Grafik, Power Management und PCCARD Steckpl&auml;tzen.  Diese
    Merkmale sind von Maschine zu Maschine verschiedenen.  In vielen
    F&auml;llen ist es sogar notwendig, &os; speziell anzupassen, um
    Fehlern in der Hardware und anderen Merkw&uuml;rdigkeiten
    auszuweichen.  Im Zweifelsfalle kann ein Blick in der Archive der
    Mailingliste &a.mobile; weiterhelfen.</para>

  <para>Die meisten aktuellen Laptops (und auch f&uuml;r den
    Schreibtisch vorgesehene Ger&auml;te) unterst&uuml;tzen den
    Advanced Configuration and Power Management (ACPI) Standard.  Wie
    in &man.acpi.4; beschrieben, nutzt &os; die von Intel
    ver&ouml;ffentlichte Referenz-Implementierung &quot;ACPI Component
    Architecture&quot;, um ACPI unterst&uuml;tzen zu k&ouml;nnen.
    Leider kann es durch die Benutzung von ACPI auf einigen Systemen
    zu Stabilit&auml;tsproblemen kommen, die es notwendig machen, den
    ACPI-Treiber abzuschalten.  Dieser wird normalerweise beim
    Systemstart als Kernel-Modul geladen.  Um ihn abzuschalten,
    m&uuml;ssen Sie die folgende Zeile in die Datei
    <filename>/boot/device.hints</filename> eintragen:</para>

  <programlisting>hint.acpi.0.disabled="1"</programlisting>

  <para>Wenn Sie ein Problem im Zusammenhang mit ACPI l&ouml;sen
    wollen, kann es helfen, Teile der ACPI-Funktionen abzuschalten.
    Informationen, welche der Einstellungen im Bootloader daf&uuml;r
    verantwortlich sind, finden Sie in der Onlinehilfe zu
    &man.acpi.4;</para>

  <para>ACPI braucht zur korrekten Funktion die Differentiated System
    Descriptor Table (DSDT), die vom BIOS bereitgestellt wird.  Einige
    Systemen haben fehlerhafte oder unvollst&auml;ndige DSDTs, daher
    kann ACPI auf diesen Maschinen nicht korrekt funktionieren.
    Korrigierte DSDTs f&uuml;r einige Maschinen sind im Bereich <ulink
    url="http://acpi.sourceforge.net/dsdt/index.php">DSDT</ulink> der
    Webseiten des <ulink
    url="http://acpi.sourceforge.net/">ACPI4Linux</ulink> Projekts
    verf&uuml;gbar.  &os; kann diese DSDTs an Stelle der vom BIOS
    bereitgestellten DSDT nutzen, weitere Informationen dazu finden
    Sie in der Onlinehilfe zu &man.acpi.4;</para>
</sect1>
