freebsd/freebsd-src/usr.sbin/mrouted/map-mbone.8
.Dd March 31, 1995
.Dt MAP-MBONE 8
.Os FreeBSD 2.0
.Sh NAME
.Nm map-mbone
.Nd multicast connection mapper
.Sh SYNOPSIS
.Nm map-mbone
.Op Fl d Ar debuglevel
.Op Fl f
.Op Fl g
.Op Fl n
.Op Fl r Ar retries
.Op Fl t Ar timeout
.Op Ar router
.Sh DESCRIPTION
.Nm map-mbone
attempts to display all multicast routers that are reachable from the multicast
router
.Ar router .
If not specified on the command line, the default
.Ar router
is the local host.
.Nm
traverses neighboring multicast routers by sending the 
.Dv ASK_NEIGHBORS 
.Tn IGMP
message to each router. If this multicast router responds, the version
number and a list of their neighboring multicast router addresses is
part of that response. If the responding router has recent multicast
version number, then
.Nm
requests additional information such as metrics, thresholds, and flags from the
multicast router. For each new occurrence of neighboring multicast router in 
the reply and provided the flooding option has been selected, then 
.Nm
asks each of this multicast router for a list of neighbors. This search
for unique routers will continue until no new neighboring multicast routers
are reported.
.Pp
The options supported by
.Nm
are as follows:
.Bl -tag -width XXXdebuglevel
.It Fl d Ar debuglevel
This sets the debug level to
.Ar debuglevel .
When the debug level is greater than the default value of 0,
additional debugging messages are printed. Regardless of the debug
level, an error condition, will always write an error message and will
cause
.I map-mbone
to terminate.
Non-zero debug levels have the following effects:
.Bl -tag -width "level 3"
.It level 1
packet warnings are printed to stderr.
.It level 2
all level 1 messages plus notifications down networks are printed to stderr.
.It level 3
all level 2 messages plus notifications of all packet
timeouts are printed to stderr.
.El
.It Fl f
This option enables flooding. Flooding allows
.Nm
to perform recursive search
of neighboring multicast routers and is enabled by default when an
initial
.Ar router
is not specified.
.It Fl g
This option enables graphing in GraphEd format.
.It Fl n
This option disables the DNS lookup for the multicast routers' names.
.It Fl r Ar retries
This options sets the neighbor query retry limit to
.Ar retries .
The default is one retry.
.It Fl t Ar timeout
This option sets the number of seconds to wait for a neighbor query
reply before retrying. The default timeout is two seconds.
.Sh RESTRICTIONS
.Nm
must be run as `root'.
.Sh SEE ALSO
.Xr mrinfo 8 ,
.Xr mrouted 8 ,
.Xr mtrace 8
.Sh AUTHOR
Pavel Curtis
.Sh HISTORY
A
.Nm
command first appeared in
.Tn FreeBSD
2.0.
