freebsd/freebsd-src/usr.sbin/mrouted/mrinfo.8
.Dd March 31, 1995
.Dt MRINFO 8
.Sh NAME
.Nm mrinfo
.Nd displays configuration info from a multicast router
.Sh SYNOPSIS
.Nm mrinfo
.Op Fl d Ar debuglevel
.Op Fl r Ar retries
.Op Fl t Ar timeout
.Ar router
.Sh DESCRIPTION
The
.Nm mrinfo
program attempts to display the configuration information from the
multicast router
.Ar router .
.Pp
.Nm
uses the 
.Dv ASK_NEIGHBORS
.Tn IGMP
message to the specified multicast router. If this multicast router
responds, the version number and a list of their neighboring multicast
router addresses is part of that response. If the responding router
has a recent multicast version number, then
.Nm mrinfo
requests additional information such as metrics, thresholds, and flags
from the multicast router. Once the specified multicast router
responds, the configuration is displayed to the standard output.
.Pp
The
.Nm
program accepts the following options:
.Bl -tag -width XXXdebuglevel
.It Fl d Ar debuglevel
This option sets the debug level to
.Ar debuglevel .
When the debug level is greater than the default value of 0, addition
debugging messages are printed. Regardless of the debug level, an
error condition, will always write an error message and will cause
.Nm
to terminate.
Non-zero debug levels have the following effects:
.Bl -tag -width "level 3"
.It level 1
packet warnings are printed to stderr.
.It level 2
all level 1 messages plus notifications down networks are printed to stderr.
.It level 3
all level 2 messages plus notifications of all packet
timeouts are printed to stderr.
.El
.It Fl r Ar retries
This option sets the neighbor query retry limit to
.Ar retries .
The default is three retries.
.It Fl t Ar timeout
This sets the number of seconds to wait for a neighbor query
reply. The default timeout is four seconds.
.El
.Sh SAMPLE OUTPUT
.Bd -literal
# mrinfo mbone.phony.dom.net
127.148.176.10 (mbone.phony.dom.net) [version 3.3]:
 127.148.176.10 -> 0.0.0.0 (?) [1/1/querier]
 127.148.176.10 -> 127.0.8.4 (mbone2.phony.dom.net) [1/45/tunnel]
 127.148.176.10 -> 105.1.41.9 (momoney.com) [1/32/tunnel/down]
 127.148.176.10 -> 143.192.152.119 (mbone.dipu.edu) [1/32/tunnel]
.Ed
.Pp
For each neighbor of the queried multicast router, the IP of the
queried router is displayed, followed by the IP and name of the
neighbor. In square brackets the metric (cost of connection) and the
threshold (minimum TTL to forward) are displayed. If the queried multicast
router has a newer version number, the type (tunnel, srcrt) and status
(disabled, down) of the connection are also displayed.
.Sh RESTRICTIONS
.Nm
must be run as `root'.
.Sh SEE ALSO
.Xr map-mbone 8 ,
.Xr mrouted 8 ,
.Xr mtrace 8
.Sh AUTHOR
Pavel Curtis
.Sh HISTORY
An
.Nm
command first appeared in
.Tn FreeBSD
2.0.
