freebsd/freebsd-src/sbin/geom/class/stripe/gstripe.8
.\" Copyright (c) 2004 Pawel Jakub Dawidek <pjd@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 21, 2004
.Dt GSTRIPE 8
.Os
.Sh NAME
.Nm gstripe
.Nd "control utility for striped devices"
.Sh SYNOPSIS
.Nm
.Cm create
.Op Fl v
.Op Fl s Ar stripesize
.Ar name
.Ar dev1
.Ar dev2
.Op Ar dev3 Op Ar ...
.Nm
.Cm label
.Op Fl v
.Op Fl s Ar stripesize
.Ar name
.Ar dev1
.Ar dev2
.Op Ar dev3 Op Ar ...
.Nm
.Cm destroy
.Op Fl fv
.Ar name
.Op Ar name2 Op Ar ...
.Nm
.Cm clear
.Op Fl v
.Ar dev1
.Op Ar dev2 Op Ar ...
.Nm
.Cm list
.Nm
.Cm load
.Op Fl v
.Nm
.Cm unload
.Op Fl v
.Sh DESCRIPTION
The
.Nm
utility is used for setting up stripe on two or more disks.
The striped device can be configured using two different methods:
.Dq manual
or
.Dq automatic .
When using the
.Dq manual
method, no metadata are stored on the devices, so the striped
device has to be configured by hand every time it is needed.
The
.Dq automatic
method use on-disk metadata to detect devices.
Once devices are labeled, they will be automatically detected and
configured.
.Pp
The first argument to
.Nm
indicates an action to be performed:
.Bl -tag -width ".Cm destroy"
.It Cm create
Setup a striped device from the given devices with specified
.Ar name .
This is the
.Dq manual
method.
The kernel module
.Pa geom_stripe.ko
will be loaded if it is not loaded already.
.It Cm label
Setup a striped device from the given devices with the specified
.Ar name .
This is the
.Dq automatic
method, where metadata are stored in every device's last sector.
The kernel module
.Pa geom_stripe.ko
will be loaded if it is not loaded already.
.It Cm destroy
Turn off existing striped device by its
.Ar name .
.It Cm clear
Clear metadata on the given devices.
.It Cm list
List currently configured devices.
.It Cm load
Load
.Pa geom_stripe.ko
kernel module.
.It Cm unload
Unload
.Pa geom_stripe.ko
kernel module.
.El
.Pp
Additional options:
.Bl -tag -width ".Fl s Ar stripesize"
.It Fl f
Force the removal of the specified striped device.
.It Fl s Ar stripesize
Specifies size of stripe block.
.It Fl v
Be more verbose.
.El
.Sh EXAMPLES
The following example shows how to setup striped device from four disks
for automatic configuration, create file system on it, and mount it:
.Bd -literal -offset indent
gstripe label -v -s 65536 data /dev/da0 /dev/da1 /dev/da2 /dev/da3
newfs /dev/data.stripe
mount /dev/data.stripe /mnt
.Ed
.Sh DIAGNOSTICS
Exit status is 0 on success, and 1 if the command fails.
.Sh SEE ALSO
.Xr geom 4 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr vinum 8
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.3 .
.Sh AUTHORS
.An Pawel Jakub Dawidek Aq pjd@FreeBSD.org
