freebsd/freebsd-src/sbin/devd/devd.8
.\"
.\" Copyright (c) 2002 M. Warner Losh.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 17, 2002
.Dt DEVD 8
.Os
.Sh NAME
.Nm devd
.Nd "Device state change daemon"
.Sh SYNOPSIS
.Nm
.Op Fl d
.Sh DESCRIPTION
The
.Nm
daemon provides a way to have userland programs run when certain
kernel events happen.
.Pp
The following options are accepted.
.Bl -tag -width indent
.It Fl d
Enable debugging messages and run in the foreground instead of
becoming a daemon.
.El
.Sh IMPLEMENTATION NOTES
.Nm 
is a system daemon.
It runs in the background all the time.
When ever a device is added to or removed from the device tree, devd
will cause a certain action to take place.
In addition, when a device that is not matched enters the system, devd
will also perform an action.
.Pp
.Nm 
hooks into the
.Xr devctl 4
device driver.
This device driver has hooks into the device configuration system.
When nodes are added or deleted from the tree, this device will
deliver information about the even to
.Nm .
Once 
.Nm 
has parsed the message, it will search its action list for that kind
of event, and perform the action with the highest matching value.
For most mundane uses, the default handlers are adequate.
However, for more advanced users, the power is present to tweak every
aspect of what happens.
.Pp
.Nm reads /etc/devd.conf, and that drives the rest of the process.
While the format of this file is described in 
.Xr devd.conf 5 
some basics are covered here.
In the options section, one can define multiple directories to search
for config files.
All files in each of these directories are parsed.
These files are intended to be installed by third party vendors that
wish to hook into the devd system without modifying the user's other
config files.
.Sh SEE ALSO
.Xr devctl 4 ,
.Xr devd.conf 5
.Sh AUTHORS
.An M. Warner Losh
