freebsd/freebsd-src/sbin/growfs/growfs.8
.\" Copyright (c) 2000 Christoph Herrmann, Thomas-Henning von Kamptz
.\" Copyright (c) 1980, 1989, 1993 The Regents of the University of California.
.\" All rights reserved.
.\" 
.\" This code is derived from software contributed to Berkeley by
.\" Christoph Herrmann and Thomas-Henning von Kamptz, Munich and Frankfurt.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors, as well as Christoph
.\"      Herrmann and Thomas-Henning von Kamptz.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $TSHeader: src/sbin/growfs/growfs.8,v 1.2 2000/12/09 15:12:33 tomsoft Exp $
.\" $FreeBSD$
.\"
.Dd September 8, 2000
.Dt GROWFS 8
.Os BSD 4.4
.Sh NAME
.Nm growfs
.Nd grow size of an existing ufs file system
.Sh SYNOPSIS
.Nm growfs
.Op Fl Ny
.Op Fl s Ar size
.Ar special
.Sh DESCRIPTION
.Nm Growfs
extends the 
.Xr newfs 8
program.
Before running 
.Nm
the disk must be labeled to a bigger size using 
.Xr disklabel 8 .
If you are using volumes you must grow them using 
.Xr vinum 8 .
.Nm Growfs
extends the size of the file system on the specified special file.
Currently
.Nm 
can only grow unmounted file systems. Do not try growing an mounted file system,
your system may panic and you will not be able to use the file system any longer.
Most of the options you have used with
.Xr newfs 8
once can not be changed. In fact you can only increase the size of the file
system. Use 
.Xr tunefs 8
for other changes.
Typically the defaults are reasonable, however
.Nm
has some options to allow the defaults to be overridden.
.\".Pp
.Bl -tag -width indent
.It Fl N
Cause the new file system parameters to be printed out
without realy growing the file system.
.It Fl y
.Dq Expert mode
Normally 
.Nm 
will ask you, if you took a backup of your data before und will do some tests
if 
.Ar special 
is currently mounted or if there are any active snapshots on the filesystem
specified. This will be supressed. So use this option with care!
.It Fl s Ar size
The size of the file system after growing in sectors.  This value defaults
to the size of the raw partition specified in
.Ar special 
(in other words,
.Nm
will grow the file system to the size of the entire partition).
.El
.Sh EXAMPLES
.Pp
.Dl growfs -s 4194304 /dev/vinum/testvol
.Pp
will grow /dev/vinum/testvol up to 2GB if there is enough space in 
/dev/vinum/testvol .
.Sh BUGS
In some cases on
.Bx Free
3.x it is possible, that
.Nm
did not recognize exactly, if the file system is mounted or not and 
exits with an error message, then use 
.Nm
-y if you are sure, that the file system is not mounted.
It is also recommended to always use
.Nm fsck
after growing just to be on the safe side.
.Pp
Pay attention, as in certain cases we have to change the location of an file
system internal structure which had never been moved before. Almost everything
works perfect with this relocated structure except the
.Nm fsck(8)
utility. There is a patch available for
.Nm fsck(8) .
For growing above certain limits it is essential to have some free blocks
available in the first cylinder group. To avoid the relocation of that
structure it is currently recommended to use
.Nm ffsinfo -c 0
on the first cylinder group and check that
.Nm nbfree
in the CYLINDER SUMMARY (internal cs) of the CYLINDER GROUP
.Nm cgr0
has enough blocks. As a rule of thumb for default filesystem parameters a block
is needed for every 2 GB of total filesystem size.
.Pp
.Sh SEE ALSO
.Xr vinum 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr newfs 8 ,
.Xr tunefs 8 , 
.Xr dumpfs 8 ,
.Xr ffsinfo 8 
.\".Rs
.\".Re
.Sh AUTHORS
.An Christoph Herrmann Aq chm@FreeBSD.ORG
.An Thomas-Henning von Kamptz Aq tomsoft@FreeBSD.ORG
.An The GROWFS team Aq growfs@Tomsoft.COM
.Sh HISTORY
The
.Nm
command first appeared first in
.Bx Free 
5.0.
