Repository: freebsd/freebsd-src
Catalog: opcodes/po/*.po
Languages: ro

source: branch operand unaligned
ro: ramurã operand nealiniatã

source: jump hint unaligned
ro: sugestie salt(jump) nealiniat

source: Illegal limm reference in last instruction!
ro: referinþã limm ilegalã în ultima instrucþiune!

source: <illegal precision>
ro: <precizie ilegalã>

source: Unrecognised register name set: %s
ro: Setare nume registru necunoscutã: %s

source: Unrecognised disassembler option: %s
ro: Opþiune dezasamblor necunsocutã: %s

source: The following ARM specific disassembler options are supported for use with the -M switch:
ro: Opþiunile ARM de dezasamblor specifice urmãtoare sunt permise cu folosirea switch-ului -M:

source: undefined
ro: nedefinit(ã)

source: Internal disassembler error
ro: Eroare internã de dezasamblor

source: unknown constraint `%c'
ro: constrângere necunoscutã `%c'

source: operand out of range (%ld not between %ld and %ld)
ro: operand în afara intervalului (%ld nu este între %ld ºi %ld)

source: operand out of range (%lu not between %lu and %lu)
ro: operand în afara intervalului (%lu nu este între %lu ºi %lu)

source: <unknown register %d>
ro: <registru necunoscut %d>

source: Unknown error %d
ro: Eroare necunoscutã %d

source: Address 0x%x is out of bounds.
ro: Adresa 0x%x este peste limite (out of bounds).

source: Unrecognized field %d while parsing.
ro: Câmp necunoscut %d în analizã(parsing).

source: missing mnemonic in syntax string
ro: mnemonicã lipsã în sintaxã

source: unrecognized instruction
ro: instrucþiune necunoscutã

source: syntax error (expected char `%c', found `%c')
ro: eroare de sintaxã ( se aºtepta %c', s-a primit `%c')

source: syntax error (expected char `%c', found end of instruction)
ro: eroare de sintaxã (s-a aºteptat char `%c' s-a primit sfârºit de instrucþiune)

source: junk at end of line
ro: resturi(junk) la sfârºit de linie

source: unrecognized form of instruction
ro: formã de instrucþiune necunoscutã

source: bad instruction `%.50s...'
ro: instrucþiune greºitã ``%.50s...'

source: bad instruction `%.50s'
ro: instrucþiune greºitã `%.50s'

source: *unknown*
ro: *necunoscut(ã)*

source: Unrecognized field %d while printing insn.
ro: Câmp necunoscut %d în tipãrire insn.

source: operand out of range (%ld not between %ld and %lu)
ro: operand în afara limitelor (%ld nu este între %ld ºi %lu)

source: operand out of range (%lu not between 0 and %lu)
ro: operand în afara limitelor (%lu nu este între 0 ºi %lu)

source: Unrecognized field %d while building insn.
ro: Câmp necunoscut %d în construire(building) insn.

source: Unrecognized field %d while decoding insn.
ro: Câmp necunoscut %d în decodare insn.

source: Unrecognized field %d while getting int operand.
ro: Câmp necunoscut %d în preluare operand int.

source: Unrecognized field %d while getting vma operand.
ro: Câmp necunoscut %d în preluare operand vma.

source: Unrecognized field %d while setting int operand.
ro: Câmp necunoscut %d în setare operand int.

source: Unrecognized field %d while setting vma operand.
ro: Câmp necunoscut %d în setare operand vma.

source: register number must be even
ro: numãrul registrului trebuie sã fie par

source: Don't understand 0x%x
ro: Nu înþeleg 0x%x

source: can't cope with insert %d
ro: nu fac faþã la inserarea %d

source: %02x *unknown*
ro: %02x *necunoscut(ã)*

source: <internal disassembler error>
ro: <eroare internã de dezasamblor>

source: %s: Error:
ro: %s: Eroare:

source: %s: Warning:
ro: %s: Avertisment:

source: multiple note %s not handled
ro: notele multiple %s nerezolvabile(handled)

source: can't find ia64-ic.tbl for reading
ro: nu pot gãsi ia64-ic.tbl pentru citire

source: can't find %s for reading
ro: nu pot gãsi %s pentru citire

source: most recent format '%s' appears more restrictive than '%s'
ro: cel mai recent format %s pare mai restrictiv decât '%s'

source: overlapping field %s->%s
ro: câmp suprapus %s -> %s

source: overwriting note %d with note %d (IC:%s)
ro: suprascriere nota %d cu nota %d (IC:%s)

source: don't know how to specify %% dependency %s
ro: nu ºtiu cum se specificã dependinþele %% %s

source: Don't know how to specify # dependency %s
ro: nu ºtiu cum se specificã dependinþele # %s

source: IC:%s [%s] has no terminals or sub-classes
ro: IC:%s [%s] nu are terminale sau sublclase

source: IC:%s has no terminals or sub-classes
ro: IC:%s nu are terminale sau subclase

source: no insns mapped directly to terminal IC %s [%s]
ro: nici un insns mapat direct la terminalul IC %s [%s]

source: no insns mapped directly to terminal IC %s
ro: nici un insns mapat direct la terminalul IC %s

source: class %s is defined but not used
ro: clasa %s este definitã dar nefolositã

source: Warning: rsrc %s (%s) has no chks%s
ro: Avertisment: rsrc %s (%s) nu are chks%s

source: rsrc %s (%s) has no regs
ro: rsrc %s (%s) nu areo regs

source: IC note %d in opcode %s (IC:%s) conflicts with resource %s note %d
ro: Nota IC %d din opcode %s (IC:%s) e în conflict cu resursa %s nota %d

source: IC note %d for opcode %s (IC:%s) conflicts with resource %s note %d
ro: Nota IC %d pentru opcode %s (IC:%s) e în conflict cu resursa %s nota %d

source: opcode %s has no class (ops %d %d %d)
ro: opcode %s nu are clasã (ops %d %d %d)

source: unable to change directory to "%s", errno = %s
ro: nu am putut schimba directorul în "%s", errno = %s

source: W keyword invalid in FR operand slot.
ro: Cuvânt cheie W invalidv în slotul operand FR.

source: offset(IP) is not a valid form
ro: offsetul(IP) nu are formã validã

source: (DP) offset out of range.
ro: (DP) offset în afara intervalului

source: (SP) offset out of range.
ro: (SP) offset în afara intervalului

source: illegal use of parentheses
ro: Folosire ilegalã de paranteze

source: operand out of range (not between 1 and 255)
ro: operand în afara limitelor (nu este între 0 ºi 255)

source: parse_addr16: invalid opindex.
ro: parse_addr16: opindex invalid.

source: Byte address required. - must be even.
ro: Se necesitã adresã byte. -trebuie sã fie parã (even).

source: cgen_parse_address returned a symbol. Literal required.
ro: cgen_parse_address a returnat un simbol. Se necesitã literal.

source: %operator operand is not a symbol
ro: %operator operandulk nu este un simbol

source: Attempt to find bit index of 0
ro: Se încearcã gãsirea bitului index de 0

source: immediate value cannot be register
ro: valoarea directã(immediate) nu poate fi înregistratã

source: immediate value out of range
ro: valoare directã(immediate) în afara intervalului

source: 21-bit offset out of range
ro: offsetul 21 bit în afara intervalului

source: missing `)'
ro: `)' lipsã

source: unknown 0x%02x
ro: necunoscut(ã) 0x%02x

source: unknown 0x%04lx
ro: necunoscut(ã) 0x%04lx

source: unknown 0x%04x
ro: necunoscut(ã) 0x%04x

source: <internal error in opcode table: %s %s>
ro: <eroare internã în tabel opcode: %s %s>

source: <function code %d>
ro: <cod funcþie %d>

source: # <dis error: %08x>
ro: # <eroare dez: %08x>

source: # internal error, incomplete extension sequence (+)
ro: # eroare internã, secvenþã incompletã de extensie (+)

source: # internal error, undefined extension sequence (+%c)
ro: # eroare internã, secvenþã de extensie nedefinitã (+%c)

source: # internal error, undefined modifier(%c)
ro: # eroare internã, modificator nedefinit(%c)

source: # internal disassembler error, unrecognised modifier (%c)
ro: # eroare internã de dezasamblor, modificator necunoscut (%c)

source: The following MIPS specific disassembler options are supported for use with the -M switch (multiple options should be separated by commas):
ro: Opþiunile MIPS de dezasamblor specifice urmãtoare sunt permise cu folosirea switch-ului -M (opþiunile multiple trebuie separate prin virgulã:

source: gpr-names=ABI Print GPR names according to specified ABI. Default: based on binary being disassembled.
ro: gpr-names=ABI Afiºeazã numele GPR potrivit ABI specificat. Implicit: bazat pe binar ce este dezasamblat.

source: fpr-names=ABI Print FPR names according to specified ABI. Default: numeric.
ro: fpr-names=ABI Afiºeazã numele FPR potrivit ABI specificat. Implicit: numeric.

source: cp0-names=ARCH Print CP0 register names according to specified architecture. Default: based on binary being disassembled.
ro: cp0-names=ARCH Afiºeazã numele de regiºtri CP0 potrivit arhitecturii specifice. Implicit: bazat pe binar în dezasamblare.

source: hwr-names=ARCH Print HWR names according to specified architecture. Default: based on binary being disassembled.
ro: hwr-names=ARCH Afiºeazã numele HWR potrivit arhitecturii specifice. Implicit: bazat pe binar în dezasamblare.

source: reg-names=ABI Print GPR and FPR names according to specified ABI.
ro: reg-names=ABI Afiºeazã numele GPR ºi FPR potriviti ABI specificat.

source: reg-names=ARCH Print CP0 register and HWR names according to specified architecture.
ro: reg-names=ARCH Afiºeazã regiºtrii CP0 ºi numele HWR potrivit arhitecturii specifice.

source: For the options above, the following values are supported for "ABI":
ro: Pentru opþiunile de mai sus, urmatoarele valori sunt suportate pentru "ABI":

source: For the options above, The following values are supported for "ARCH":
ro: Pentru opþiunile de mai sus, urmatoarele valori sunt suportate pentru "ARCH":

source: Bad case %d (%s) in %s:%d
ro: Caz greºit %d (%s) in %s: %d

source: Internal: Non-debugged code (test-case missing): %s:%d
ro: Intern: cod non debugged (caz test lipsã) %s:%d

source: (unknown)
ro: (necunoscut)

source: *unknown operands type: %d*
ro: *tip necunoscut de operanzi: %d*

source: $<undefined>
ro: $<nedefinit>

source: invalid conditional option
ro: opþiune condiþionalã invalidã

source: attempt to set y bit when using + or - modifier
ro: se încearcã setarea bitului y în folosirea modificatorilor + sau -

source: offset not a multiple of 16
ro: offsetul nu este multiplu de 16

source: offset not a multiple of 2
ro: offsetul nu este multiplu de 2

source: offset greater than 62
ro: offset mai mare decât 62

source: offset not a multiple of 4
ro: offsetul nu este multiplu de 4

source: offset greater than 124
ro: offset mai mare decât 124

source: offset not a multiple of 8
ro: offsetul nu este multiplu de 8

source: offset greater than 248
ro: offset mai mare de 248

source: offset not between -2048 and 2047
ro: offsetul nu este între -2048 ºi 2047

source: offset not between -8192 and 8191
ro: offsetul nu este între -8192 ºi 8191

source: ignoring invalid mfcr mask
ro: se ignorã mascã mfcr invalidã

source: ignoring least significant bits in branch offset
ro: se ignorã cei mai puþin semnificanþi biþi în offsetul ramurii(branch)

source: illegal bitmask
ro: bitmask ilegal

source: value out of range
ro: valoare în afara intervalului

source: index register in load range
ro: registru index în interval de încãrcare

source: source and target register operands must be different
ro: operanzii regiºtri sursã ºi destinaþie trebuie sã fie diferiþi

source: invalid register operand when updating
ro: registru de operand invalid în updatare

source: target register operand must be even
ro: operandul registru destinaþie trebuie sã fie par

source: source register operand must be even
ro: operandul registru sursã trebuie sã fie par

source: unknown
ro: necunoscut(ã)

source: Internal error: bad sparc-opcode.h: "%s", %#.8lx, %#.8lx
ro: Eroare internã: opcode.h sparc greºit: "%s", %#.8lx, %#.8lx

source: Internal error: bad sparc-opcode.h: "%s", %#.8lx, %#.8lx
ro: Eroare internã: opcode.h sparc greºit: "%s", %#.8lx, %#.8lx

source: Internal error: bad sparc-opcode.h: "%s" == "%s"
ro: Eroare internã: opcode.h sparc greºit: "%s" == "%s"

source: unknown operand shift: %x
ro: schimbare(shift) de oberand necunoscutã: %x

source: unknown pop reg: %d
ro: pop reg necunoscut: %d

source: displacement value is not in range and is not aligned
ro: valoarea deplasãrii în afara intervalului ºi nealiniatã

source: displacement value is out of range
ro: deplasare

source: displacement value is not aligned
ro: valoarea deplasãrii nu este aliniatã

source: immediate value is out of range
ro: valoare directã(immediate) în afara intervalului

source: branch value not in range and to odd offset
ro: valoare ramurã(branch) în afara intervalului ºi la offset impar

source: branch value out of range
ro: valoare ramurã(branch) în afara intervalului

source: branch to odd offset
ro: ramurã(branch) la offset impar

source: branch value not in range and to an odd offset
ro: valoare ramurã(branch) în afara intervalului ºi la offset impar

source: invalid register for stack adjustment
ro: registru invalid pentru modificare stivã

source: immediate value not in range and not even
ro: valoare directã(immediate) în afara intervalului ºi imparã

source: immediate value must be even
ro: valoarea directã(immediate) trebuie sã fie parã

source: Bad register in preincrement
ro: Registru greºit în preincrementare

source: Bad register in postincrement
ro: Registru greºit în postincrementare

source: Bad register name
ro: Nume registru greºit

source: Label conflicts with register name
ro: Eticheta(label) se aflã în conflict cu numele de registru

source: Label conflicts with `Rx'
ro: Eticheta(label) se aflã în conflict cu `Rx'

source: Bad immediate expression
ro: Expresie directã(immediate) greºitã

source: No relocation for small immediate
ro: Nici o relocare pentru mai mic directã(immediate)

source: Small operand was not an immediate number
ro: Operandul redus nu a fost un numãr direct(immediate)

source: Operand is not a symbol
ro: Operandul nu este simbol

source: Syntax error: No trailing ')'
ro: Eroare de sintaxã:Nu existã ')'
