<!--
  $FreeBSD$
  $FreeBSDde: de-docproj/relnotes/de_DE.ISO8859-1/hardware/alpha/proc-alpha.sgml,v 1.23 2002/12/22 11:43:55 ue Exp $
  basiert auf: 1.51
-->

<sect1>
  <sect1info>
    <authorgroup>
      <author>
        <firstname>Wilko</firstname>

        <surname>Bulte</surname>

        <contrib>Gepflegt von </contrib>
      </author>
    </authorgroup>

    <authorgroup>
      <author>
        <firstname>Udo</firstname>

        <surname>Erdelhoff</surname>

        <contrib>&Uuml;bersetzt von </contrib>
      </author>
    </authorgroup>
  </sect1info>

  <title>Unterst&uuml;tzte Prozessoren und Mainboards</title>

  <para>Wir freuen uns &uuml;ber Erg&auml;nzungen, Korrekturen und
    konstruktive Kritik.  Informationen &uuml;ber Fehlverhalten von
    Systemen sind willkommen.</para>

  <sect2>
    <title>&Uuml;bersicht</title>

    <para>Dieses Dokument soll die erste Anlaufstelle f&uuml;r alle
      Anwender sein, die &os; auf einer Maschine mit Alpha-Prozessor
      benutzen wollen.  Ziel ist, Hintergrundinformationen &uuml;ber
      die diversen Varianten der Hardware zu geben.  Es ist nicht als 
      Ersatz f&uuml;r die Handb&uuml;cher der jeweiligen Systeme
      gedacht.  Die Informationen gliedern sich wie folgt:</para>

    <itemizedlist>
      <listitem>
        <para>Mindestanforderungen an die Hardware f&uuml;r den
          Betrieb von &os; auf einem Alpha System;</para>
      </listitem>

      <listitem>
        <para>n&auml;here Informationen zu den von &os;
          unterst&uuml;tzten Modellen/Mainboards;</para>
      </listitem>

      <listitem>
        <para>Hinweise zur Verwendung von Erweiterungskarten mit
          &os; inklusive Informationen zu plattformabh&auml;ngiger
          Hardware.
        </para>
      </listitem>
    </itemizedlist>

    <note>
      <para>Im Text wird je nach Lust und Laune auf DEC, Digital
        Equipment Corporation und Compaq verwiesen.  Da Compaq die
        Firma Digital Equipment aufgekauft hat, d&uuml;rfte man
        eigentlich nur noch auf Compaq verweisen.  Allerdings findet
        man diesen Namens-Mix &uuml;berall, darum haben wir uns die
        Arbeit erspart.</para>
    </note>

    <note>
      <para>SRM Befehle werden in
        <userinput>GROSSBUCHSTABEN</userinput> dargestellt.  SRM
        akzeptiert auch Kleinbuchstaben, die Verwendung von
        Gro&szlig;buchstaben dient dazu, Befehle f&uuml;r den Leser
        hervorzuheben.</para>
    </note>

    <note>
      <para>Compaq stellt auf seinen Webseiten Informationen f&uuml;r
        Linux-Entwickler bereit. Auch f&uuml;r &os; Anwender sind diese
        durchaus n&uuml;tzlich. Werfen Sie einmal einen Blick auf <ulink
        url="http://www.support.compaq.com/alpha-tools/">Linux Alpha
        Power tools</ulink>.</para>
    </note>
  </sect2>

  <sect2>
    <title>Was braucht man im Allgemeinen um &os; auf einer Alpha zu
      nutzen?</title>

    <para>Logischerweise eine Alpha, die von &os; unterst&uuml;tzt
      wird.  Alpha Maschinen sind KEINE PCs.  Es gibt erhebliche
      Unterschiede zwischen den einzelnen Chips&auml;tzen und
      Mainboards.  Der Kernel mu&szlig; also die genauen Details
      einer Maschine kennen, damit er auf ihr laufen kann.  Wenn Sie
      einfach irgendeinen <filename>GENERIC</filename> Kernel auf Ihre
      Hardware loslassen, wird das in der Regel b&ouml;se in die Hose
      gehen.</para>

    <para>Wenn Sie planen, eine Maschine mit &os; zu nutzen, sollten
      Sie darauf achten, da&szlig; die SRM Firmware Konsole installiert
      ist, bzw. das diese Firmware f&uuml;r Ihre Maschine verf&uuml;gbar
      ist.  Wenn Ihr System noch nicht von &os; unterst&uuml;tzt wird,
      kann sich das durchaus irgendwann einmal &auml;ndern; allerdings
      nur, wenn SRM f&uuml;r dieses System verf&uuml;gbar ist.</para>

    <para>Wenn auf Ihrer Maschine die Firmware f&uuml;r die ARC oder
      AlphaBIOS Konsole installiert ist, handelt es sich um ein
      System, welches auf den Betrieb mit WindowsNT ausgelegt ist.  Bei
      einigen Systemen ist die Firmware f&uuml;r die SRM Konsole im
      System-ROM verf&uuml;gbar und Sie m&uuml;ssen diese nur
      aktivieren (&uuml;ber das ARC oder AlphaBIOS Men&uuml;).  Bei
      anderen System werden Sie die ROMs mit der SRM Firmware neu
      flashen m&uuml;ssen.  Bei
      http://ftp.digital.com/pub/DEC/Alpha/firmware k&ouml;nnen Sie
      erfahren, welche Optionen f&uuml;r Ihr System verf&uuml;gbar
      sind.  Grundregel: Kein SRM bedeutet <emphasis>kein</emphasis>
      &os;  (und auch kein NetBSD, OpenBSD, Tru64 Unix oder OpenVMS).
      Nach dem Ende von WindowsNT/Alpha werden viele alte NT-Systeme
      auf dem Gebrauchtmarkt verkauft.  Diese sind mehr oder weniger
      wertlos, wenn die Firmware lediglich NT unterst&uuml;tzt.  Seien
      Sie also vorsichtig, wenn der Preis zu verlockend scheint.</para>

    <para>F&uuml;r diese Maschinen ist kein SRM verf&uuml;gbar:</para>

    <itemizedlist>
      <listitem>
        <para>Digital XL series</para>
      </listitem>

      <listitem>
        <para>Digital XLT series</para>
      </listitem>

      <listitem>
        <para>Samsung PC164UX (<quote>Ruffian</quote>)</para>
      </listitem>

      <listitem>
        <para>Samsung 164B</para>
      </listitem>
    </itemizedlist>

    <para>F&uuml;r diese Systeme ist zwar eine SRM Firmware verf&uuml;gbar,
      sie werden aber nicht von &os; unterst&uuml;tzt:</para>

    <itemizedlist>
      <listitem>
        <para>DECpc 150 (<quote>Jensen</quote>)</para>
      </listitem>

      <listitem>
        <para>DEC 2000/300 (<quote>Jensen</quote>)</para>
      </listitem>

      <listitem>
        <para>DEC 2000/500 (<quote>Culzean</quote>)</para>
      </listitem>

      <listitem>
        <para>AXPvme Familie (<quote>Medulla</quote>)</para>
      </listitem>
    </itemizedlist>

    <para>Um die Dinge noch weiter zu verkomplizieren, hat Digital
      zwei verschiedene Typen von Alpha-Maschinen verkauft: Die
      <quote>wei&szlig;en</quote> Alphas waren reine NT-Maschinen,
      w&auml;hrend auf den <quote>blauen</quote> Alphas OpenVMS und
      Digital Unix laufen.  Die Namen stammen von den Farben der
      Geh&auml;use: <quote>FrostWhite</quote> bzw.
      <quote>TopGunBlue</quote>.  Sie k&ouml;nnen zwar die Firmware
      f&uuml;r die SRM Konsole auf einer wei&szlig;en Alpha
      installieren, allerdings werden sich OpenVMS und Digital Unix
      weigern, auf einer solchen Maschine zu booten.  &os; kann seit
      4.0-RELEASE sowohl auf wei&szlig;en als auch auf blauen Alphas
      genutzt werden.  Um Fragen vorzubeugen: Digital verkaufte die
      wei&szlig;en Alphas zu einem anderen (lies: geringeren) Preis.</para>

    <para>Zusammen mit der SRM Firmware erhalten Sie den sogenannten OSF/1 PAL
      Code (OSF/1 war der urspr&uuml;ngliche Name f&uuml;r die
      von Digital angebotene Variante f&uuml;r die Alpha).  Der PAL
      Code ist eine Art Vermittler zwischen der Hardware und dem
      Betriebssystem.  Er benutzt die normalen CPU Befehle und einige
      besondere Anweisungen, die nur f&uuml;r die Nutzung durch den
      PAL gedacht sind.  PAL ist kein Microcode.  Die Firmware
      f&uuml;r die ARC Konsole enth&auml;lt einen anderen PAL
      Code der auf die Nutzung durch WinNT optimiert ist.  Er kann
      nicht von &os; (oder generell Unix bzw. OpenVMS) genutzt
      werden.  Um die &uuml;blichen Frage vorwegzunehmen:  Linux
      verf&uuml;gt &uuml;ber einen eigenen PAL Code und kann daher
      auch von ARC und AlphaBIOS.  Dieser Ansatz wird aus diversen
      Gr&uuml;nden von den *BSD-Machern abgelehnt.  Details
      w&uuml;rden an dieser Stelle zu weit f&uuml;hren, sind aber auf
      den Webseiten von &os; und NetBSD verf&uuml;gbar.</para>

    <para>Es gibt noch einen weiteren Fallstrick:  Sie brauchen einen
      Festplatten-Controller, der von der SRM Firmware erkannt wird,
      damit Sie davon booten k&ouml;nnen.  Welche Controller akzeptabel
      sind, h&auml;ngt leider stark vom jeweiligen System und der SRM
      Version ab.  F&uuml;r &auml;ltere PCI-basierte Systeme brauchen
      Sie entweder einen Kontroller mit einem NCR/Symbios 53C810 oder
      einem Qlogic 1020/1040.  Einige Maschinen verf&uuml;gen
      &uuml;ber einen integrierten On-Board Controller.  Neuere
      Maschinen und SRM Versionen unterst&uuml;tzen auch aktuellere
      SCSI-Chips bzw. Kontroller.  Details finden Sie in den System-spezifischen
      Informationen.  Hinweis: Wenn in diesem Dokument Symbios Chips 
      erw&auml;hnt werden, sind damit auch &auml;ltere Chips gemeint,
      die noch die Aufschrift NCR tragen.  NCR wurde vor einiger Zeit
      von Symbios aufgekauft.</para>

    <para>Diese Einschr&auml;nkung k&ouml;nnte Ihnen Probleme machen,
      wenn Sie ein ehemaliges WindowsNT-System haben.  ARC und
      AlphaBIOS kennen (und booten von) <emphasis>anderen</emphasis>
      Controllern als SRM.  Zum Beispiel k&ouml;nnen Sie mit
      ARC/AlphaBIOS von einem Adaptec 2940UW booten, w&auml;hrend das
      mit SRM (normalerweise) nicht geht.  Nur bei einigen neueren
      Maschinen ist es m&ouml;glich, von einem Adaptec zu booten.
      Details finden Sie in den System-spezifischen
      Informationen.</para>

    <para>Wenn Sie von einem Controller nicht booten k&ouml;nnen,
      k&ouml;nnen Sie ihn aber in der Regel f&uuml;r Festplatten
      nutzen, von denen nicht gebootet werden soll.  Die Unterschiede
      zwischen SRM und ARC k&ouml;nnen auch dazu f&uuml;hren,
      da&szlig; in Ihrem System IDE CDROMs oder Festplatten stecken
      (speziell bei ehemaligen WindowsNT-Systemen).  Es gibt einige
      SRM Versionen, die von IDE-Festplatten und -CDROMs booten
      k&ouml;nnen, Details dazu finden Sie wiederum in den 
      System-spezifischen Informationen.</para>

    <para>Seit &os; 4.0 k&ouml;nnen Sie von der Original-CD booten,
      bei &auml;lteren Versionen brauchen Sie hingegen die zwei
      Bootdisketten.</para>

    <para>Wenn Sie von einer Festplatte booten wollen, mu&szlig; die
      Root-Partition (Partition a) am Anfang (Offset 0) der Festplatte
      liegen.  Daher m&uuml;ssen Sie das Partitions-Men&uuml; des
      Installationsprogramms benutzen und als erstes Partition a
      mit Offset 0 als Root-Partition anlegen.  Danach k&ouml;nnen
      Sie den Rest der Festplatten frei aufteilen.  Wenn Sie sich
      nicht an diese Regel halten, werden Sie das System zwar
      problemlos installieren k&ouml;nnen, aber nicht von der
      gerade installieren Festplatte booten k&ouml;nnen.</para>

    <para>Wenn Sie keine Festplatte haben (oder wollen), k&ouml;nnen
      Sie das System auch &uuml;ber Ethernet booten.  Dazu brauchen
      Sie eine Netzwerkkarte bzw. Chips, der von der SRM Konsole
      unterst&uuml;tzt wird.  Das bedeutet in der Regel, da&szlig;
      Sie eine Netzwerkkarte mit einem 21040, 21142 oder 21143 Chip
      ben&ouml;tigen.  Wenn Sie eine &auml;ltere Maschine oder
      SRM Versionen haben, werden die 21142 / 21143 Fast Ethernet
      Chips m&ouml;glicherweise nicht erkannt.  In diesem Fall
      k&ouml;nnen Sie nur 10MBit Ethernet nutzen, wenn Sie &uuml;ber
      Ethernet booten wollen.  Wenn Ihre Karte nicht von DEC stammt,
      wird sie meistens auch funktionieren (aber nicht immer).  Intel
      hat vor einiger Zeit Digital Semiconductor aufgekauft und damit
      auch die Rechte an den 21x4x Chips erworben.  Wundern Sie sich
      also nicht, wenn Sie einen 21x4x mit Intel-Logo sehen.  Der SRM
      auf einigen neuen Modellen unterst&uuml;tzt &uuml;brigens auch
      die Intel 8255x Chips.</para>

    <para>Alphas mit SRM k&ouml;nnen sowohl eine graphische als auch
      eine serielle Konsole nutzen.  ARC kann zur Not auch eine
      serielle Konsole bedienen.  Wenn Sie ein Terminalprogramm
      mit einer 8Bit-f&auml;higen
      VT100-Emulation besitzen, sollten Sie in der Lage sein, von
      ARC/AlphaBIOS auf SRM umzuschalten, ohne erst eine Graphikkarte
      installieren zu m&uuml;ssen.</para>

    <para>Wenn Sie Ihre Alpha ohne Monitor und Grafikkarte betreiben
      wollen, m&uuml;ssen Sie lediglich Tastatur und Maus abziehen.
      Als Ersatz schlie&szlig;en Sie ein Terminal (bzw. einen PC mit
      Terminalprogramm) an den Anschlu&szlig; "serial port #1" an.
      Der SRM spricht 9600N81.  Diese Variante ist auch sehr praktisch
      f&uuml;r die Fehlerdiagnose.  Vorsicht: Einige/alle SRM geben
      auch am zweiten seriellen Anschlu&szlig; eine
      Eingabeaufforderung aus.  Der Kernel wird allerdings nur den
      ersten Anschlu&szlig; f&uuml;r seine Ausgaben und seine Konsole
      nutzen.  <emphasis>Dieses Verhalten kann zu massiver Verwirrung
      f&uuml;hren.</emphasis></para>

    <para>Die meisten PCI-basierten Alphas k&ouml;nnen normale
      VGA-Karten f&uuml;r PCs nutzen.  Der SRM ist intelligent genug,
      um diese Karten anzusprechen.  Allerdings bedeutet dies nicht,
      da&szlig; jede beliebige PCI VGA-Karte in einer Alpha
      funktioniert.  Die S3 Trio64, Mach64, und Matrox Millennium
      funktionieren in der Regel, auch alte ET4000 funktionieren.
      Fragen Sie lieber nach, bevor Sie Geld ausgeben.</para>

    <para>Die meisten anderen PCI-Karten aus der PC-Welt werden auch
      von &os; auf PCI-basierten Alpha-Maschinen unterst&uuml;tzt.
      Die aktuellsten Informationen zu diesem Thema finden Sie in der
      Datei <filename>/sys/alpha/conf/GENERIC</filename>.  Wenn auf
      der von Ihnen genutzten PCI-Karte eine PCI-Bridge ist, sollten
      Sie die spezifischen Informationen zum jeweiligen System
      beachten.  In einigen F&auml;llen k&ouml;nnen PCI-Karten
      Probleme verursachen, wenn sie die PCI-Parity nicht richtig
      implementieren.  Dies kann zu Abst&uuml;rzen des Systems
      f&uuml;hren.  Sie k&ouml;nnen die &Uuml;berpr&uuml;fung der PCI-Parity
      mit dem folgenden SRM Kommando abschalten:</para>

    <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET PCI_PARITY OFF</userinput></screen>

    <para>Dies ist kein Fehler in &os;, alle auf der Alpha
      genutzten Betriebssysteme ben&ouml;tigen diesen <quote>Trick</quote>.</para>

    <para>Wenn Ihr System (auch) EISA-Steckpl&auml;tze enth&auml;lt, m&uuml;ssen
      Sie, nachdem Sie eine EISA-Karte eingebaut oder die Firmware
      der Konsole aktualisiert haben, das EISA Configuration Utility
      (ECU) starten.</para>

    <para>Es gibt verschiedene Version der Alpha CPU.  Die erste
      Version war der 21064.  Er wurde in einem MOS4 genannten
      Verfahren hergestellt, die Chips haben den Spitznamen EV4.
      Neuere CPUs hei&szlig;en 21164, 21264, usw.  Sie werden auch
      als EV4S, EV45, EV5, EV56, EV6, EV67, EV68 bezeichnet.  Die
      EVs mit zwei Ziffern kennzeichnen verbesserte Versionen.  Zum
      Beispiel verf&uuml;gt der EV45 im Vergleich zu seinem Vorg&auml;nger,
      der EV4 &uuml;ber eine verbesserte FPU sowie &uuml;ber einen 16 KByte I&amp;D Cache
      on-chip.  Faustregel:  Je gr&ouml;&szlig;er die erste Ziffer nach
      dem <quote>EV</quote> ist, desto besser ist der Chip (lies:
      schneller / moderner).</para>

    <para>In Punkto Speicher sollten Sie auf jeden Fall mindestens 32
      MByte einsetzen.  Es ist zwar m&ouml;glich, &os; auch auf
      einem System mit nur 16 MByte zu nutzen, aber dabei kommt keine
      Freude auf.  Die zur Compilierung des Kernels ben&ouml;tigte
      Zeit halbierte sich nach dem Ausbau auf 32 MByte.  Bitte
      beachten Sie, da&szlig; die SRM Konsole 2 MByte des
      Systemspeichers nutzt (und auch beh&auml;lt).  Wenn Sie ernsthaft
      mit Ihrem System arbeiten wollen, sollte es mindestens 64 MByte
      Speicher besitzen.</para>

    <para>Wo wir gerade beim Thema sind:  Achten Sie sehr genau
      darauf, welche Art von Speicher Ihr System benutzt.  Es gibt
      viele verschiedene Konfigurationen und Einschr&auml;nkungen
      f&uuml;r die unterschiedlichen Systeme.</para>

    <para>Zum Abschlu&szlig;:  Der oben stehende Text d&uuml;rfte auf
      einen Einsteiger etwas abschreckend wirken.  Lassen Sie sich
      aber nicht abhalten.  Wenn Sie noch Fragen haben, stellen Sie
      diese ruhig.</para>
  </sect2>

  <sect2>
    <title>Spezifische Informationen f&uuml;r einzelne Systeme</title>

    <para>Im Rest dieses Kapitels finden Sie eine &Uuml;bersicht
      &uuml;ber alle Systeme, auf denen &os; genutzt werden kann.
      Diese Liste wird l&auml;nger werden, ein Blick in
      <filename>/sys/alpha/conf/GENERIC</filename> lohnt sich.</para>

    <para>Bei Alpha-Systemen wird oft nur der Codename aus dem
      Entwicklungsprojekt benutzt, um eine Maschine zu identifizieren.
      Soweit bekannt, stehen die Namen in Klammern hinter dem
      offiziellen Namen.</para>

    <sect3>
      <title>AXPpci33 (<quote>NoName</quote>)</title>

      <para>Bei der NoName handelt es sich um ein Mainboard im Baby-AT
        Format mit einem 21066 LCA (Low Cost Alpha) Prozessor. Die
        NoName war urspr&uuml;nglich f&uuml;r die Verwendung durch
        OEMs gedacht.  Der LCA Chip enth&auml;lt fast die gesamte
        Ansteuerung f&uuml;r den PCI-Bus und den Speicher, was ein
        sehr preiswertes System m&ouml;glich macht.</para>

      <para>Das eingeschr&auml;nkte Interface zum Hauptspeicher bremst
        das System bei einem Cache-Miss stark aus.  Solange Sie
        innerhalb des On-Chip Caches bleiben, ist die Performance der
        CPU vergleichbar mit der einer 21064 (erste Generation der
        Alpha).  Diese Mainboards sollten heute sehr g&uuml;nstig zu
        haben sein.  Sie erhalten eine vollwertige 64-Bit CPU,
        allerdings sollten Sie keine Geschwindigkeitswunder
        erwarten.</para>

      <para>Features:</para>

      <itemizedlist>
        <listitem>
          <para>21066 Alpha CPU mit 166 MHz oder 21066A CPU mit
            233 MHz. 21068 CPUs existieren auch, sind aber noch
            langsamer.</para>
        </listitem>

        <listitem>
          <para>on-board Bcache / L2 cache: 0, 256k oder 1 MByte
            (nutzt DIL Chips)</para>
        </listitem>

        <listitem>
          <para>PS/2 Maus & Tastatur ODER 5pin DIN Tastatur (2
            verschiedene Mainboards)</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>Busbreite: 64 Bits</para>
            </listitem>

            <listitem>
              <para>PS/2 72 Pin 36 Bit Fast Page Mode SIMMs</para>
            </listitem>

            <listitem>
              <para>70ns oder schneller</para>
            </listitem>

            <listitem>
              <para>m&uuml;ssen paarweise installiert werden</para>
            </listitem>

            <listitem>
              <para>4 SIMM Steckpl&auml;tze</para>
            </listitem>

            <listitem>
              <para>benutzt ECC</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>512 KByte Flash ROM f&uuml;r die Konsole</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>Floppy-Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>1 IDE Anschlu&szlig; on-board</para>
        </listitem>

        <listitem>
          <para>Steckpl&auml;tze:</para>

          <itemizedlist>
            <listitem>
              <para>3 32 Bit PCI Steckpl&auml;tze (einer mit ISA geteilt)</para>
            </listitem>

            <listitem>
              <para>5 ISA Steckpl&auml;tze (einer mit PCI geteilt)</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>on-board Fast SCSI mit Symbios 53C810 Chip</para>
        </listitem>
      </itemizedlist>

      <para>Die NoName kann in ihrem Flash ROM die Firmware f&uuml;r
        den SRM <emphasis>oder</emphasis> ARC Konsole enthalten.  Das
        Flash ROM ist nicht gro&szlig; genug, um beide Varianten
        gleichzeitig zur Verf&uuml;gung zu stellen und die Auswahl per
        Software m&ouml;glich zu machen.  Sie ben&ouml;tigen jedoch nur
        SRM.</para>

      <para>Der Cache der NoNames nutzt 15 oder 20 ns DIL Chips.  Wenn
        Sie nur 256 KByte Cache brauchen, sollten Sie ihr altes 486er
        Mainboard ausschlachten.  Die f&uuml;r 1 MByte Cache
        ben&ouml;tigten Chips sind leider deutlich seltener zu finden.
        Sie sollten zur Steigerung der Performance mindestens 256
        KByte Cache nutzen.  Ohne Cache sind diese Maschinen sehr
        langsam.</para>

      <para>Das NoName Mainboard hat den normalen
        PC/AT-Stromanschlu&szlig;.  Au&szlig;erdem verf&uuml;gt es
        &uuml;ber einen zus&auml;tzlichen Anschlu&szlig; f&uuml;r 3.3
        Volt.  Es ist allerdings nicht notwendig, ein neues Netzteil
        zu kaufen.  Die 3.3 Volt werden nur ben&ouml;tigt, wenn Sie
        auf 3.3 Volt ausgelegt PCI-Karten nutzen wollen.  Diese sind
        extrem selten.</para>

      <para>Der IDE-Anschlu&szlig; wird von &os; unterst&uuml;tzt,
        wenn die folgende Zeile in der Konfigurationsdatei des Kernels
        steht:</para>

      <programlisting>device ata</programlisting>

      <para>Der IDE-Anschlu&szlig; nutzt IRQ 14</para>

      <para>Leider kann die SRM Konsole von der IDE-Festplatte
        <emphasis>nicht booten</emphasis>.  Sie brauchen daher eine
        SCSI-Platte als Bootdevice.</para>

      <para>Die NoName verh&auml;lt sich im Bereich der seriellen Konsole
        etwas st&ouml;rrisch.  Sie m&uuml;ssen</para>

      <screen>&gt;&gt;&gt; <userinput>SET CONSOLE SERIAL</userinput></screen>

      <para>eingeben, damit sie eine serielle Konsole benutzt.  Im
        Gegensatz zu den meisten anderen Modellen reicht es nicht aus,
        die Tastatur abzuziehen.  Um wieder zur graphischen Konsole zu
        wechseln, m&uuml;ssen Sie</para>

      <screen>&gt;&gt;&gt; <userinput>SET CONSOLE GRAPHICS</userinput></screen>

      <para>auf der seriellen Konsole eingeben.</para>

      <para>Einige Anwender mu&szlig;ten manchmal
        <keycap>Control</keycap>-<keycap>Alt</keycap>-<keycap>Del</keycap>
        dr&uuml;cken, um den SRM aufzuwecken.  Ich habe diese
        Situation noch nie erlebt; aber wenn Sie nach dem Einschalten von
        einem schwarzen Bildschirm begr&uuml;&szlig;t werden ist es einen
        Versuch wert.
        </para>

      <para>Verwenden Sie nur echte 36 Bit SIMMs, und nur FPM (Fast
        Page Mode) DRAM. EDO DRAM oder SIMMs mit simulierter Parity
        <emphasis>funktionieren nicht</emphasis>.  Das System nutzt
        die zus&auml;tzlichen 4 Bit f&uuml;r ECC.  Das ist auch der
        Grund weshalb 33 Bit FPM SIMMs nicht funktionieren.</para>

      <para>Wenn Sie die Wahl haben, sollten Sie zur PS/2-Variante des
        Mainboards greifen.  Zum einen erhalten Sie einen
        Bonus-Anschlu&szlig; f&uuml;r die Maus, zum anderen wird diese
        Variante von Tru64 Unix unterst&uuml;tzt (falls Sie das
        irgendwann einmal benutzen wollen oder m&uuml;ssen.)  Die
        <quote>DIN</quote>-Variante sollte aber f&uuml;r &os;
        ausreichend sein.</para>

      <para>Lesen Sie nach M&ouml;glichkeit das <ulink
        url="ftp://ftp.digital.com/pub/DEC/axppci/design_guide.ps">
        OEM manual</ulink>.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel einer NoName
        mu&szlig; die folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_AXPPCI_33
cpu     EV4</programlisting>
    </sect3>

    <sect3>
      <title>Universal Desktop Box (UDB oder <quote>Multia</quote>)</title>

      <note>
        <para>Die Multia enth&auml;lt entweder eine Intel- oder
          Alpha-CPU.  Hier wird aus offensichtlichen Gr&uuml;nden nur
          die Alpha-Variante betrachtet.</para>
      </note>

      <para>Die Multia ist ein kleiner Desktop-Rechner, der als eine
        Art Personal Workstation gedacht war.  Es gibt viele
        verschiedene Varianten, Sie sollten also genau auf die Details
        achten.</para>

      <para>Features:</para>

      <itemizedlist>
        <listitem>
          <para>21066 Alpha CPU mit 166 MHz oder 21066A CPU mit
            233 MHz</para>
        </listitem>

        <listitem>
          <para>on-board Bcache / L2 cache: COAST-&auml;hnliches 256
            KByte Cache Modul; die Variante mit 233 MHz hat 512 KByte
            Cache; die Variante mit 166 MHz besitzt 256 KByte Cache, der
            fest eingebaut ist.</para>
        </listitem>

        <listitem>
          <para>Anschl&uuml;sse f&uuml;r PS/2 Maus & Tastatur</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>Busbreite: 64 Bit</para>
            </listitem>

            <listitem>
              <para>PS/2 72 Pin 36 Bit Fast Page Mode SIMMs</para>
            </listitem>

            <listitem>
              <para>70ns oder schneller</para>
            </listitem>

            <listitem>
              <para>m&uuml;ssen paarweise installiert werden</para>
            </listitem>

            <listitem>
              <para>4 SIMM Steckpl&auml;tze</para>
            </listitem>

            <listitem>
              <para>benutzt ECC</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>Floppy-Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>Intel 82378ZB PCI-ISA-Bridge</para>
        </listitem>

        <listitem>
          <para>1 on-Board 21040 f&uuml;r 10MBit Ethernet mit AUI und
            10Base2 Anschl&uuml;ssen</para>
        </listitem>

        <listitem>
          <para>Steckpl&auml;tze:</para>

          <itemizedlist>
            <listitem>
              <para>1 32 Bit PCI Steckplatz</para>
            </listitem>

            <listitem>
              <para>2 PCMCIA Steckpl&auml;tze</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>on-board Crystal CS4231 oder AD1848 Soundchip</para>
        </listitem>

        <listitem>
          <para>on-board Fast SCSI, nutzt einen Symbios 53C810[A] Chip
            auf der PCI Riser Card</para>
        </listitem>
      </itemizedlist>

      <para>Das Flash ROM der Multia ist gro&szlig; genug, um SRM und
      ARC aufzunehmen und die Umschaltung der Software zu
      erm&ouml;glichen.</para>

      <para>Die in die Multia eingebaute TGA-Grafikkarte kann von
        &os; <emphasis>nicht</emphasis> als Konsole genutzt werden.
	Sie m&uuml;ssen eine serielle Konsole verwenden.</para>

      <para>Die Multia hat nur einen 32 Bit PCI Steckplatz, der nur f&uuml;r
      eine kleine PCI-Karte genutzt werden kann.  Wenn Sie darauf
      verzichten, k&ouml;nnen Sie eine 3.5&quot; Festplatte einbauen.
      Das Montagematerial k&ouml;nnte Ihrer Multia beiliegen.
      Allerdings sollten Sie auf den Einbau der Festplatte
      <emphasis>verzichten</emphasis>, da das Netzteil und die
      K&uuml;hlung unterdimensioniert sind.</para>

      <para>Die beiden PCMCIA Steckpl&auml;tze der Multia werden momentan nicht
      von &os; unterst&uuml;tzt.</para>

      <para>Wenn Sie planen, eine schnellere CPU einzubauen, sollen
      Sie pr&uuml;fen, ob die CPU gesockelt ist.
      Bei den kleineren Multias ist sie normalerweise
      eingel&ouml;tet.</para>

      <para>Die Multia besitzt zwei serielle Schnittstellen,
        allerdings sind diese auf einem 25-poligen sub-D Anschlu&szlig;
        zusammengefa&szlig;t.  In der Multia-FAQ finden Sie eine
        Anleitung zum Bau eines Y-Kabels, mit dem Sie beide
        Anschl&uuml;sse nutzen k&ouml;nnen.</para>

      <para>Sie k&ouml;nnen die Multia von Diskette booten, allerdings
        k&ouml;nnen Sie dabei auf Probleme sto&szlig;en.  Der typische
        Fehler ist:</para>

      <screen>*** Soft Error - Error #10 - FDC: Data overrun or underrun</screen>

      <para>Dies ist kein Problem von &os;, es ist ein Fehler im SRM.
        Die einfachste M&ouml;glichkeit bei der Installation von &os;
        ist, von einem SCSI CDROM zu booten.</para>

      <para>Einige Anwender mu&szlig;ten manchmal
        <keycap>Control</keycap>-<keycap>Alt</keycap>-<keycap>Del</keycap>
        dr&uuml;cken, um den SRM aufzuwecken.  Ich habe diese
        Situation noch nie erlebt; aber es kommt auf einen Versuch an,
        wenn Sie nach dem Einschalten von einem schwarzen Bildschirm
        begr&uuml;&szlig;t werden.</para>

      <para>Audio funktioniert beim Crystal CS4231 Chip einwandfrei, wenn
        Sie den &man.pcm.4;-Treiber benutzen und die folgende Zeile
        in der Konfigurationsdatei f&uuml;r Ihren Kernel
        haben:</para>

      <programlisting>device pcm</programlisting>

      <para>Die Audio-Hardware nutzt Port 0x530, IRQ 9 und DRQ 3.  Sie
	m&uuml;ssen in <filename>device.hints</filename>
	zus&auml;tzlich noch <literal>flags 0x15</literal>
	angeben.</para>

      <para>Bis jetzt hat es noch niemand geschafft, einer Multia mit
        einem AD1848 einen Ton zu entlocken..</para>

      <para>Beim Test der Audio-Wiedergabe wird man daran erinnert,
        da&szlig; die 166 MHz CPU nicht schnell ist.  MP3s k&ouml;nnen
        nur mit 22 kHz fehlerfrei wiedergegeben werden.</para>

      <para>Multis sind daf&uuml;r bekannt, da&szlig; sie gerne den
        Hitzetod sterben.  Das extrem kompakte Geh&auml;use erlaubt
        kaum Luftzufuhr.  Sie sollten Sie Multia senkrecht in ihrem
        St&auml;nder stellen, nicht waagerecht
        (<quote>Pizzaschachtel</quote>).  Es ist eine sehr gute Idee,
        den L&uuml;fter durch ein leistungsst&auml;rkeres Modell zu
        ersetzen.  Weiterhin k&ouml;nnen Sie eines der Kabel zum
        Temperatursensor durchschneiden.  Danach wird der L&uuml;fter
        mit voller Drehzahl (und Lautst&auml;rke) betrieben.
        H&uuml;ten Sie sich vor PCI-Karten, die sehr viel Strom
        brauchen.  Falls Ihr System trotzdem sterben sollten,
        k&ouml;nnten Ihnen die Multia-Heat-Death Seiten auf der <ulink
        url="http://www.netbsd.org/">Website von NetBSD</ulink> bei
        der Reparatur weiterhelfen.</para>

      <para>Die Intel 82378ZB PCI to ISA Bridge erm&ouml;glicht es,
        eine IDE-Festplatte zu benutzen.  Sie ben&ouml;tigen die folgende
        Zeile in der Konfigurationsdatei Ihres
        angepa&szlig;ten Kernels:</para>

      <programlisting>device ata</programlisting>

      <para>Der IDE-Anschlu&szlig; nutzt IRQ 14</para>

      <para>Der IDE-Anschlu&szlig; ist f&uuml;r die 2.5&quot;
        Laptop-Festplatten ausgelegt.  Eine 3.5&quot; IDE-Festplatte
        pa&szlig;t nicht in das Geh&auml;use, solange Sie nicht den
        PCI-Steckplatz opfern.  Leider kann die SRM Konsole nicht von einer
        IDE-Platte booten.  Sie ben&ouml;tigen also eine SCSI-Platte
        als Bootdevice.</para>

      <para>Falls Sie die interne Festplatte auswechseln m&uuml;ssen:
        Das interne Kabel vom PCI Riser Board zur
        <emphasis>2.5&quot;</emphasis> Festplatte ist schmaler als ein
        normales SCSI-Flachbandkabel.  Andernfalls w&uuml;rde es nicht
        auf die 2.5&quot; Festplatte passen.  Allerdings gibt es auch
        riser cards mit einem Anschlu&szlig; f&uuml;r ein normales
        SCSI-Kabel, das auf eine normale SCSI-Platte
        pa&szlig;t.</para>

      <para>Allerdings sollten Sie vor dem Einbau einer weiteren Festplatte
        absehen. Benutzen Sie den externen SCSI-Anschlu&szlig; und bauen Sie
        die Festplatte in ein externes Geh&auml;use ein.  Die
        Temperatur in der Multia ist schon hoch genug.  In den meisten
        F&auml;llen hat Ihre Multia einen 50 poligen High-Density
        Anschlu&szlig;, allerdings gab es auch Varianten der Multia,
        die keine Festplatte hatten und evtl. auch &uuml;ber keinen externen
        SCSI-Anschlu&szlig; verf&uuml;gen.  Achten Sie beim Kauf
        darauf.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel einer
        Multia mu&szlig; die folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_AXPPCI_33
cpu     EV4</programlisting>

      <para>Wichtige Informationen zur Multia finden Sie unter <ulink
        url="http://www.netbsd.org/Ports/alpha/multiafaq.html">
        http://www.netbsd.org/Ports/alpha/multiafaq.html</ulink> und
        <ulink url="http://www.brouhaha.com/~eric/computers/udb.html">
        http://www.brouhaha.com/~eric/computers/udb.html</ulink>.</para>
    </sect3>

    <sect3>
      <title>Personal Workstation (<quote>Miata</quote>)</title>

      <para>Die Miata ist einem kleinen Towergeh&auml;use
        untergebracht, da&szlig; unter dem Schreibtisch verschwinden
        kann.  Es gibt diverse Varianten der Multia.  Die erste Miata
        war das Modell MX5.  Da die Hardware dieser Maschinen eine
        Reihe von Designschw&auml;chen zeigte, wurde die Maschine
        &uuml;berarbeitet, das Ergebnis war die MiataGL.  Leider kann
        man die beiden Varianten nicht durch einen einfachen Blick auf
        das Geh&auml;use unterscheiden.  Die einfachste Methode ist ein
        Blick auf die R&uuml;ckseite des Geh&auml;uses.  Wenn sich dort
        zwei USB-Anschl&uuml;sse befinden, handelt es sich um eine
        MiataGL.  Auf dem Markt ist jedoch &uuml;berwiegend die MX5 zu
        finden.</para>

      <para>Der offizielle Systemname lautet <quote>Personal
        Workstation 433a</quote>.  Der Begriff Personal Workstation
        ist etwas unhandlich und wird daher meist als PWS
        abgek&uuml;rzt.  Der Name besagt, da&szlig; die Maschine eine
        433 MHz-CPU hat und f&uuml;r den Betrieb unter WinNT
        Workstation vorgesehen war (erkenntlich am
        anschlie&szlig;enden a).  Die f&uuml;r den Betrieb mit Tru64
        Unix oder OpenVMS gedachten Systeme tragen Bezeichnungen wie
        <quote>433au</quote>. WinNT-Miatas enthalten in der Regel ab
        Werk ein IDE CDROM-Laufwerk.  Verallgemeinert gesehen, folgen die
        Systemnamen dem Schema PWS[433,500,600]a[u].</para>

      <para>Au&szlig;erdem gab es auch eine Variante, bei der die CPU
        mit einem speziellen System von Kyrotech gek&uuml;hlt wurde;
        diese Maschinen besitzen ein etwas anderes
        Geh&auml;use.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21164A EV56 Alpha CPU mit 433, 500 oder 600 MHz</para>
        </listitem>

        <listitem>
          <para>21174 Core Logic (<quote>Pyxis</quote>) Chipsatz</para>
        </listitem>

        <listitem>
          <para>on-board Bcache / L3 cache: 0, 2 oder 4 MByte (benutzt
            ein Cache Modul)</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>Busbreite: 128 Bits, ECC</para>
            </listitem>

            <listitem>
              <para>ungepufferte 72 Bit breite SDRAM DIMMs,
                m&uuml;ssen paarweise installiert werden</para>
            </listitem>

            <listitem>
              <para>6 DIMM Sockel</para>
            </listitem>

            <listitem>
              <para>Maximaler Speicherausbau: 1.5 GBytes</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>on-board Fast Ethernet:</para>

          <itemizedlist>
            <listitem>
              <para>Die MX5 benutzt je nach Version der PCI Riser Card
                einen 21142 oder 21143 Ethernet Chip</para>
            </listitem>

            <listitem>
              <para>Die MiataGL benutzt den 21143 Chip</para>
            </listitem>

            <listitem>
              <para>der Anschlu&szlig; ist entweder 10/100 MBit UTP,
                oder 10 MBit UTP/BNC</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>2 on-board [E]IDE Kan&auml;le, basierend auf dem
            CMD646 (MX5) oder dem Cypress 82C693 (MiataGL)</para>
        </listitem>

        <listitem>
          <para>1 Ultra-Wide SCSI Qlogic 1040 [nur MiataGL]</para>
        </listitem>

        <listitem>
          <para>2 64-Bit PCI Steckpl&auml;tze</para>
        </listitem>

        <listitem>
          <para>3 32-Bit PCI Steckpl&auml;tze (hinter einer DEC
            PCI-PCI Bridge)</para>
        </listitem>

        <listitem>
          <para>3 ISA Steckpl&auml;tze (teilen sich den Platz mit den
            32 Bit PCI Steckpl&auml;tzen, angeschlossen &uuml;ber eine
            Intel 82378IB PCI to ISA Bridge)</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse mit 16550A</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>PS/2 Anschlu&szlig; f&uuml;r Tastatur und Maus</para>
        </listitem>

        <listitem>
          <para>USB Anschlu&szlig; [nur MiataGL]</para>
        </listitem>

        <listitem>
          <para>eingebauter ESS1888 Soundchip</para>
        </listitem>
      </itemizedlist>

      <para>Die Elektronik der Miata ist auf zwei Platinen
        untergebracht.  Das untere Board befindet sich auf dem
        Geh&auml;useboden und tr&auml;gt die PCI- und ISA-Steckpl&auml;tze, den
        Soundchip, und &auml;hnliches.  Die obere Platine tr&auml;gt
        die CPU, den Pyxis Chip, den Speicher, usw.  Beachten Sie,
        da&szlig; die MX5 und die MiataGL zwei verschiedene PCI Riser
        Boards verwenden.  Sie k&ouml;nnen also nicht einfach eine
        Platine mit einer MiataGL CPU einsetzen, sondern Sie
        ben&ouml;tigen das passende riser board.  Angeblich kann man
        den Riser aus einer MX5 mit der CPU-Platine der MiataGL benutzen,
        diese Konfiguration ist aber ungetestet und wird nicht
        unterst&uuml;tzt.  Alle anderen Teile der Systeme
        (Geh&auml;use, Kabel, etc.) sind bei der MX5 und der MiataGL
        identisch.</para>

      <para>Die MX5 hat Probleme mit DMA-Transfers von und zu den
        beiden 64-Bit PCI Steckpl&auml;tzen, wenn dieser DMA die Grenze
        einer Speicherseite &uuml;berschreitet.  Da der PCI-PCI
        Bridge Chip diese Transfers nicht erlaubt, sind die 32 Bit
        Steckpl&auml;tze davon nicht betroffen.  Befindet sich in einem
        der 64 Bit Steckpl&auml;tzen eine dem SRM unbekannte Karte,
        startet das System nicht. Nur Karten, von denen der SRM wei&szlig;, da&szlig; sie
        funktionieren (<quote>known good</quote>), k&ouml;nnen in den
        64 Bit Steckpl&auml;tzen genutzt werden.</para>

      <para>Wenn Sie den SRM &uuml;berlisten wollen, k&ouml;nnen Sie
        an der Eingabeaufforderung <userinput>set
        pci_device_override</userinput> eingeben.  Wenn Ihre Daten
        danach mysteri&ouml;se Fehler aufweisen, d&uuml;rfen Sie sich
        allerdings nicht beschweren.</para>

      <para>Der vollst&auml;ndige Befehl lautet:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET PCI_DEVICE_OVERRIDE <replaceable>&lt;vendor_id&gt;</replaceable><replaceable>&lt;device_id&gt;</replaceable></userinput></screen>

      <para>Zum Beispiel:</para>

<screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET PCI_DEVICE_OVERRIDE 88c15333</userinput></screen>

      <para>Der radikalste Ansatz ist:</para>

<screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET PCI_DEVICE_OVERRIDE -1</userinput></screen>

      <para>Damit wird die &Uuml;berpr&uuml;fung der PCI ID komplett
        abgeschaltet und Sie k&ouml;nnen jede beliebige PCI-Karte
        installieren, ohne da&szlig; deren PCI ID gepr&uuml;ft wird.
        Damit dies funktioniert, brauchen Sie allerdings eine halbwegs
        aktuelle Version des SRM.</para>

      <important>
        <para>Sie handeln auf eigenes Risiko..</para>
      </important>

      <para>Der Kernel von &os; meldet Ihnen, wenn er den fehlerhaften
        Chip von Pyxis findet:</para>

<screen>Sep 16 18:39:43 miata /kernel: cia0: Pyxis, pass 1
Sep 16 18:39:43 miata /kernel: cia0: extended capabilities: 1&lt;BWEN&gt;
Sep 16 18:39:43 miata /kernel: cia0: WARNING: Pyxis pass 1 DMA bug; no bets...</screen>

      <para>Bei einer MiataGL erscheint:</para>

<screen>Jan  3 12:22:32 miata /kernel: cia0: Pyxis, pass 1
Jan  3 12:22:32 miata /kernel: cia0: extended capabilities: 1&lt;BWEN&gt;
Jan  3 12:22:32 miata /kernel: pcib0: &lt;2117x PCI host bus adapter&gt; on cia0</screen>

      <para>Die MiataGL hat die DMA Probleme der MX5 nicht. PCI
        Karten, die der SRM der XM5 moniert, wenn Sie
        im 64 Bit Steckplatz installiert werden, werden kommentarlos
        vom SRM der MiataGL akzeptiert.</para>

      <para>Die neueren Versionen des Mainboards f&uuml;r die MX5
        enthalten eine Hardware-Korrektur f&uuml;r den Fehler.  Der
        SRM hat keine Informationen &uuml;ber das ECO und wird sich
        auch weiterhin &uuml;ber unbekannte Karten beschweren.  Der
        &os;  Kernel hat &uuml;brigens das gleiche Problem.</para>

      <para>Der Miata SRM kann vom IDE CDROM booten.  Sowohl die Miata
        GL als auch die MX5 k&ouml;nnen von der IDE Festplatte booten,
        Sie k&ouml;nnen also das gesamte &os;-Dateisystem dort
        ablegen.  Die Geschwindigkeit der Festplatte in einer MX5
        liegt bei ungef&auml;hr 14 MByte/sec (wenn die Festplatte
        schnell genug ist).  Der CMD646 Chip der Miata
        unterst&uuml;tzt maximal WDMA2, der UDMA-Modus ist zu
        fehlerhaft.</para>

      <para>Die Miata MX5 verwendet im Allgemeinen einen auf dem Qlogic 1040
        basierenden SCSI Kontroller.  Der SRM kann davon
        booten.  Bitte beachten Sie, da&szlig; Sie von einem
        Adaptec-Kontroller <emphasis>nicht</emphasis> booten
        k&ouml;nnen.</para>

      <para>Der PCI-PCI Bridge Chip auf der Riser Card der MiataGL ist
        schneller als der Chip auf der Riser Card der MX5.  Einige
        Riser Cards f&uuml;r die MX5 haben sogar den
        <emphasis>gleichen</emphasis> Chip wie die MiataGL. Es gibt
        also jede Menge Abwechslung.</para>

      <para>Nicht alle VGA-Karten funktionieren hinter der PCI-PCI
        Bridge.  Das typische Symptom ist ein fehlendes Bild.  Um
        dieses Problem zu beheben, sollten Sie die Karten einfach
        <quote>vor</quote> die Bridge setzen, also in einen der 64 Bit
        PCI Steckpl&auml;tze.</para>

      <para>Sowohl die MX5 als auch die MiataGL haben einen Soundchip
        vom Type ESS1888 on-board.  Er emuliert einen SoundBlaster und
        wird unterst&uuml;tzt, wenn Sie die folgende Zeile in der
        Konfigurationsdatei Ihres angepa&szlig;ten Kernels
        haben:</para>

      <programlisting>device    pcm
device  sbc</programlisting>

      <para>Falls in Ihrer Miata eines der optionalen Cache Module
        steckt, sollten Sie sicherstellen, da&szlig; es fest
        eingesteckt ist.  Ein lockeres Modul f&uuml;hrt zu seltsam
        erscheinenden Abst&uuml;rzen (nicht verwunderlich, aber kommen
        Sie erst einmal darauf, wenn Sie einen mysteri&ouml;sen Fehler
        suchen).  Die Cache Module der MX5 und MiataGL sind
        identisch.</para>

      <para>Wenn Sie das 2 MByte Cache Modul installieren, wird Ihr
        System zwar rund 10-15% schneller (wenn man die Zeit f&uuml;r
        ein buildworld mi&szlig;t).  Gleichzeitig
        <emphasis>sinkt</emphasis> aber die Bandbreite bei
        Lesezugriffen auf die 64 Bit PCI Karten via PCI DMA.  Bei
        einem Test mit einer 64 Bit Karte von Myrinet sank die
        Geschwindigkeit von 149 MByte/sec auf 115 MByte/sec.  Sie
        sollten diese Tatsache im Hinterkopf behalten, wenn Sie
        f&uuml;r Ihr Einsatzgebiet extrem schnelle 64 Bit PCI Karten
        ben&ouml;tigen.</para>

      <para>Obwohl es m&ouml;glich ist, bis zu 1.5 GByte Speicher
        einzubauen, kann &os; nur 1 GByte nutzen, da die DMA-Routinen
        den Speicher oberhalb 1 GByte nicht korrekt
        ansprechen.</para>

      <para>Der Wechsel zu einer schnelleren CPU ist einfach, wechseln
        Sie die CPU, und stellen an dem DIP-Schalter f&uuml;r den
        Takt-Multiplikator die Geschwindigkeit der neuen CPU
        ein.</para>

      <para>Wenn Sie &os; beenden und danach die folgende
        Fehlermeldung erhalten</para>

      <screen>ERROR: scancode 0xa3 not supported on PCXAL</screen>

      <para>sollten Sie die SRM Firmware auf V7.2-1 (oder neuer)
        aktualisieren.  Diese Version erschien zuerst auf der
        <quote>Firmware Update CD V5.7</quote>, ist aber auch auf
        <ulink
        url="http://www.compaq.com/">http://www.compaq.com/</ulink>
        erh&auml;ltlich.  Damit wird dieser Fehler des SRM sowohl bei der
        Miata MX5 als auch bei der Miata GL behoben.</para>

      <para>USB wird ab &os; 4.1 unterst&uuml;tzt.</para>

      <para>Bevor Sie das Geh&auml;use &ouml;ffnen, m&uuml;ssen Sie auf
        jeden Fall den Netzstecker ziehen.  Einige Komponenten werden
        mit Strom versorgt, <emphasis>obwohl</emphasis> der
        Netzschalter auf aus steht.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel einer Miata
        mu&szlig; die folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_ST550
cpu     EV5</programlisting>
    </sect3>

    <sect3>
      <title>Evaluation Board 64 Systeme</title>

      <para>Im Rahmen der Bem&uuml;hungen, die Alpha CPU
        popul&auml;rer zu machen, wurden von DEC eine ganze Reihe
        sogenannter Evaluation Boards herausgegeben.  Zu diesen
        Systemen geh&ouml;ren EB64, EB64+, und das AlphaPC64
        (<quote>Cabriolet</quote>).  Ein weiteres Mitglied dieser
        Familie ist das nicht von DEC stammende Aspen Alpine.  Die zur
        EB64 Familie geh&ouml;renden Evaluation Boards weisen 
        folgende Eigenschaften auf:</para>

      <itemizedlist>
        <listitem>
          <para>21064 oder 21064A CPU, 150 bis 275 MHz</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>Busbreite: 128 Bit</para>
            </listitem>

            <listitem>
              <para>PS/2 Fast Page Mode SIMM, 72polig, 33 Bit </para>
            </listitem>

            <listitem>
              <para>70ns oder schneller</para>
            </listitem>

            <listitem>
              <para>Mu&szlig; in Vierergruppen installiert
                werden</para>
            </listitem>

            <listitem>
              <para>8 Steckpl&auml;tze f&uuml;r SIMMs</para>
            </listitem>

            <listitem>
              <para>benutzt Parit&auml;t</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>Bcache / L2 cache: 0 KByte, 512 KByte, 1 MByte oder 2
            MByte</para>
        </listitem>

        <listitem>
          <para>21072 (<quote>APECS</quote>) Chipsatz</para>
        </listitem>

        <listitem>
          <para>Intel 82378ZB PCI to ISA Bridge Chip
            (<quote>Saturn</quote>) </para>
        </listitem>

        <listitem>
          <para>zwei serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>ein paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>Symbios 53C810 Fast-SCSI (nicht beim Alpha
            PC64)</para>
        </listitem>

        <listitem>
          <para>IDE Anschlu&szlig; (nur Alpha PC64)</para>
        </listitem>

        <listitem>
          <para>10 MBit Ethernet eingebaut (nicht beim Alpha
            PC64)</para>
        </listitem>

        <listitem>
          <para>2 PCI Steckpl&auml;tze (vier beim Alpha PC64)</para>
        </listitem>

        <listitem>
          <para>3 ISA Steckpl&auml;tze</para>
        </listitem>
      </itemizedlist>

      <para>Das Aspen Alpine unterscheidet sich zwar geringf&uuml;gig
        vom EB64+, ist aber &auml;hnlich genug, um mit dem SRM EPROM
        eines EB64+ betrieben werden zu k&ouml;nnen.  Das Aspen Alpine
        hat keinen Ethernet-Anschlu&szlig;, daf&uuml;r aber 3 statt 2
        PCI Steckpl&auml;tzen.  Weiterhin verf&uuml;gt es &uuml;ber 2
        MByte Cache Speicher, der fest eingel&ouml;tet ist sowie
        Jumper zur Auswahl der SIMM-Geschwindigkeit (60 ns, 70 ns, 80
        ns).</para>

      <para>Sie k&ouml;nnen auch SIMMs mit 36 Bit einsetzen, in diesem
        Fall bleiben 3 Bit ungenutzt.  Beachten Sie, da&szlig; die
        Systeme Fast Page Mode Speicher ben&ouml;tigen, und nicht EDO
        Speicher.</para>

      <para>Das Programm f&uuml;r die SRM Konsole des EB64+ steckt in
        einem mit UV-Licht l&ouml;schbaren EPROM, einfache Updates via
        Flash sind bei der EB64+ also nicht m&ouml;glich.  Aber die
        aktuellste Version des SRM f&uuml;r die EB64+ ist ohnehin
        stark veraltet.</para>

      <para>Der SRM der EB64+ kann sowohl vom 53C810 als auch vom
        Qlogic1040 SCSI Kontroller booten.  Leider gibt es hinsichtlich
        der Verwendung von Ultra SCSI Ger&auml;ten ein Probleme
        mit dem Qlogic. Die Firmware, welche von der SRM auf den
        Qlogic geladen wird, ist sehr alt. Da es keine Updates
        f&uuml;r den SRM des EB64+ gibt, l&auml;&szlig;t sich dies auch
        nicht &auml;ndern. Man kann zwar eine neuere Version der
        Qlogic Firmware in den &os; Kernel einbinden, da es den Kernel
        aber um mehrere hundert KByte aufbl&auml;ht, ist dies un&uuml;blich.
        Erst ab &os; 4.1 ist die Firmware in einem nachladbaren Modul
        enthalten.  Das alles kann dazu f&uuml;hren, da&szlig; Sie einen
        anderen Kontroller als den Qlogic f&uuml;r ihr Bootdevice benutzen
        m&uuml;ssen.</para>

      <para>Die AlphaPC64 Systeme werden normalerweise mit der
        Firmware f&uuml;r die ARC Konsole ausgeliefert.  Die Software
        f&uuml;r die SRM Konsole kann von Diskette in das Flash ROM
        geladen werden.</para>

      <para>Die SRM Konsole kann nicht vom IDE Anschlu&szlig; des
        AlphaPC64 booten.  Wenn Sie den IDE-Anschlu&szlig; verwenden
	wollen, mu&szlig; in der Konfigurationsdatei f&uuml;r den
	angep&szlig;aten Kernel die folgende Zeile stehen:</para>

      <programlisting>device ata</programlisting>

      <para>Der IDE-Anschlu&szlig; nutzt IRQ 14.</para>

      <para>Denken Sie daran, da&szlig; Sie ein Netzteil brauchen, das
        3.3 Volts bereitstellt (f&uuml;r die CPU).</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig;
        f&uuml;r Maschinen mit EB64+ die folgenden Zeilen
        enthalten:</para>

      <programlisting>options   DEC_EB64PLUS
cpu     EV4</programlisting>
   </sect3>

    <sect3>
      <title>Evaluation Board 164 (<quote>EB164, PC164, PC164LX,
        PC164SX</quote>) Familien</title>

      <para>Das EB164 ist eine neuere Version des evaluation board und
        verwendet eine 21164A CPU.  Diese Version dient als Grundlage
        diverser Varianten, die zum Teil von OEM Herstellern genutzt
        werden.  Samsung entwickelte eine eigene Variante mit dem
        Namen PC164LX, die nur &uuml;ber 32 Bit PCI Steckpl&auml;tze
        verf&uuml;gt, w&auml;hrend das Original von Digital 64 Bit PCI
        bietet.</para>

      <itemizedlist>
        <listitem>
          <para>21164A, verschiedene Geschwindigkeiten [EB164, PC164,
            PC164LX]</para>
        </listitem>

        <listitem>
          <para>21164PC [nur auf dem PC164SX]</para>
        </listitem>

        <listitem>
          <para>21171 (Alcor) Chipsatz [EB164]</para>
          <para>21172 (Alcor2) Chipsatz [PC164]</para>
          <para>21174 (Pyxis) Chipsatz [164LX, 164SX]</para>
        </listitem>

        <listitem>
          <para>Bcache / L3 cache:  das EB164 benutzt spezielle
            cache-SIMMs</para>
        </listitem>

        <listitem>
          <para>Speicherbandbreite: 128 Bit / 256 Bit</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>PS/2 SIMMs, in Gruppen zu 4 oder 8 Modulen</para>
            </listitem>

            <listitem>
              <para>36 Bit, Fast Page Mode, ECC, [EB164 /
                PC164]</para>
            </listitem>

            <listitem>
              <para>Paare aus SDRAM DIMMs, ECC [PC164SX /
                PC164LX]</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>PS/2 Tastatur und Maus</para>
        </listitem>

        <listitem>
          <para>Kontroller f&uuml;r Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>32 Bit PCI</para>
        </listitem>

        <listitem>
          <para>64 Bit PCI [nur in einigen Modellen]</para>
        </listitem>

        <listitem>
          <para>ISA slots hinter einem Intel 82378ZB PCI to ISA Bridge
            Chip</para>
        </listitem>
      </itemizedlist>

      <para>Die Benutzung von 8 SIMMs, um einen 256 Bit breiten
	Speicher zu erhalten, resultiert in interessanten
	Geschwindigkeitsvorteilen gegen&uuml;ber einem 4 SIMM/128 Bit
	breiten Speicher.  Nat&uuml;rlich m&uuml;ssen alle 8 SIMMs vom
	gleichen Typ sein, damit dies funktioniert;  au&szlig;erdem
	mu&szlig; das System explizit auf die Nutzung des 8 SIMM Modus
	konfiguriert werden.  Sie m&uuml;ssen 8 SIMMs benutzen, 4
	SIMMs auf 2 B&auml;nke verteilt funktioniert nicht.  Bei der
	PC164 kann mit 8 128 MByte SIMMs ein maximaler Speicherausbau
	von 1 GByte erreicht werden.  Das Handbuch behauptet, der
	maximale Speicherausbau betrage 512 MByte.</para>

      <para>Der SRM kann von Qlogic 10xx Karten oder dem Symbios
        53C810[A] booten.  Neuere Versionen des Symbios 810 wie der
        Symbios 810AE werden vom SRM des PC164 nicht erkannt.  Der SRM
        der PC164 unterst&uuml;tzt Hostadapter auf Basis des Symbios
        53C895 scheinbar auch nicht (getestet mit einem Tekram
        DC-390U2W).  Allerdings gibt es Berichte, wonach No-Name
        Symbios 53C985 Karten funktionieren sollen.  Karten wie der
        Tekram DC-390F (basiert auf dem Symbios875) funktionieren
        offenbar auf der PC164, allerdings scheint es hier leider
        subtile Abh&auml;ngigkeiten von der jeweiligen Revision des
        Chips und des Mainboards zu geben.</para>

      <para>Von mit dem Symbios 53C825[a] best&uuml;ckten Karten kann
        ebenfalls gebootet werden. Der Diamond FirePort baut zwar ebenfalls
        auf Chips von Symbios auf, hingegen kann der SRM des PC164SX
        davon nicht booten.  Es gibt Berichte, da&szlig; die PC164SX
        problemlos von Karten mit Symbios825, Symbios875, Symbios895 und
        Symbios876 booten kann.  Es gibt ebenfalls Erfolgsmeldungen
        f&uuml;r Adaptec 2940U und 2940UW (verifiziert mit SRM
        V5.7-1). Adaptec 2930U2 und 2940U2[W] funktionieren
        nicht.</para>

      <para>Der SRM der 164LX und 164SX kann ab der Firmware Version
        5.8 von Hostadaptern der Adaptec 2940-Familie booten.</para>

      <para>Kurz zusammengefa&szlig;t: Die Maschinen dieser
        Modellreihe sind in Punkto Kompatibilit&auml;t der
        SCSI-Kontroller eine echte Herausforderung.</para>

      <para>Die 164SX unterst&uuml;tzt maximal 1 GByte RAM.  Es gibt
	Berichte, da&szlig; eine Best&uuml;ckung mit vier normalen
	256MB PC133 ECC DIMMs problemlos funktioniert.  Zur Zeit ist
	nicht bekannt, ob auch 512MB DIMMs genutzt werden
	k&ouml;nnen.</para>

      <para>Die 164SX hat Probleme mit einigen PCI Bridge Chips, was
	zu SRM Fehlern und Kernel Panics f&uuml;hren kann.  Dies
	scheint davon abzuh&auml;ngen, ob die SRM Konsole den Chip
	unterst&uuml;tzt und korrekt initialisieren kann.  Das
	eingebaute IDE Interface der 164SX ist sehr langsam, durch die
	Verwendung einer Karte von Promise kann man die
	Geschwindigkeit um den Faktor 3-4 erh&ouml;hen.</para>

      <para>Der SRM der PC164 scheint ab und zu seine Einstellungen zu
        vergessen. Um ohne den Verlust von Einstellungen auszukommen,
        soll man, aktuellen Annahmen nach, erst auf SRM 4.x downgraden
        und dann auf 5.x upgraden. Ein Fehler welcher  z.B. auffiel war:</para>

      <screen>ERROR: ISA table corrupt!</screen>

      <para>Nach einem Downgrade auf SRM4.9, einem</para>

 <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>ISACFG -INIT</userinput></screen>

      <para>gefolgt von einem</para>

      <screen><prompt>&gt;&gt;&gt; </prompt><userinput>INIT</userinput></screen>

      <para>war das Problem gel&ouml;st.  Einige der Besitzer der PC164
        berichteten, da&szlig; dieses Problem noch nie auftrat.</para>

      <para>Beim PC164SX gibt es im AlphaBIOS eine Einstellung,
        da&szlig; beim n&auml;chsten Einschalten des Systems die SRM
        Konsole genutzt werden soll.  Leider scheint diese
        Einstellung ohne Wirkung zu bleiben.  Mit anderen Worten, es wird
        immer das AlphaBIOS gebootet. Unabh&auml;ngig von dem was Sie einstellen.
        Des Problems L&ouml;sung ist, das ROM der Konsole mit dem SRM Code f&uuml;r
        die PC164SX zu &uuml;berschreiben.  Dadurch wird das AlphaBIOS
        &uuml;berschrieben und Sie erhalten die gew&uuml;nschte SRM
        Konsole.  Der SRM Code ist auf der Webseite von Compaq
        verf&uuml;gbar.</para>

      <para>Bei der 164LX kann nur die SRM Konsole oder das AlphaBIOS
        verwendet werden, da das Flash ROM zu klein ist, um beide zur
        gleichen Zeit aufzunehmen.</para>

      <para>Die PC164 kann von einer IDE Festplatte booten, wenn der
        SRM aktuell genug ist.</para>

      <para>Das EB164 ben&ouml;tigt ein Netzteil, da&szlig; 3.3 Volt
        zur Verf&uuml;gung stellt.  Bei der PC164 fehlt allerdings das
        von ATX Netzteilen zum Einschalten ben&ouml;tigte PS_ON
        Signal.  Ein kleiner Schalter, der dieses Signal mit Masse
        verbindet, erlaubt Ihnen die Benutzung eines normalen ATX
        Netzteils.</para>

      <para>Die Konfigurationsdatei eines angepa&szlig;ten Kernels
        f&uuml;r Maschinen auf Grundlage des EB164 mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options         DEC_EB164
cpu             EV5</programlisting>
    </sect3>

    <sect3>
      <title>AlphaStation 200 (<quote>Mustang</quote>) und 400
      (<quote>Avanti</quote>) Familien</title>

      <para>Die Digital AlphaStation 200 und 400 Systeme sind
        fr&uuml;he, leistungsschwache, PCI-basierte Workstations.  Die
        Modellreihen 200 und 250 sind Desktops, die 400er sind
        Mini-Tower.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21064 oder 21064A CPU, Geschwindigkeit 166 bis 333
            MHz</para>
        </listitem>

        <listitem>
          <para>DECchip 21071-AA core logic Chipsatz</para>
        </listitem>

        <listitem>
          <para>Bcache / L2 cache: 512 Kbytes (Modelle 200 und 400)
            oder 2048 KByte (Modell 250)</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>Busbreite 64 Bit</para>
            </listitem>

            <listitem>
              <para>8 bis 384 MByte RAM</para>
            </listitem>

            <listitem>
              <para>Fast Page DRAM, Zugriffszeit maximal 70 ns</para>
            </listitem>

            <listitem>
              <para>in drei Paaren (Modelle 200 und
                400)</para>
            </listitem>

            <listitem>
              <para>in zwei Vierergruppen (Modell 250)</para>
            </listitem>

            <listitem>
              <para>das Speichersystem verwendet Parit&auml;t</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>PS/2 Tastatur und Maus</para>
        </listitem>

        <listitem>
          <para>zwei serielle Anschl&uuml;sse, 16550</para>
        </listitem>

        <listitem>
          <para>ein paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>Anschlu&szlig; f&uuml;r ein Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>32 Bit PCI Steckpl&auml;tze (3 beim Modell AS400, 2
            bei den Modellen AS200 und 250)</para>
        </listitem>

        <listitem>
          <para>ISA Steckpl&auml;tze (4 beim Modell AS400-series, 2
            bei den Modellen AS200 und 250, einige der ISA und PCI
            Steckpl&auml;tze &uuml;berlappen physikalisch)</para>
        </listitem>

        <listitem>
          <para>eingebauter Ethernet-Anschlu&szlig; auf Grundlage
            eines 21040 (Modelle 200 und 250)</para>
        </listitem>

        <listitem>
          <para>eingebauter Symbios 53c810 Fast SCSI-2 Chip</para>
        </listitem>

        <listitem>
          <para>Intel 82378IB (<quote>Saturn</quote>) PCI-ISA Bridge
            Chip</para>
        </listitem>

        <listitem>
          <para>entweder eingebaute TGA oder PCI VGA Grafik
            (Modellabh&auml;ngig)</para>
        </listitem>

        <listitem>
          <para>16 Bit Audio (Modelle 200 und 250)</para>
        </listitem>
      </itemizedlist>

      <para>Die Systeme benutzen SIMMs mit Parit&auml;t, es brauchen
        allerdings keine 36 Bit breiten SIMMs zu sein.  33 Bit breite
        SIMMs reichen aus, 36 Bit breite werden aber auch akzeptiert.
        EDO oder 32 Bit breite SIMMs funktionieren nicht.  Die Systeme
        unterst&uuml;tzen Speichermodule mit 4, 8, 16, 32 und 64
        MByte.</para>

      <para>Die Audio-Hardware der AS200 und AS250 soll funktionieren,
        wenn man die folgende Zeile in die Konfigurationsdatei
        f&uuml;r den angepa&szlig;ten Kernel einf&uuml;gt:</para>

      <programlisting>device pcm</programlisting>

      <para>Die Audio-Hardware nutzt Port 0x530, IRQ 10 und DRQ 3.  Sie
	m&uuml;ssen in <filename>device.hints</filename>
	zus&auml;tzlich noch <literal>flags 0x10011</literal>
	angeben.</para>

      <para>Die Modelle AlphaStation 200 und 250 verf&uuml;gen
        &uuml;ber einen automatischen SCSI-Terminator.  Sobald Sie
        Kabel an den externen SCSI-Anschlu&szlig; anstecken, wird der
        interne Terminator deaktiviert.  Das bedeutet nat&uuml;rlich,
        da&szlig; Sie keine nicht terminierten Kabel an die Maschine
        anschlie&szlig;en d&uuml;rfen.</para>

      <para>Bei der AlphaStation 400 wird der Terminator &uuml;ber den
        SRM gesteuert.  Falls Sie externe SCSI-Ger&auml;te verwenden,
        m&uuml;ssen Sie den folgenden Befehl eingeben:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET CONTROL_SCSI_TERM EXTERNAL</userinput>.</screen>

      <para>Falls nur interne Ger&auml;te vorhanden sind:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET CONTROL_SCSI_TERM INTERNAL</userinput></screen>

      <para>Die Konfigurationsdatei des Kernels einer
        AlphaStation-[24][05]00 mu&szlig; die folgenden Zeilen
        enthalten:</para>

      <programlisting>options   DEC_2100_A50
cpu     EV4</programlisting>
    </sect3>

    <sect3>
      <title>AlphaStation 500 und 600 (<quote>Alcor</quote> und
        <quote>Maverick</quote> f&uuml;r EV5, <quote>Bret</quote>
        f&uuml;r EV56)</title>

      <para>Die AS500 und 600 waren Hochleistungs-Workstations mit einer EV5 CPU,
        und PCI Steckpl&auml;tzen.  Inzwischen haben die EV6 Maschinen diesen Platz
        eingenommen.  Die AS500 ist ein Desktop mit dunkelblauen
        Geh&auml;use (TopGun blau), die AS600 ein stabiler Tower.
        Die AS600 verf&uuml;gt &uuml;ber ein LCD, mit dessen Hilfe Sie
        die ersten Phasen des SRM Starts verfolgen
        k&ouml;nnen.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21164 EV5 CPU mit 266, 300, 333, 366, 400, 433, 466,
            oder 500 MHz (AS500) bzw. 266, 300 oder 333 MHz
            (AS600)</para>
        </listitem>

        <listitem>
          <para>21171 oder 21172 (Alcor) core logic Chipsatz</para>
        </listitem>

        <listitem>
          <para>Cache:</para>

          <itemizedlist>
            <listitem>
              <para>2 oder 4 Mb L3 / Bcache (AS600, 266 MHz)</para>
            </listitem>

            <listitem>
              <para>4 Mb L3 / Bcache (AS600, 300 MHz)</para>
            </listitem>

            <listitem>
              <para>2 oder 8 Mb L3 / Bcache (8 Mb nur in der 500 MHz
                Version)</para>
            </listitem>

            <listitem>
              <para>2 to 16 Mb L3 / Bcache (AS600; 3 Steckpl&auml;tze
                f&uuml;r cache-SIMM)</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>Bandbreite des Speichers: 256 Bit</para>
        </listitem>

        <listitem>
          <para>Speicher der AS500:</para>

          <itemizedlist>
            <listitem>
              <para>gepufferte Standard Fast Page Mode DIMMs, 72 Bit</para>
            </listitem>

            <listitem>
              <para>8 DIMM Steckpl&auml;tze</para>
            </listitem>

            <listitem>
              <para>werden in Vierergruppen installiert</para>
            </listitem>

            <listitem>
              <para>maximaler Speicherausbau 1 GB (512 Mb bei der 333
                MHz CPU)</para>
            </listitem>

            <listitem>
              <para>nutzt ECC </para>
            </listitem>
          </itemizedlist>
          </listitem>

          <listitem>
            <para>Speicher der AS600:</para>

            <itemizedlist>
              <listitem>
                <para>Standard 36 Bit Fast Page Mode SIMMs</para>
              </listitem>

              <listitem>
                <para>32 SIMM Steckpl&auml;tze</para>
              </listitem>

              <listitem>
                <para>werden in Achtergruppen installiert</para>
              </listitem>

              <listitem>
                <para>maximaler Speicherausbau 1 GB</para>
              </listitem>

              <listitem>
                <para>nutzt ECC</para>
              </listitem>
            </itemizedlist>
          </listitem>

          <listitem>
            <para>Wide SCSI auf Basis des Qlogic 1020 (1 Bus/Chip bei
              der AS500, 2 Busse/Chip bei der AS600)</para>
          </listitem>

          <listitem>
            <para>Ethernet auf Basis des 21040, Anschl&uuml;sse
              f&uuml;r Thinwire und UTP</para>
          </listitem>

          <listitem>
            <para>Erweiterungen:</para>

            <itemizedlist>
              <listitem>
                <para>AS500</para>

                <itemizedlist>
                  <listitem>
                    <para>3 32-Bit PCI Steckpl&auml;tze</para>
                  </listitem>

                  <listitem>
                    <para>1 64-Bit PCI Steckpl&auml;tze</para>
                  </listitem>
                </itemizedlist>
              </listitem>

              <listitem>
                <para>AS600:</para>

                <itemizedlist>
                  <listitem>
                    <para>2 32-Bit PCI Steckpl&auml;tze</para>
                  </listitem>

                  <listitem>
                    <para>3 64-Bit PCI Steckpl&auml;tze</para>
                  </listitem>

                  <listitem>
                    <para>1 PCI/EISA physisch geteilter
                      Steckplatz</para>
                  </listitem>

                  <listitem>
                    <para>3 EISA Steckpl&auml;tze</para>
                  </listitem>

                  <listitem>
                    <para>1 PCI und 1 EISA Steckplatz sind
                      standardm&auml;&szlig;ig belegt</para>
                  </listitem>
                </itemizedlist>
              </listitem>
            </itemizedlist>
          </listitem>

          <listitem>
            <para>21050 PCI-to-PCI Bridge</para>
          </listitem>

          <listitem>
            <para>Intel 82375EB PCI-EISA Bridge (nur AS600)</para>
          </listitem>

          <listitem>
            <para>2 serielle Anschl&uuml;sse, 16550A</para>
          </listitem>

          <listitem>
            <para>1 paralleler Anschlu&szlig;</para>
          </listitem>

          <listitem>
            <para>16 Bit Audio, Windows Sound System, in einem
              speziellen Steckplatz (AS500) bzw. in einem EISA
              Steckplatz (AS600, dies ist eine ISA Karte)</para>
          </listitem>

          <listitem>
            <para>PS/2 Tastatur und Maus</para>
          </listitem>
        </itemizedlist>

      <para>Die ersten Maschinen waren mit Fast SCSI Kontrollern
        ausger&uuml;stet, sp&auml;tere Maschinen unterst&uuml;tzen
        Ultra SCSI.  Bei der AS500 wird der eine zur Verf&uuml;gung
        stehende SCSI-Bus sowohl f&uuml;r die internen als auch
        f&uuml;r die externen Ger&auml;te benutzt.  Bei einem Fast
        SCSI Bus darf der externe Teil des Busses maximal 1.8 Meter
        lang sein.  Man kann den AS500 Qlogic ISP1020A Chip auch im
        Ultra Modus betreiben, wenn man eine SRM Variable setzt.
        Allerdings h&auml;lt sich &os; an die Empfehlung aus den
        Errata zum Qlogic Chip und beschr&auml;nkt die
        Busgeschwindigkeit auf Fast.</para>

      <para>H&uuml;ten Sie sich bei der A500 vor uralten Versionen des
        SRM.  Wenn Ihnen solche unm&ouml;gliche SCSI-Geschwindigkeiten
        gemeldet werden, ist es Zeit f&uuml;r ein Update:</para>

      <programlisting>cd0 at isp0 bus 0 target 4 lun 0
cd0: &lt;DEC RRD45   DEC 0436&gt; Removable CD-ROM SCSI-2 device
cd0: 250.000MB/s transfers (250.000 MHz, offset 12)</programlisting>

      <para>Bei der AS600 versorgt einer der Qlogic SCSI Chips die
        internen Ger&auml;te, der andere ist f&uuml;r die externen
        SCSI Ger&auml;te zust&auml;ndig.</para>

      <para>Die DIMMs werden bei der AS500 in Vierergruppen installiert,
        allerdings sind die B&auml;nke ineinander verzahnt
        (<quote>physically interleaved layout</quote>). Eine Gruppe
        von 4 DIMMs besteht also <emphasis>nicht</emphasis> aus vier
        nebeneinanderliegenden DIMMs.  Denken Sie daran, da&szlig;
	Sie SDRAM DIMMs <emphasis>nicht</emphasis> verwenden
	k&ouml;nnen.</para>

      <para>Bei der AS600 sind die SIMMs auf zwei speziellen
        Speicherkarten untergebracht.  Die SIMM m&uuml;ssen in
        Achtergruppen installiert werden und beide Speicherkarten
        m&uuml;ssen identisch best&uuml;ckt werden.</para>

      <para>Bitte beachten Sie, da&szlig; die AS500 und AS600 EISA
        Maschinen sind.  Sie m&uuml;ssen also das EISA Configuration
        Utility (ECU) von Diskette starten, wenn Sie eine EISA-Karte
        in das System eingebaut haben oder wenn Sie die Konfiguration
        der eingebauten I/O &auml;ndern wollen.  Die AS500 hat zwar
        keinen EISA Steckplatz, trotzdem wird das ECU verwendet, um
        die eingebaute Audio-Hardware und &auml;hnliches zu
        konfigurieren.</para>

      <para>Sie k&ouml;nnen die eingebaute Audio-Hardware der AS500
        nutzen, wenn Sie die folgende Zeile in die Konfigurationsdatei
        f&uuml;r Ihren angepa&szlig;ten Kernel schreiben:</para>

      <programlisting>device pcm</programlisting>

      <para>Benutzen Sie danach das ECU, um die Audio-Hardware auf IRQ
	10, Port 0x530 und DRQ 0 einzustellen.  Sie m&uuml;ssen diese
	Werte ebenfalls in <filename>device.hints</filename> angeben,
	dazu kommt noch die Angabe flags 0x10011.</para>

      <para>Die PCI Steckpl&auml;tze der AS600 zeigen eine
        Besonderheit.  Die AS600 (um genau zu sein, die PCI
        Erweiterungskarte mit den SCSI Kontrollern) erlaubt die
        Einblendung von I/O Ports nicht, alle Ger&auml;te hinter
        dieser Karte m&uuml;ssen memory mapping verwenden. Wenn Sie
        Probleme haben, die Qlogic SCSI Adapter zum laufen zu
        bringen, m&uuml;ssen Sie die folgende Zeile in die Datei
        <filename>/boot/loader.rc</filename> einf&uuml;gen:</para>

      <programlisting>set isp_mem_map=0xff</programlisting>

      <para>Eventuell m&uuml;ssen Sie diese Zeile schon im Boot Loader
        eingeben, bevor Sie den Kernel f&uuml;r die Installation
        laden.</para>

      <para>Die Konfigurationsdatei f&uuml;r einen angepa&szlig;ten
        Kernel f&uuml;r die AlphaStation-[56]00 mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_KN20AA
cpu     EV5</programlisting>
    </sect3>

    <sect3>
      <title>AlphaServer 1000 (<quote>Mikasa</quote>), 1000A
        (<quote>Noritake</quote>) und 800
        (<quote>Corelle</quote>)</title>

      <para>Die Systeme der Modellreihen AlphaServer 1000 und 800 sind
        als Server f&uuml;r Abteilungen konzipiert.  Es gibt sie mit
        einer Reihe verschiedener Geh&auml;use und CPUs.  Ganz
        allgemein gibt es Maschinen mit der 21064 (EV4) CPU und Maschinen mit der
        21164 (EV5) CPU.  Die CPU sitzt auf einer eigenen Karte, und
        der m&ouml;gliche CPU-Typ (EV4 und EV5) h&auml;ngt vom
        verwendetem Mainboard ab.</para>

      <para>Beim AlphaServer 800 wurde ein deutlich kleineres
        Mini-Tower Geh&auml;use verwendet, ihm fehlt auch das
        StorageWorks SCSI hot-plug System.  Der Hauptunterschied
        zwischen der AS1000 und der AS1000A liegt darin, da&szlig; die
        AS1000A 7 PCI Steckpl&auml;tze hat, w&auml;hrend bei der
        AS1000 nur 3 PCI Steckpl&auml;tze zur Verf&uuml;gung stehen,
        und der Rest EISA Steckpl&auml;tze sind.</para>

      <para>Die AS800 mit einer EV5/400 MHz CPU wurde sp&auml;ter
        unter der Bezeichnung <quote>DIGITAL Server 3300[R]</quote>
        verkauft, aus der AS800 mit einer EV5/500 MHz CPU wurde der
        <quote>DIGITAL Server 3305[R]</quote>.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21064 EV4[5] CPU mit 200, 233 oder 266 MHz 21164
            EV5[6] CPU mit 300, 333 oder 400 MHz (nur AS800: 500
            MHz)</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>Bandbreite: 128 Bit, ECC</para>
            </listitem>

            <listitem>
              <para>AS1000[A]:</para>

              <itemizedlist>
                <listitem>
                  <para>72polige, 36 Bit breite Fast Page Mode SIMMs,
                    70ns oder schneller</para>
                </listitem>

                <listitem>
                  <para>16 (EV5 Systeme) oder 20 (EV4 Systeme) SIMM
                    Steckpl&auml;tze</para>
                </listitem>

                <listitem>
                  <para>Maximaler Speicherausbau 1 GB</para>
                </listitem>

                <listitem>
                  <para>nutzt ECC</para>
                </listitem>
              </itemizedlist>
            </listitem>

            <listitem>
              <para>AS800: Benutzt EDO DIMMs, 60 ns, 3.3 Volt</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>VGA eingebaut (nur bei einigen Mainboards)</para>
        </listitem>

        <listitem>
          <para>3 PCI, 2 EISA, 1 64-Bit PCI/EISA kombiniert
            (AS800)</para>
        </listitem>

        <listitem>
          <para>7 PCI, 2 EISA (AS1000A)</para>
        </listitem>

        <listitem>
          <para>2 PCI, 1 EISA/PCI, 7 EISA (AS1000)</para>
        </listitem>

        <listitem>
          <para>SCSI eingebaut, basiert auf einem Symbios 810 [AS1000]
            oder Qlogic 1020 [AS1000A]</para>
        </listitem>
      </itemizedlist>

      <para>Die AS1000 Systeme gibt in vielen verschiedenen
        Geh&auml;usevarianten. Frei stehend, Rack-Einbau, mit oder ohne
        StorageWorks SCSI System, usw.  Die <quote>Elektronik</quote> ist bei allen
        gleich.</para>

      <para>AS1000 Maschinen: Alle Maschinen mit der EV4 verwenden normale
        PS/2 SIMMs (36 Bit, 72 Pin) in F&uuml;nfergruppen.  Das
        f&uuml;nfte wird f&uuml;r ECC benutzt.  Alle Maschinen mit der EV5
        verwenden normale PS/2 SIMM (36 Bit, 72 Pin) in Vierergruppen.
        Der ECC nutzt die 4 &uuml;berz&auml;hligen Bits der SIMMs (4
        Bit von 36 Bit).  Die EV5 Mainboards haben 16 Steckpl&auml;tze
        f&uuml;r SIMMs, die EV4 Mainboards haben 20 Steckpl&auml;tze
        f&uuml;r SIMMs.</para>

      <para>Die AS800 Systeme verwenden DIMMs in Vierergruppen, dabei
        mu&szlig; in den mit <quote>Bank 0</quote> gekennzeichneten
        Steckpl&auml;tzen begonnen werden.  Eine Speicherbank besteht
        aus vier nebeneinanderliegenden Steckpl&auml;tzen.  Wenn
        verschieden gro&szlig;e DIMMs installiert werden, m&uuml;ssen
        die gr&ouml;&szlig;eren in Bank 0 installiert werden.  Der
        maximale Speicherausbau betr&auml;gt 2 GByte.  Beachten Sie,
        da&szlig; EDO DIMMs verwendet werden m&uuml;ssen.</para>

      <para>Die AS1000/800 verh&auml;lt sich etwas st&ouml;rrisch,
        wenn man an Ihr eine serielle Konsole verwenden will.  Sie
        m&uuml;ssen auf jeden Fall folgendes im SRM eingeben:</para>

      <screen>&gt;&gt;&gt; <userinput>SET CONSOLE SERIAL</userinput></screen>

      <para>um die serielle Konsole verwenden zu k&ouml;nnen.  Wie bei den
      meisten anderen Alphas reicht es nicht aus, wenn man nur die
      Tastatur abzieht.  Um wieder auf die graphische Konsole
      umzuschalten, m&uuml;ssen Sie an den Befehl</para>

      <screen>&gt;&gt;&gt; <userinput>SET CONSOLE GRAPHICS</userinput></screen>

      <para>an der seriellen Konsole eingeben.</para>

      <para>Wenn Sie eine AS800 besitzen, sollten Sie auf jeden Fall
        pr&uuml;fen, ob Ihr Ultra-Wide SCSI Bus auch wirklich den Ultra
        Modus nutzt.  Dazu ben&ouml;tigen Sie das Programm
        <filename>EEROMCFG.EXE</filename>, das Sie auf der
        <quote>Konsole Firmware Upgrade CDROM</quote> finden.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel eines
        AlphaServer1000/1000A/800 mu&szlig; die folgenden Zeilen
        enthalten:</para>

      <programlisting>options   DEC_1000A
cpu     EV4  # je nach installierter CPU
cpu     EV5  # je nach installierter CPU</programlisting>
    </sect3>

    <sect3>
      <title>DS10/VS10/XP900 (<quote>Webbrick</quote>) / XP1000
        (<quote>Monet</quote>) / DS10L (<quote>Slate</quote>)</title>

      <para>Die Modelle Webbrick und Monet sind leistungsstarke
        Workstations und Server, auf der Basis der EV6 und des Tsunami
        Chipsatzes.  Der Tsunami Chipsatz wird auch in den
        leistungsst&auml;rksten Systemen genutzt und bietet daher mehr
        als genug Leistung.  Eigentlich handelt es sich bei der DS10,
        VS10 und XP900 trotz der unterschiedlichen Namen nur um ein
        System.  Die Unterschiede liegen in der Software und den
        angebotenen Erweiterungen.  Die DS10L basiert auf der DS10,
        das Geh&auml;use ist jedoch f&uuml;r den Einbau in ein Rack
        vorgesehen und nur 1HE hoch.  Diese Maschine ist f&uuml;r ISPs
        und HPTC Cluster (wie zum Beispiel Beowulf) gedacht.</para>

      <sect4>
        <title><quote>Webbrick / Slate</quote></title>

        <itemizedlist>
          <listitem>
            <para>21264 EV6 CPU, 466 MHz</para>
          </listitem>

          <listitem>
            <para>L2 / Bcache: 2MB, ECC</para>
          </listitem>

          <listitem>
            <para>Speicherzugriff: 128 Bit via crossbar, Transferrate
              1.3GB/sec </para>
          </listitem>

          <listitem>
            <para>Speicher:</para>

            <itemizedlist>
              <listitem>
                <para>Standard SDRAM DIMM, gepuffert, ECC, 200 Pin, 83
                  MHz</para>
              </listitem>

              <listitem>
                <para>4 DIMM Steckpl&auml;tze in der DS10; maximaler
                  Speicherausbau 2GByte</para>
              </listitem>

              <listitem>
                <para>2 DIMM Steckpl&auml;tze in der DS10L; maximaler
                  Speicherausbau 1 GByte</para>
              </listitem>

              <listitem>
                <para>DIMMs m&uuml;ssen paarweise installiert
                  werden</para>
              </listitem>
            </itemizedlist>
          </listitem>

          <listitem>
            <para>21271 Core Logic Chipsatz
              (<quote>Tsunami</quote>)</para>
          </listitem>

          <listitem>
            <para>2 eingebaute 21143 Fast Ethernet Kontroller</para>
          </listitem>

          <listitem>
            <para>AcerLabs M5237 (Aladdin-V) USB Kontroller
              (deaktiviert)</para>
          </listitem>

          <listitem>
            <para>AcerLabs M1533 PCI-ISA bridge</para>
          </listitem>

          <listitem>
            <para>AcerLabs Aladdin ATA-33 Kontroller </para>
          </listitem>

          <listitem>
            <para>zwei eingebaute EIDE-Kan&auml;le</para>
          </listitem>

          <listitem>
            <para>Erweiterungen: 3 64-Bit PCI Steckpl&auml;tze und 1
              32-Bit PCI Steckplatz; die DS10L hat einen 64-Bit PCI
              Steckplatz</para>
          </listitem>

          <listitem>
            <para>2 serielle Anschl&uuml;sse, 16550A</para>
          </listitem>

          <listitem>
            <para>1 paralleler Anschlu&szlig;</para>
          </listitem>

          <listitem>
            <para>2 USB Anschl&uuml;sse</para>
          </listitem>

          <listitem>
            <para>PS/2 Tastatur und Maus</para>
          </listitem>
        </itemizedlist>

        <para>Die Systeme verf&uuml;gen &uuml;ber eine
          <quote>intelligente</quote> Spannungsversorgung.  Mit
          anderen Worten, selbst wenn Sie das System ausschalten,
          stehen Teile des Systems immer noch unter Strom (wie bei
          einem PC mit ATX-Netzteil).  Wenn Sie Arbeiten an der
          Hardware durchf&uuml;hren wollen, m&uuml;ssen Sie also den
          Netzstecker ziehen.</para>

        <para>Diese Spannungsversorgung wird RMC genannt.
          Wenn sie aktiviert ist, gelangen Sie durch die Eingabe von
          <keycap>Escape</keycap> <keycap>Escape</keycap> RMC auf dem
          seriellen Anschlu&szlig; 1 zur Eingabeaufforderung der RMC.
          Mit der RMC k&ouml;nnen Sie das System ausschalten,
          einschalten, neu starten, die Temperatur &uuml;berwachen,
          die Grenzwerte f&uuml;r die Temperatur einstellen und vieles
          mehr.  Die RMC hat eine eigene Onlinehilfe.</para>

        <para>Die Webbrick befindet sich in einem Desktop-&auml;hnlichem
          Geh&auml;use, das dem der &auml;lteren 21164
          <quote>Maverick</quote> Workstations gleicht, aber deutlich
          besseren Zugang zu den Komponenten gew&auml;hrt.  Wenn Sie
          eine Server-Farm aufbauen wollen, k&ouml;nnen Sie die
          Webbrick auch in ein Rack einbauen, sie belegt 3
          H&ouml;heneinheiten.  Die Slate ist nur eine
          H&ouml;heneinheit hoch, hat aber auch nur einen PCI
          Steckplatz.</para>

        <para>Die DS10 besitzt 4 Steckpl&auml;tze f&uuml;r DIMMs.
          DIMMs m&uuml;ssen paarweise installiert werden; dabei
          m&uuml;ssen Sie darauf achten, da&szlig; die Paare verzahnt
          sind und daher die beiden DIMMs eines Paares nicht
          nebeneinander liegen. Sie k&ouml;nnen 32, 64, 128, 256 und
          512 MByte gro&szlig;e DIMMs
          verwenden.</para>

        <para>Wenn in einer DS10 zwei Paare aus gleich gro&szlig;en
          DIMMs installieren, greift das System abwechselnd auf die
          beiden Speicherb&auml;nke zu, um die Leistung zu steigern
          (memory interleaving).  Diese Option steht bei der DS10L
          nicht zur Verf&uuml;gung, da Sie nur zwei Steckpl&auml;tze
          f&uuml;r DIMMs hat.</para>

        <para>Seit der Version 5.9 der SRM Firmware k&ouml;nnen Sie
          auch von Hostadaptern aus der Adaptec 2940-Familie booten
          und sind nicht mehr auf die normalerweise verwendeten Qlogic
          und Symbios/NCR Hostadapter eingeschr&auml;nkt.</para>

        <para>Im Basismodell ist eine FUJITSU 9.5GB ATA Festplatte
          eingebaut, von der das System auch bootet.  Auf der Webbrick
          k&ouml;nnen Sie &os; mit EIDE Festplatten einsetzen.  Auf
          dem Mainboard der DS10 stehen zwei IDE Anschl&uuml;sse zur
          Verf&uuml;gung.  Die f&uuml;r den Betrieb mit Tru64 Unix
          oder VMS vorgesehenen Systeme wurden
          standardm&auml;&szlig;ig mit Ultra-SCSI Festplatten an
          Qlogic Hostadaptern ausger&uuml;stet.</para>

        <para>Die PCI-Steckpl&auml;tze unterst&uuml;tzen 32 Bit und 64
          Bit Karten, sowohl die 3.3V als auch die 5V
          Variante.</para>

        <para>Die USB Anschl&uuml;sse werden nicht unterst&uuml;tzt
          und von allen aktuellen Versionen der SRM Konsole
          deaktiviert.</para>

        <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig;
          die folgenden Zeilen enthalten:</para>

        <programlisting>options   DEC_ST6600
cpu     EV5</programlisting>

        <note>
          <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
            notwendig, <literal>cpu EV6</literal> anzugeben.  Das
            <literal>cpu EV5</literal> ist nur notwendig, damit
            &man.config.8; nicht meckert.</para>
        </note>
      </sect4>

      <sect4>
        <title><quote>Monet</quote></title>

        <itemizedlist>
          <listitem>
            <para>21264 EV6, 500 MHz;  21264 EV67, 500 oder 667 MHz
              (XP1000G, Code-Name Brisbane); die CPU steckt auf einer
              eigenen Karte, die vor Ort ausgewechselt werden
              kann</para>
          </listitem>

          <listitem>
            <para>L2 / Bcache: 4MB, ECC</para>
          </listitem>

          <listitem>
            <para>Speicherzugriff: 256 Bit</para>
          </listitem>

          <listitem>
            <para>Speicher: 128 oder 256 MByte 100 MHz (PC100) 168 Pin
              JEDEC standard, registered ECC SDRAM DIMMs</para>
          </listitem>

          <listitem>
            <para>21271 Core Logic Chipsatz
              (<quote>Tsunami</quote>)</para>
          </listitem>

          <listitem>
            <para>eingebauter Ethernet-Kontroller auf Basis des 21143
              </para>
          </listitem>

          <listitem>
            <para>Cypress 82C693 USB Controller</para>
          </listitem>

          <listitem>
            <para>Cypress 82C693 PCI-ISA Bridge</para>
          </listitem>

          <listitem>
            <para>Cypress 82C693 Controller</para>
          </listitem>

          <listitem>
            <para>Erweiterungsm&ouml;glichkeiten: 2 getrennte PCI
              Busse, die von schnell I/O Kan&auml;len
              (<quote>hoses</quote>) angesteuert werden:</para>

            <itemizedlist>
              <listitem>
                <para>hose 0: (die oberen 3 Steckpl&auml;tze) 2 64-Bit
                  PCI Steckpl&auml;tze 1 32-Bit PCI Steckpl&auml;tze
                  </para>
              </listitem>

              <listitem>
                <para>hose 1: (die unteren 2 Steckpl&auml;tze) 2
                  32-Bit PCI Steckpl&auml;tze (hinter einer 21154
                  PCI-PCI Bridge) </para>
              </listitem>

              <listitem>
                <para>2 der 64-Bit PCI Steckpl&auml;tze sind f&uuml;r
                  Karten mit voller Baul&auml;nge gedacht</para>
              </listitem>

              <listitem>
                <para>alle 32-Bit PCI Steckpl&auml;tze sind nur
                  f&uuml;r kurze Karten geeignet</para>
              </listitem>

              <listitem>
                <para>einer der 32-Bit PCI Steckpl&auml;tze
                  &uuml;berlappt mit einem der ISA
                  Steckpl&auml;tze</para>
              </listitem>

              <listitem>
                <para>alle PCI Steckpl&auml;tze werden mit 33 MHz
                  angesteuert</para>
              </listitem>
            </itemizedlist>
          </listitem>

          <listitem>
            <para>1 Ultra-Wide SCSI Anschlu&szlig; an einem Qlogic
              1040</para>
          </listitem>

          <listitem>
            <para>2 serielle Anschl&uuml;sse, 16550A</para>
          </listitem>

          <listitem>
            <para>1 paralleler Anschlu&szlig;</para>
          </listitem>

          <listitem>
            <para>PS/2 Tastatur und Maus</para>
          </listitem>

          <listitem>
            <para>eingebautes 16-Bit ESS ES1888 Audiosystem</para>
          </listitem>

          <listitem>
            <para>2 USB Anschl&uuml;sse</para>
          </listitem>

          <listitem>
            <para>Grafik: ELSA Gloria Synergy oder DEC/Compaq
              PowerStorm 3D Beschleuniger Karten (wahlweise)</para>
          </listitem>
        </itemizedlist>

        <para>Das Geh&auml;use der Monet ist &auml;hnlich einem
          Mini-Tower, fast so wie bei der Miata.</para>

        <para>Der eingebaute Qlogic UW-SCSI Kontroller erlaubt bis zu 4
          interne Ger&auml;te. Ein externer Anschlu&szlig; ist nicht
          vorhanden.</para>

        <para>Wenn Sie eine 500 MHz CPU verwenden, k&ouml;nnen Sie
          auch 83 MHz DIMMs verwenden, obwohl laut Compaq f&uuml;r
          alle CPUs PC100 DIMMs verlangt. DIMMs m&uuml;ssen in
          Vierergruppen installiert werden, dabei mu&szlig; mit den
          mit <quote>0</quote> markierten Steckpl&auml;tzen begonnen
          werden.  Der maximale Speicherausbau betr&auml;gt 4 GByte.
          Die DIMMs m&uuml;ssen <quote>physically interleaved</quote>
          installiert werden, beachten Sie die Markierungen neben den
          Steckpl&auml;tzen.  Die Breite des Speichers bei der Monet
          ist doppelt so gro&szlig; wie bei der Webbrick.  Die DIMMs
          sind auf derselben Karte wie die CPU untergebracht.  Bitte
          beachten Sie, da&szlig; ECC RAM verwendet wird, Sie
          ben&ouml;tigen also 72 Bit DIMMs (und nicht die normalen 64
          Bit PC DIMMs).</para>

        <para>Die EIDE Ger&auml;te k&ouml;nnen sowohl vom SRM als
          Bootdevice als auch von &os; genutzt werden.  Obwohl der
          eingesetzt Cypress Chip 2 EIDE Kan&auml;le bereitstellt,
          wird in der Monet nur einer davon unterst&uuml;tzt.</para>

        <para>Die USB Anschl&uuml;sse werden von &os;
          unterst&uuml;tzt.  Sollten Sie Probleme mit der Nutzung der
          USB Anschl&uuml;sse haben, sollten Sie nachsehen, ob die SRM
          Variable <varname>usb_enable</varname> auf
          <literal>on</literal> steht.  Sie k&ouml;nnen die
          Einstellung mit dem folgenden Befehl &auml;ndern:</para>

        <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET USB_ENABLE ON</userinput></screen>

        <important>
          <para>Versuchen Sie nicht, einen SCSI-Kontroller mit
            Symbios-Chipsatz in einem der PCI-Steckpl&auml;tze an Hose
            1 zu benutzen.  Ein noch nicht genau lokalisiertes
            Problem von &os; sorgt in dieser Konstellation f&uuml;r
            Probleme.</para>
        </important>

        <important>
          <para>Einige VGA Karten funktionieren hinter der PCI-PCI
            Bridge (in den Steckpl&auml;tzen 4 und 5) nicht. Hier
            k&ouml;nnen Sie nur Karten verwenden, die das
            <quote>VGA-legacy addressing</quote> richtig implementiert
            haben.  Benutzen Sie im Notfall einfach einen der
            PCI-Steckpl&auml;tze <quote>vor</quote> der
            Bridge.</para>
        </important>

        <para>Die Audio-Hardware wird zur Zeit nicht von &os;
          unterst&uuml;tzt.</para>

        <para>Die folgenden Zeilen m&uuml;ssen in der
          Konfigurationsdatei f&uuml;r den angepa&szlig;ten Kernel
          enthalten sein:</para>

        <programlisting>options   DEC_ST6600
cpu     EV5</programlisting>

        <note>
          <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
            notwendig, <literal>cpu EV6</literal> anzugeben.  Das
            <literal>cpu EV5</literal> ist nur notwendig, damit
            &man.config.8;  nicht meckert.</para>
        </note>
      </sect4>
    </sect3>

    <sect3>
      <title>DS20/DS20E (<quote>Goldrush</quote>)</title>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21264 EV6 CPU, 500 oder 670 MHz</para>
        </listitem>

        <listitem>
          <para>maximal zwei CPUs pro System</para>
        </listitem>

        <listitem>
          <para>L2 / Bcache: 4 MByte pro CPU</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: Dual 256 Bit wide with crossbar
            switch</para>
        </listitem>

        <listitem>
          <para>Speicher:</para>

          <itemizedlist>
            <listitem>
              <para>SDRAM DIMMs</para>
            </listitem>

            <listitem>
              <para>werden in Vierergruppen installiert</para>
            </listitem>

            <listitem>
              <para>16 DIMM Steckpl&auml;tze, maximal 4 GByte</para>
            </listitem>

            <listitem>
              <para>ECC</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para>21271 Core Logic Chipsatz
            (<quote>Tsunami</quote>)</para>
        </listitem>

        <listitem>
          <para>eingebauter Adaptec ? Wide Ultra SCSI
            Hostadapter</para>
        </listitem>

        <listitem>
          <para>Erweiterungen:</para>

          <itemizedlist>
            <listitem>
              <para>2 getrennte PCI Busse, die von schnellen I/O
                Kan&auml;len (<quote>hoses</quote>) angesteuert
                werden:</para>
            </listitem>

            <listitem>
              <para>6 64-Bit PCI Steckpl&auml;tze, 3 pro hose</para>
            </listitem>

            <listitem>
              <para>1 ISA Steckplatz</para>
            </listitem>
          </itemizedlist>
        </listitem>
      </itemizedlist>

      <para>Bei der DS20 m&uuml;ssen Sie </para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET CONSOLE SERIAL</userinput></screen>

      <para>eingeben, damit die serielle Konsole aktiv wird; es reicht
        nicht aus, die Tastatur abzuziehen.  Um wieder zur
        graphischen Konsole umzuschalten, m&uuml;ssen Sie </para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET CONSOLE GRAPHICS</userinput></screen>

      <para>an der seriellen Konsole.  Lassen Sie sich bitte nicht
        davon verwirren, da&szlig; die Meldungen der SRM Konsole auf
        der graphischen Konsole erscheinen, obwohl Sie auf die
        serielle Konsole umgeschaltet haben.  Sobald Sie &os; starten,
        beachtet es die Einstellung f&uuml;r
        <literal>CONSOLE</literal> und alle Meldungen beim Systemstart
        und das Login erscheinen auf der seriellen Konsole.</para>

      <para>Das Geh&auml;use der DS20 ist gro&szlig; und wie ein
        W&uuml;rfel geformt.  Im Geh&auml;use ist unter anderem ein
        StorageWorks SCSI hot-swap System eingebaut, da&szlig;
        maximal sieben 3.5&quot; SCSI Festplatten aufnehmen kann.  Das
        Geh&auml;use der DS20E ist kleiner, da das StorageWorks System
        fehlt.</para>

      <para>Die Systeme verf&uuml;gen &uuml;ber eine
        <quote>intelligente</quote> Spannungsversorgung.  Mit anderen
        Worten, selbst wenn Sie das System ausschalten, stehen Teile
        des Systems immer noch unter Strom (wie bei einem PC mit
        ATX-Netzteil).  Wenn Sie Arbeiten an der Hardware
        durchf&uuml;hren wollen, m&uuml;ssen Sie also den Netzstecker
        ziehen.</para>

      <para>Diese Spannungsversorgung wird RMC genannt.
        Wenn sie aktiviert ist, gelangen Sie durch die Eingabe von
        <keycap>Escape</keycap> <keycap>Escape</keycap> RMC auf dem
        seriellen Anschlu&szlig;  1 zur Eingabeaufforderung der RMC.
        Mit der RMC k&ouml;nnen Sie das System ausschalten,
        einschalten, neu starten, die Temperatur &uuml;berwachen, die
        Grenzwerte f&uuml;r die Temperatur einstellen und vieles mehr.
        Die RMC hat eine eigene Onlinehilfe.</para>

      <para>Der eingebaute Adaptec SCSI Hostadapter ist bei der DS20
        abgeschaltet und kann daher nicht mit &os; genutzt
        werden.</para>

      <para>Seit der Version 5.9 der SRM Firmware k&ouml;nnen Sie auch
        von Hostadaptern aus der Adaptec 2940-Familie booten und sind
        nicht mehr auf die normalerweise verwendeten Qlogic und
        Symbios/NCR Hostadapter eingeschr&auml;nkt.</para>

      <para>Wenn Sie verschieden gro&szlig;e DIMMs benutzen,
        m&uuml;ssen Sie die gr&ouml;&szlig;ten Module in die mit
        <literal>0</literal> gekennzeichneten Steckpl&auml;tze
        einsetzen.  Au&szlig;erdem m&uuml;ssen Sie die
        Steckpl&auml;tze <quote>der Reihe nach</quote> benutzen, also
        erst Bank 0, dann Bank 1, und so weiter.</para>

      <para>Versuchen Sie nicht, einen SCSI-Kontroller mit
        Symbios-Chipsatz in einem der PCI-Steckpl&auml;tze an Hose 1
        zu benutzen.  Ein noch nicht genau lokalisiertes Problem von
        &os;  sorgt in dieser Konstellation f&uuml;r Probleme.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_ST6600
cpu     EV5</programlisting>

      <note>
        <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
          notwendig, <literal>cpu EV6</literal> anzugeben.  Das
          <literal>cpu EV5</literal> ist nur notwendig, damit
          &man.config.8;  nicht meckert.</para>
      </note>
    </sect3>

    <sect3>
      <title>AlphaPC 264DP / UP2000</title>

      <para>Die UP2000 wird von der Firma Alpha Processor Inc.
        gebaut</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21264 EV6 CPU, 670 MHz</para>
        </listitem>

        <listitem>
          <para>maximal zwei CPUs pro System</para>
        </listitem>

        <listitem>
          <para>L2 / Bcache: 4 MByte pro CPU</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 256 Bit</para>
        </listitem>

        <listitem>
          <para>Speicher: SDRAM DIMMs, Vierergruppen, ECC, 16 DIMM
            Steckpl&auml;tze, maximal 4GB</para>
        </listitem>

        <listitem>
          <para>21272 Core Logic Chipsatz
            (<quote>Tsunami</quote>)</para>
        </listitem>

        <listitem>
          <para>eingebauter Adaptec AIC7890/91 Wide Ultra SCSI
            Hostadapter</para>
        </listitem>

        <listitem>
          <para>2 embedded IDE based on Cypress 82C693 chips</para>
        </listitem>

        <listitem>
          <para>USB mit Cypress 82C693</para>
        </listitem>

        <listitem>
          <para>Erweiterungen:</para>

          <itemizedlist>
            <listitem>
              <para>2 getrennte PCI Busse, die von schnellen I/O
                Kan&auml;len (<quote>hoses</quote>) angesteuert
                werden</para>
            </listitem>

            <listitem>
              <para>6 64-Bit PCI Steckpl&auml;tze, 3 pro hose</para>
            </listitem>

            <listitem>
              <para>1 ISA Steckplatz</para>
            </listitem>
          </itemizedlist>
        </listitem>
      </itemizedlist>

      <para>Zur Zeit unterst&uuml;tzt &os; nur maximal 2 GByte Speicher.</para>

      <para>Der eingebaute Adaptec Hostadapter kann zwar nicht zum
        booten verwendet werden, mit &os; kann er allerdings f&uuml;r
        reine Datenplatten benutzt werden.</para>

      <para>Busmaster DMA wird von auf dem ersten IDE-Anschlu&szlig;
        unterst&uuml;tzt.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_ST6600
cpu     EV5</programlisting>

      <note>
        <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
          notwendig, <literal>cpu EV6</literal> anzugeben.  Das
          <literal>cpu EV5</literal> ist nur notwendig, damit
          &man.config.8;  nicht meckert.</para>
      </note>
    </sect3>

    <sect3>
      <title>AlphaServer 2000 (<quote>DemiSable</quote>), 2100
      (<quote>Sable</quote>), 2100A (<quote>Lynx</quote>)</title>

      <para>Die AlphaServer 2[01]00 sind als Server f&uuml;r ganze
        Abteilungen gedacht, <quote>medium iron</quote> halt.  Alle
        Maschinen unterst&uuml;tzen mehrere CPUs, Sie k&ouml;nnen bis
        zu zwei (AS2000) oder vier (AS2100[A]) CPU installieren.  Es
        gibt sowohl frei stehende als auch f&uuml;r den Einbau in ein
        19&quot;-Rack vorgesehene Varianten.  Die Unterschiede
        zwischen beiden Versionen erstrecken sich auf die Anzahl der
        Steckpl&auml;tze, die maximale Anzahl an CPU, und den
        maximalen Speicherausbau.  Bei einigen Systemen ist ein
        StorageWorks System integriert, das den Austausch der
        SCSI-Festplatten im laufenden Betrieb erlaubt.
        Zwischenzeitlich wurde der Aufstieg von der Sable zur Lynx
        durch Austausch der I/O-Backplane angeboten (die C-Bus
        Backplane verblieb im System).  Schnellere CPUs wurden
        ebenfalls angeboten.</para>

      <itemizedlist>
        <listitem>
          <para>21064 EV4[5] CPU[s], 200, 233, 275 MHz oder 21164
            EV5[6] CPU[s]s, 250, 300, 375, 400 MHz</para>
        </listitem>

        <listitem>
          <para>Cache: Je nach CPU 1, 4 oder 8 MByte pro CPU</para>
        </listitem>

        <listitem>
          <para>eingebauter Kontroller f&uuml;r ein 2.88 MByte
            Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>10MBit 21040 Ethernet eingebaut [nur AS2100]</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>PS/2 Tastatur und Maus</para>
        </listitem>
      </itemizedlist>

      <para>Die 200 MHz CPUs werden in Wirklichkeit nur mit 190 MHz
        betrieben.  Es k&ouml;nnen maximal 4 CPUs eingebaut werden,
        die allerdings identisch sein m&uuml;ssen
        (Typ/Geschwindigkeit).</para>

      <para>Wenn einer der Prozessoren einmal einen Fehler verursacht
        hat und als defekt markiert ist, bleibt dieser Status
        bestehen, auch wenn man die CPU austauscht (oder neu
        einsetzt), bis Sie das folgende Kommando eingeben</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>CLEAR_ERROR ALL</userinput></screen>

      <para>und die Maschine aus- und wieder einschalten.  Dies gilt
        wahrscheinlich auch f&uuml;r die anderen Subsysteme (IO und
        Speicher), allerdings konnte dies ungetestet.</para>

      <para>Bei den Systemen werden spezialisierte Speicherkarten
        verwendet, die sich einen 128 Bit breiten C-Bus mit den
        CPU-Karten teilen.  Der maximale Speicherausbau betr&auml;gt 1
        GByte (DemiSable) bzw. 2 GByte (Sable).  Einer der
        Steckpl&auml;tze auf dem Speicher-Bus kann entweder eine CPU-
        oder eine Speicher-Karte aufnehmen.  Bei einem Maschine mit 4
        CPUs k&ouml;nnen maximal zwei Speicherkarten verwendet
        werden.</para>

      <para>Einige Versionen der Speicherkarten sind f&uuml;r die
        Aufnahme von SIMMs vorgesehen und werden als <quote>SIMM
        carriers</quote> bezeichnet.  Bei anderen Speicherkarten
        wurden die Speicherbausteine direkt auf die Platine
        gel&ouml;tet, was die Bezeichnung <quote>flat memory
        modules</quote> erkl&auml;rt.</para>

      <para>SIMM werden in Gruppen von acht 72-Pin, 36 Bit, 70 ns FPM
        Modulen verwendet.  Es wurden nur zwei Typen von SIMMs
        unterst&uuml;tzt, 1 M x 36 Bit (4 MByte) und 4M x 36 Bit (16
        MByte). Jede Speicherkarte kann bis zu vier SIMM-B&auml;nke
        aufnehmen.  Die Verwendung verschieden gro&szlig;er SIMMs auf
        einer Speicherkarte ist nicht erlaubt.  Sie m&uuml;ssen eine
        Speicherkarte erst komplett best&uuml;cken, bevor Sie die
        n&auml;chste Karte einbauen.  Da zwischen den
        Steckpl&auml;tzen f&uuml;r die Karten nicht sehr viel Platz,
        sollten Sie auf die physische Gr&ouml;&szlig;e der SIMMs
        achten (bevor Sie sie kaufen...)</para>

      <para>Sowohl die Lynx als auch die Sable sind etwas
        st&ouml;rrisch, wenn es um die serielle Konsole geht.  Sie
        m&uuml;ssen den folgenden Befehl eingeben, um eine
        serielle Konsole benutzen zu k&ouml;nnen:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput> SET CONSOLE SERIAL</userinput></screen>

      <para>Wie bei vielen anderen Alphas reicht es nicht aus, einfach
        nur die Tastatur zu ziehen.  Um wieder auf die graphische
        Konsole umzuschalten, m&uuml;ssen Sie den folgenden Befehl
        eingeben:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET CONSOLE GRAPHICS</userinput></screen>

      <para>Bei der Lynx sollte sich die VGA Karte in einem der
        prim&auml;ren PCI-Steckpl&auml;tze befinden, EISA VGA Karten
        haben diese Einschr&auml;nkung nicht.</para>

      <para>Die Maschinen verf&uuml;gen &uuml;ber ein kleines LCD, das
        OCP (Operator Control Panel) genannt wird.  Beim Start des
        Systems werden hier die Meldungen der Testprogramme angezeigt.
        Sie k&ouml;nnen den auf dem OCP angezeigten Text &uuml;ber das
        SRM beeinflussen:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET OCP_TEXT "FreeBSD"</userinput></screen>

      <para>Das SRM Kommando</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SHOW FRU</userinput></screen>

      <para>zeigt Ihnen eine &Uuml;bersicht &uuml;ber die
        Konfiguration des Systems, inkl. der Seriennummern,
        Versionsnummer und Fehlerzahlen der einzelnen Module.</para>

      <para>Sable, DemiSable und Lynx verf&uuml;gen &uuml;ber einen
        eingebauten Fast SCSI-Controller vom Typ Symbios 810.  Wenn
        Sie pr&uuml;fen wollen, ob der Controller auf Fast SCSI
        eingestellt ist, sollten Sie das folgende Kommando
        benutzen:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SHOW PKA0_FAST</userinput></screen>

      <para>Wenn hier der Wert 1 angezeigt wird, wird Fast SCSI
        unterst&uuml;tzt.</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET PKA0_FAST 1</userinput></screen>

      <para>aktiviert diesen Modus</para>

      <para>Zusammen mit der AS2100[A] wird StorageWorks SCSI Modul
        mit 7 SCSI Steckpl&auml;tzen geliefert.  Ein zweites Modul
        kann in das Geh&auml;use eingebaut werden.  Bei der AS2000 gibt
        es nur ein Modul mit 7 Steckpl&auml;tzen, Erweiterungen sind
        nicht m&ouml;glich.  Bitte beachten Sie, da&szlig; die
        Zuordnung zwischen Steckpl&auml;tzen und SCSI ID in diesen
        Modulen anders ist als bei den normalen StorageWorks Modulen.
        Wenn Sie nur einen SCSI Bus konfiguriert haben, lautet die
        Reihenfolge von oben nach unten 0, 4, 1, 5, 2, 6, 3.</para>

      <para>Das Modul kann auch so konfiguriert werden, da&szlig; zwei
        unabh&auml;ngige SCSI Busse zur Verf&uuml;gung stehen.  Dieser
        Modus wird f&uuml;r RAID-Controller wie den KZPSC (Mylex
        DAC960) genutzt. In diesem Modus sind die Slot IDs wie folgt
        belegt: 0A, 0B, 1A, 1B, 2A, 2B, 3A, 3B (von oben nach unten),
        wobei A und B den SCSI-Bus angeben.  Bei einer Konfiguration
        mit nur einem SCSI-Bus geh&ouml;rt das Modul mit dem
        Terminator auf der R&uuml;ckseite nach OBEN, das Modul mit
        den Jumpern nach UNTEN.  Wenn Sie zwei SCSI-Busse verwenden,
        ist die Anordnung vertauscht.  Die Unterscheidung zwischen den
        beiden Modulen ist relativ einfach:  Auf dem Terminator-Modul
        befinden sich mehrere elektronische Bauteile, auf dem
        Jumper-Modul keine.</para>

      <para>Die DemiSable stellt 7 EISA und 3 PCI Steckpl&auml;tze zur
        Verf&uuml;gung, bei der Sable sind es 8 EISA und 3 PCI
        Steckpl&auml;tze. Die Lynx hat, weil Sie neuer ist, 8 PCI und
        3 EISA Steckpl&auml;tze.  Die PCI Steckpl&auml;tze der Lynx
        sind in Vierergruppen zusammengefa&szlig;t.  Die vier PCI
        Steckpl&auml;tze, die n&auml;her an der CPU liegen, sind die
        prim&auml;ren Steckpl&auml;tze, liegen also logisch vor der
        PCI Bridge.  Diese Steckpl&auml;tze tragen entgegen der
        Erwartung die h&ouml;heren Nummern (PCI4 bis PCI7).</para>

      <para>Sie m&uuml;ssen auf jeden Fall das EISA Configuration
        Utility (auf Diskette) benutzen, wenn Sie in den EISA
        Steckpl&auml;tzen Karten hinzugef&uuml;gt oder getauscht
        haben.  Dazu m&uuml;ssen Sie nur die Diskette mit dem ECU
        einlegen und den folgenden Befehl eingeben:</para>

      <screen><prompt>&gt;&gt;&gt;</prompt> <userinput>RUNECU</userinput></screen>

      <note>
        <para>Die EISA Steckpl&auml;tze werden zwar zur Zeit nicht
          unterst&uuml;tzt, aber die Compaq Qvision EISA VGA Karte
          wird als ISA Ger&auml;t behandelt werden und kann daher
          f&uuml;r die Konsole verwendet werden.</para>
      </note>

      <para>Es gab Entw&uuml;rfe f&uuml;r ein spezielles Extended I/O
        Modul, welches auf dem C-Bus eingesetzt werden sollte.  Es
        ist nicht bekannt, ob diese Module jemals gebaut wurden. Auf
        jeden Fall gibt es keine Daten, ob &os; sie
        unterst&uuml;tzt.</para>

      <para>Die Systeme k&ouml;nnen mit redundanten Netzteilen
        ausgestattet werden.  Beachten Sie, da&szlig; das Geh&auml;use
        mit einem Sicherheitsschalter versehen ist, der die Maschine
        abschaltet, sobald Sie das Geh&auml;use &ouml;ffnen.  Die
        L&uuml;fter der Maschinen sind geregelt.  Sobald ein System
        mit mehr als zwei CPUs und mehr als einer Speicherkarte
        ausgestattet ist, m&uuml;ssen Sie zwei Netzteile
        verwenden.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_2100_A500
cpu     EV4     #je nach verwendeter CPU
cpu     EV5     #je nach verwendeter CPU</programlisting>
    </sect3>

    <sect3>
      <title>AlphaServer 4x00 (<quote>Rawhide</quote>)</title>

      <para>Die AlphaServer 4x00 Systeme sind Server f&uuml;r kleinere
        Unternehmen, die entweder in einem 30&quot; (76 cm) hohen
        Schrank oder in einem 19&quot; Rack stecken.  Auch bei diesen
        Systemen handelt es sich um mittlere Datentechnik, nicht um
        Systeme f&uuml;r Hobbyisten.  Die Rawhides sind f&uuml;r den
        Einsatz von mehr als einer CPU vorgesehen, jedes System kann
        bis zu vier CPUs aufnehmen.  Die Grundversorgung mit
        Festplatten &uuml;bernehmen ein oder zwei StorageWorks Module
        im unteren Teil des Schrankes.  Die f&uuml;r den NT-Markt
        vorgesehenen Rawhides hei&szlig;en DIGITAL Server 7300 (5/400 CPU)
        und DIGITAL Server 7305 (5/533 CPU). Ein R am Ende der
        Typenbezeichnung deutet auf ein System hin, das in ein Rack
        eingebaut werden kann.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21164 EV5 CPUs, 266/300 MHz oder 21164A EV56 CPUs,
            400/466/533/600/666 MHz</para>
        </listitem>

        <listitem>
          <para>Cache: 4 MByte pro CPU.  Bei der EV5 300 MHz gab es
            auch eine Variante ohne Cache.  8 MByte bei der EV5
            600 MHz</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 128 Bit, ECC</para>
        </listitem>

        <listitem>
          <para>eingebauter Kontroller f&uuml;r ein
            Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>PS/2 Tastatur und Maus</para>
        </listitem>
      </itemizedlist>

      <para>Bei der Rawhide k&ouml;nnen bis zu 8 Speichermodule
        eingesetzt werden.  Die Module werden in Paaren eingesetzt und
        stellen dem Bus jeweils 72 Bit zur Verf&uuml;gung (inklusive
        der Bits f&uuml;r ECC).  Die Module k&ouml;nnen EDO RAM oder
        SDRAM sein.  Eine voll best&uuml;ckte Rawhide verf&uuml;gt &uuml;ber
        vier Paar Speichermodule.  Um die maximale Leistung zu erhalten,
        sollten Sie nach M&ouml;glichkeit SDRAM verwenden.  Das
        Speichermodul mit der gr&ouml;&szlig;ten Kapazit&auml;t
        mu&szlig; im Steckplatz 0 plaziert werden.  Eine Mischung aus
        EDO und SDRAM Speicher funktioniert auch (solange Sie nicht
        versuchen, innerhalb eines Paares EDO und SDRAM zu mischen).
        Allerdings f&uuml;hrt die gleichzeitige Verwendung von EDO und
        SDRAM dazu, da&szlig;  der <emphasis>gesamte</emphasis>
        Speicher im langsameren EDO-Modus angesteuert wird.</para>

      <para>Die Rawhide verf&uuml;gt &uuml;ber einen
        eingebauten Symbios 810 SCSI-Controller, der einen 8 Bit
        (narrow) fast-SCSI Bus bereitstellt und der im allgemeinen nur
        f&uuml;r das CDROM genutzt wird.</para>

      <para>F&uuml;r die Rawhides gibt es Erweiterungsmodule mit 8
        64-Bit PCI und 3 EISA Steckpl&auml;tzen (die sogenannten
        <quote>Saddle</quote> Module).  Sie verf&uuml;gen &uuml;ber
        zwei getrennte PCI-Busse, PCI0 und PCI1.  PCI0 stellt einen
        reinen PCI Steckplatz und drei PCI/EISA Steckpl&auml;tze zur
        Verf&uuml;gung.  PCI0 enth&auml;lt auch eine PCI/EISA bridge,
        die die seriellen und parallelen Schnittstellen, Tastatur,
        Maus, etc. ansteuert.  PCI1 stellt 4 PCI Steckpl&auml;tze und
        einen Symbios 810 SCSI Kontroller zur Verf&uuml;gung.  VGA
        Karten f&uuml;r die Konsole m&uuml;ssen an PCI0 angeschlossen
        werden.</para>

      <para>Die aktuellen Versionen von &os; haben Probleme mit den
        PCI Bridges.  Zur Zeit steht nur eine Notl&ouml;sung zur
        Verf&uuml;gung, die eine Bridge mit nur einem Ger&auml;t
        unterst&uuml;tzt.  Dadurch ist es m&ouml;glich, den von
        Digital eingebauten Qlogic SCSI Hostadapter zu benutzen, der
        hinter einer 21054 PCI Bridge sitzt.</para>

      <note>
        <para>Die EISA Steckpl&auml;tze werden zur Zeit nicht
          unterst&uuml;tzt, aber die Compaq Qvision EISA VGA Karte
          wird als ISA Ger&auml;t behandelt und kann daher f&uuml;r
          die Konsole benutzt werden.</para>
      </note>

      <para>Die Stromversorgung der Rawhide wird &uuml;ber einen
        I2C-Kontroller gesteuert.  Wenn Sie sicher sein wollen,
        da&szlig; kein Teil des Systems mehr unter Spannung steht,
        m&uuml;ssen Sie den Netzstecker ziehen.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_KN300
cpu     EV5</programlisting>
    </sect3>

    <sect3>
      <title>AlphaServer 1200 (<quote>Tincup</quote>) und AlphaStation
        1200 (<quote>DaVinci</quote>)</title>

      <para>Der AlphaServer 1200 ist der Nachfolger AlphaServer 1000A.
        Das Geh&auml;use ist mit dem des 1000A identisch, die
        Elektronik basiert allerdings auf der des AlphaServer 4000.
        Diese Systeme sind f&uuml;r den Einbau von bis zu zwei CPUs
        vorgesehen.  Die Grundversorgung mit Festplatten
        &uuml;bernimmt ein StorageWorks Modul.  Die f&uuml;r den
        NT-Markt vorgesehenen Varianten der AS1200 hei&szlig;en
        DIGITAL Server 5300 (5/400 CPU) und DIGITAL Server 5305 (5/533
        CPU).</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21164A EV56 CPUs, 400 oder 533 MHz</para>
        </listitem>

        <listitem>
          <para>Cache: 4 MByte pro CPU</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 128 Bit, ECC, DIMM Speicher auf zwei
            Speicherkarten</para>
        </listitem>

        <listitem>
          <para>eingebauter Kontroller f&uuml;r ein
            Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>PS/2 Tastatur und Maus</para>
        </listitem>
      </itemizedlist>

      <para>Die AS1200 nutzt 2 Speicherkarten mit je 8
        Steckpl&auml;tzen f&uuml;r DIMMs.  DIMMs m&uuml;ssen paarweise
        installiert werden.  Die Steckpl&auml;tze m&uuml;ssen der
        Reihe nach gef&uuml;llt werden. Wenn DIMMs mit verschiedenen
        Gr&ouml;&szlig;en verwendet werden, mu&szlig; Steckplatz 0 den
        gr&ouml;&szlig;ten DIMM enthalten. Die AS1200
        benutzt eine statische Anfangsadresse f&uuml;r die DIMMs, jedes
        DIMM beginnt bei einem vielfachen von 512 MByte.  Wenn Sie
        DIMMs verwenden, die kleiner als 256 MByte sind, wird der
        physikalische Speicher des Systems <quote>L&ouml;cher</quote>
        enthalten.  Das System unterst&uuml;tzt 64 MByte und 256
        MByte gro&szlig;e DIMMs.  Dabei handelt es sich um die 72 Bit
        SDRAM Variante, da das System ECC nutzt.</para>

      <note>
        <para>Unter &os; werden zur Zeit nur maximal 2 GByte
          unterst&uuml;tzt.</para>
      </note>

      <para>Bei der AS1200 ist ein Symbios 810 SCSI-Kontroller
        eingebaut, der einen Fast SCSI Bus zur Verf&uuml;gung
        stellt.</para>

      <para>Bei der Tincup stehen 5 64-Bit PCI Steckpl&auml;tze, ein
        32-Bit PCI Steckplatz und ein EISA Steckplatz (der mit einem
        der 64 Bit PCI Steckpl&auml;tze &uuml;berlappt) zur
        Verf&uuml;gung.  Zwei separate PCI-Busse stehen zur
        Verf&uuml;gung, PCI0 und PCI1.  Der 32 Bit PCI Steckplatz und
        die beiden oberen 64 PCI Steckpl&auml;tze geh&ouml;ren zu
        PCI0.  An PCI0 h&auml;ngt auch eine Intel 82375EB PCI/EISA
        Bridge, &uuml;ber die die seriellen und parallelen
        Anschl&uuml;sse, Tastatur, Maus, etc. angesteuert werden.  Zu
        PCI1 geh&ouml;ren vier 64 Bit PCI-Steckpl&auml;tze und ein
        Symbios 810 SCSI Kontroller.  VGA-Karten f&uuml;r die Konsole
        m&uuml;ssen in einem zu PCI0 geh&ouml;renden Steckplatz
        installiert werden.</para>

      <para>Die Stromversorgung des Systems wird &uuml;ber einen
        I2C-Kontroller gesteuert.  Wenn Sie wirklich sein wollen,
        da&szlig; kein Teil des Systems mehr unter Spannung steht,
        m&uuml;ssen Sie den Netzstecker ziehen.  Die Tincup benutzt zwei
	Netzteile; allerdings nur zur Lastverteilung und nicht als
	redundante Stromversorgung.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_KN300
cpu     EV5</programlisting>
    </sect3>

    <sect3>
      <title>AlphaServer 8200 und 8400 (<quote>TurboLaser</quote>)</title>

      <para>Die AlphaServer 8200 und 8400 sind als Server f&uuml;r ein
        Firmennetzwerk gedacht, die entweder in einem hohen 19&quot;
        Schrank (9200) oder einem breiten 19&quot; Rack eingebaut
        sind.  Diese Maschinen sind das ber&uuml;hmte <quote>big
        iron</quote>, keine Systeme f&uuml;r den Privatmann.  Die
        TurboLaser k&ouml;nnen bis zu 12 CPUs pro Maschine aufnehmen.
        Der TurboLaser System Bus (TLSB) erlaubt neun (AS8400) bzw.
        f&uuml;nf Knoten (AS8200).  Der TSLB besteht aus 256
        Datenleitungen und 40 Adre&szlig;leitungen, der maximale
        Durchsatz liegt bei 2.1 GByte/sec.  Ein Knoten am TSLB kann
        eine CPU, Speicher, oder I/O sein.  An jeden TSLB werden
        maximal 3 I/O Knoten unterst&uuml;tzt.</para>

      <para>Die Grundversorgung mit Festplatten &uuml;bernimmt ein
        StorageWorks Modul.  Die AS8400 ben&ouml;tigt eine
        3-Phasen-Wechselstrom (Drehstrom) Anschlu&szlig;, die AS8200
        kommt mit einem normalen Stromanschlu&szlig; aus.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21164 EV5/EV56 CPUs, max. 467 MHz oder 21264 EV67 CPUs
            max. 625 MHz</para>
        </listitem>

        <listitem>
          <para>ein oder zwei CPUs pro CPU-Modul</para>
        </listitem>

        <listitem>
          <para>Cache: 4 MByte B-Cache pro CPU</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 256 Bit, ECC</para>
        </listitem>

        <listitem>
          <para>Speicher: gro&szlig; Speicherkarten, die an den TLSB
            angeschlossen werden und auf denen spezielle SIMMs
            stecken.  Die Speicherkarten sind in verschiedenen
            Gr&ouml;&szlig;en erh&auml;ltlich, bis zu 4 GByte pro
            Karte.  Die Karten nutzen ECC (8 Bit ECC pro 64 Bit
            Daten).  Die AS8400 kann maximale 7, die AS8200 maximal 3
            Speicherkarte aufnehmen.  Maximaler Speicherausbau: 28
            GByte.</para>
        </listitem>

        <listitem>
          <para>Expansion: 3 System <quote>I/O Ports</quote>, die
            jeweils bis zu 12 I/O Kan&auml;le erlauben.  An jeden
            I/O-Kanal kann eine XMI-, Futurebus+- oder PCI-Box
            angeschlossen werden.</para>
        </listitem>
      </itemizedlist>

      <para>&os; unterst&uuml;tzt (dies wurde auch getestet) bis zu 
        2 GByte Speicher in einem TurboLaser.  Sie sollten
        sorgf&auml;ltig abw&auml;gen, ob Sie die TSLB Steckpl&auml;tze mit
        Speicherkarten oder CPU-Karten f&uuml;llen.  Wenn Sie sich zum
        Beispiel f&uuml;r 28 GByte Speicher entscheiden, k&ouml;nnen
        Sie zur gleichen Zeit nur zwei CPUs (eine Karte)
        verwenden.</para>

      <para>&os; unterst&uuml;tzt nur die PCI Steckpl&auml;tze.  XMI
        und Futurebus+ (die es nur beim AS8400 gibt) werden beide
        nicht unterst&uuml;tzt.</para>

      <para>Die Karten f&uuml;r die I/O Port haben die Bezeichnungen
        KFTIA oder KFTHA.  Diese Karten stellen die sogenannten
        <quote>hoses</quote> bereit, an die bis zu vier (KFTHA) bzw.
        ein (KFTIA) PCI Bus angeschlossen werden kann.  KFTIA stellt
        zwei 10baseT Ethernet-Anschl&uuml;sse, einen
        FDDI-Anschlu&szlig;, drei Fast Wide Differential SCSI Busse
        und einen Fast Wide Single Ended SCSI Bus zur Verf&uuml;gung.
        Der FWSE SCSI Bus ist f&uuml;r das CDROM gedacht.</para>

      <para>Die KFTHA unterst&uuml;tzt an jedem Ihrer vier hoses eine
        DWLPA oder DWLPB Box.  Diese beherbergen jeweils 12 32 Bit PCI
        Steckpl&auml;tze.  Physikalisch handelt es sich dabei zwar 3
        Busse mit je vier Steckpl&auml;tze, aber f&uuml;r die Software
        scheint es sich um einen PCI-Bus mit 12 Steckpl&auml;tzen zu
        handeln.  Eine voll ausgebaute AS8x00 kann 3 (I/O Ports) mal 4
        (hoses) mal 12 (PCI Steckpl&auml;tze/DWLPx), also 144 PCI
        Steckpl&auml;tze zur Verf&uuml;gung stellen.  Die maximale
        Bandbreite pro KFTHA betr&auml;gt 500 MByte/sec.  Die DWLPA
        kann auch 8 EISA Karten aufnehmen, 2 Steckpl&auml;tze sind
        reine PCI-Steckpl&auml;tze, 2 Steckpl&auml;tze sind reine EISA
        Steckpl&auml;tze.  Zwei der zw&ouml;lf Steckpl&auml;tze werden
        immer von I/O- und Verbinder-Karten belegt.  Die bevorzugte
        I/O Box ist die DWLPB.</para>

      <para>Um die h&ouml;chste Leistung zu erhalten, sollten Sie
        Anwendungen mit hoher Bandbreite (FibreChannel, Gigabit
        Ethernet) &uuml;ber mehrere hoses und/oder mehrere multiple
        KFTHA/KFTIA verteilen.</para>

      <para>Momentan sind PCI Karten, welche PCI Bridges verwenden, mit &os;
        nicht nutzbar. Verzichten Sie also momentan auf diese
        Karten.</para>

      <para>Der single ended narrow SCSI Bus auf der KFTIA wird vom
        System als <emphasis>vierter</emphasis> SCSI Bus angezeigt, da
        die drei Fast Wide Differential SCI Busse auf KFTIA Vorrang
        haben.</para>

      <para>Die AS8x00 werden normalerweise mit einer seriellen
        Konsole benutzt.  Einige neuere Maschinen haben eventuell
        irgendeine Art von graphischer Konsole, aber &os; wurde nur
        mit einer seriellen Konsole gestestet.</para>

      <para>Um die serielle Konsole benutzen zu k&ouml;nnen,
        m&uuml;ssen Sie in der <filename>/etc/ttys</filename> den
        Eintrag f&uuml;r die Konsole wie folgt &auml;ndern:</para>

      <programlisting>console "/usr/libexec/getty std.9600"   unknown   on secure</programlisting>

      <para>Alternativ k&ouml;nnen Sie auch die folgende Zeile
        hinzuf&uuml;gen:</para>

      <programlisting>zs0     "/usr/libexec/getty std.9600"   unknown   on secure</programlisting>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel f&uuml;r einen
        AlphaServer 8x00 mu&szlig; die folgenden Zeilen
        enthalten:</para>

      <programlisting>options   DEC_KN8AE	# Alpha 8200/8400 (Turbolaser)
cpu     EV5</programlisting>

      <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
        notwendig, <literal>cpu EV6</literal> anzugeben.  Das
        <literal>cpu EV5</literal> ist nur notwendig, damit
        &man.config.8;  nicht meckert.</para>
    </sect3>

    <sect3>
      <title>Alpha Processor Inc. UP1000</title>

      <para>Das UP1000 ist ein ATX Mainboard mit einer 21264a CPU, die
        auf einer Slot B Karte steckt.  Es wird normalerweise in einen
        ATX Tower eingebaut.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21264a Alpha CPU, 600 oder 700 MHz, auf einer Slot B
            Karte (inklusive der L&uuml;fter)</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 128 Bits bis zum L2 Cache, 64 Bits
            vom Slot B bis zum AMD-751</para>
        </listitem>

        <listitem>
          <para>on-board Bcache / L2 cache: 2MB (600 MHz) oder 4MB
            (700 MHz)</para>
        </listitem>

        <listitem>
          <para>AMD AMD-751 (<quote>Irongate</quote>) system
            controller chip</para>
        </listitem>

        <listitem>
          <para>Acer Labs M1543C PCI-ISA Bridge / super-IO
            chip</para>
        </listitem>

        <listitem>
          <para>PS/2 Maus und Tastatur</para>
        </listitem>

        <listitem>
          <para>Speicher: ungepufferte 168-pin PC100 SDRAM DIMMS, 3
            DIMM Steckpl&auml;tze, nur DIMMs mit 64, 128 oder 256
            MByte werden unterst&uuml;tzt</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;, ECP/EPP</para>
        </listitem>

        <listitem>
          <para>Anschlu&szlig; f&uuml;r Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>2 Ultra DMA33 IDE Kan&auml;le</para>
        </listitem>

        <listitem>
          <para>2 USB Anschl&uuml;sse</para>
        </listitem>

        <listitem>
          <para>Erweiterungen:</para>

          <itemizedlist>
            <listitem>
              <para>4 32 Bit PCI Steckpl&auml;tze</para>
            </listitem>

            <listitem>
              <para>2 ISA Steckpl&auml;tze</para>
            </listitem>

            <listitem>
              <para>1 AGP Steckplatz</para>
            </listitem>
          </itemizedlist>
        </listitem>
      </itemizedlist>

      <para>Bei Slot B handelt es sich um eine kleine Box, die eine
        Karte mit CPU und Cache enth&auml;lt.  Weiterhin sind zwei
        kleine L&uuml;fter angebracht.  Laute L&uuml;fter...</para>

      <para>Das System ben&ouml;tigt ECC-f&auml;hige DIMMs, also die
        72 Bit Variante.  Diese Information wird in den Unterlagen zur
        UP1000 nicht erw&auml;hnt.  Das System liest das serielle
        EEPROM auf DIMMs &uuml;ber den SM Bus aus.  Wenn nur ein DIMM
        vorhanden ist, mu&szlig; es in Steckplatz
        <emphasis>2</emphasis> eingebaut werden. Dies ist etwas
        seltsam.</para>

      <para>Laut Hersteller ben&ouml;tigt man f&uuml;r ein UP1000 ein
        400Watt ATX Netzteil.  Wenn man den Stromverbrauch von CPU und
        Mainboard betrachtet, scheint dies etwas &uuml;bertrieben.
        Allerdings sollten Sie wie immer an Ihre Steckkarten und
        Peripherieger&auml;te denken.  Ein M1543C Baustein stellt
        Stromspar- und Temperatur&uuml;berwachungsfunktionen bereit
        (via I2C/SM Bus).</para>

      <para>Das UP1000 wird standardm&auml;&szlig;ig nur mit dem
        AlphaBIOS geliefert. Die Firmware f&uuml;r die SRM Konsole ist
        auf der Webseite von Alpha Processor Inc. erh&auml;ltlich.
        Zur Zeit ist nur eine Beta-Version verf&uuml;gbar, die f&uuml;r
        die auch f&uuml;r die Portierung von &os; auf das UP1000
        genutzt wurde.</para>

      <para>Die SRM Konsole kann von den eingebauten Ultra DMA EIDE
        Kan&auml;le booten.</para>

      <para>Der SRM der UP1000 kann auch von einem Adaptec 294x
        Hostapdater booten, allerdings traten mit einem Adaptec 294x
        unter hoher Last <quote>Aussetzer</quote> auf.  Ein
        Hostadapter mit einem Symbios 875 funktionierte mit sym
        Treiber problemlos.  H&ouml;chstwahrscheinlich funktionieren
        auch alle anderen Hostadapter mit Symbios-Chipsatz, wenn sie
        vom sym Treiber unterst&uuml;tzt werden.</para>

      <para>Die USB Anschl&uuml;sse werden von der SRM Konsole
        deaktiviert und wurden (noch) nicht mit &os; getestet.</para>

      <para>Die Konfigurationsdatei f&uuml;r einen Kernel f&uuml;r das
        UP1000 mu&szlig; die folgenden Zeilen enthalten:</para>

      <programlisting>options   API_UP1000	# UP1000, UP1100 (Nautilus)
cpu     EV5</programlisting>
    </sect3>

    <sect3>
      <title>Alpha Processor Inc. UP1100</title>

      <para>Das UP1100 ist ein ATX Mainboard mit einer 21264a CPU, die
        mit 600 MHz betrieben wird.  Es wird normalerweise in einen
        ATX Tower eingebaut.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21264a Alpha EV6 CPU, 600 oder 700 MHz</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 100 MHz 64-Bit (PC-100 SDRAM),
            Bandbreite 800 MB/s</para>
        </listitem>

        <listitem>
          <para>on-board Bcache / L2 cache: 2 MByte</para>
        </listitem>

        <listitem>
          <para>AMD AMD-751 (<quote>Irongate</quote>) system
            controller chip</para>
        </listitem>

        <listitem>
          <para>Acer Labs M1535D PCI-ISA Bridge / super-IO
            chip</para>
        </listitem>

        <listitem>
          <para>PS/2 Maus und Tastatur</para>
        </listitem>

        <listitem>
          <para>Speicher: ungepufferte 168-pin PC100 SDRAM DIMMS, 3
            DIMM Steckpl&auml;tze, nur DIMMs mit 64, 128 oder 256
            MByte werden unterst&uuml;tzt</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;, ECP/EPP</para>
        </listitem>

        <listitem>
          <para>Anschlu&szlig; f&uuml;r Diskettenlaufwerk</para>
        </listitem>

        <listitem>
          <para>2 Ultra DMA66 IDE Kan&auml;le</para>
        </listitem>

        <listitem>
          <para>2 USB Anschl&uuml;sse</para>
        </listitem>

        <listitem>
          <para>Erweiterungen: 3 32 Bit PCI Steckpl&auml;tze und ein
            AGP2x Steckplatz</para>
        </listitem>
      </itemizedlist>

      <para>Das UP1100 wird standardm&auml;&szlig;ig mit SRM Konsole
        geliefert.  Die SRM Konsole ist einem 2 MByte gro&szlig;en
        Flash ROM untergebracht.</para>

      <para>Das System ben&ouml;tigt ECC-f&auml;hige DIMMs, also die
        72 Bit Variante.  Diese Information wird in den Unterlagen zur
        UP1000 nicht erw&auml;hnt.  Das System liest das serielle
        EEPROM auf DIMMs &uuml;ber den SM Bus aus.  Wenn nur ein DIMM
        vorhanden ist, mu&szlig; es in Steckplatz
        <emphasis>2</emphasis> eingebaut werden. Dies ist etwas
        seltsam.</para>

      <para>Laut Hersteller ben&ouml;tigt man f&uuml;r ein UP1000 ein
        400Watt ATX Netzteil.  Wenn man den Stromverbrauch von CPU und
        Mainboard betrachtet, scheint dies etwas &uuml;bertrieben.
        Allerdings sollten Sie wie immer an Ihre Steckkarten und
        Peripherieger&auml;te denken Ein M1535D Baustein stellt
        Stromspar- und Temperatur&uuml;berwachungsfunktionen bereit
        (via I2C/SM Bus, mit einem LM75 Thermof&uuml;hler).</para>

      <para>Auf dem Mainboard ist ein 21143 10/100MBit Ethernet
        Anschlu&szlig; untergebracht.</para>

      <para>Das UP1100 enth&auml;lt au&szlig;erdem ein SoundBlaster
        kompatibles Audiosystem.  Ob es von &os; unterst&uuml;tzt wird,
        ist noch unbekannt.</para>

      <para>Die SRM Konsole kann von den eingebauten Ultra DMA EIDE
        Kan&auml;le booten.</para>

      <para>Das UP1100 besitzt 3 USB Anschl&uuml;sse, zwei stehen
        extern zur Verf&uuml;gung, einer ist mit dem AGP Steckplatz
        verbunden.</para>

      <para>Die Konfigurationsdatei des Kernels f&uuml;r ein
        UP1100 mu&szlig; die folgenden Zeilen enthalten:</para>

      <programlisting>options   API_UP1000	# UP1000, UP1100 (Nautilus)
cpu     EV5</programlisting>

      <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
        notwendig, <literal>cpu EV6</literal> anzugeben.  Das
        <literal>cpu EV5</literal> ist nur notwendig, damit
        &man.config.8;  nicht meckert.</para>
    </sect3>

    <sect3>
      <title>Alpha Processor Inc. CS20, Compaq DS20L</title>

      <para>Der CS20 ist ein 19&quot; breiter, 1HE hoher Server mit
	einer oder zwei 21264[ab] CPUs.  Dieser Rechner wird von
	Compaq unter dem Namen Alphaserver DS20L verkauft.  Der DS20L
	enth&auml;lt zwei 833 MHz CPUs.</para>

      <para>Eigenschaften:</para>

      <itemizedlist>
        <listitem>
          <para>21264a Alpha CPU, 667 MHz oder 21264b, 833 MHz (max. 2
            CPUs)</para>
        </listitem>

        <listitem>
          <para>Speicherzugriff: 100 MHz 256-Bit breit</para>
        </listitem>

        <listitem>
          <para>21271 Core Logic chipset
            (<quote>Tsunami</quote>)</para>
        </listitem>

        <listitem>
          <para>Acer Labs M1533 PCI-ISA Bridge controller / super-IO
            chip </para>
        </listitem>

        <listitem>
          <para>PS/2 Maus und Tastatur</para>
        </listitem>

        <listitem>
          <para>Speicher: gepufferte/registrierte 168-Pin PC100 PLL
            SDRAM DIMMS, 8 DIMM Steckpl&auml;tze, ECC, minimal 256
            MByte, maximal 2 GByte Speicher</para>
        </listitem>

        <listitem>
          <para>2 serielle Anschl&uuml;sse, 16550A</para>
        </listitem>

        <listitem>
          <para>1 paralleler Anschlu&szlig;, ECP/EPP</para>
        </listitem>

        <listitem>
          <para>ALI M1543C Ultra DMA66 IDE Anschlu&szlig;</para>
        </listitem>

        <listitem>
          <para>zwei Intel 82559 10/100MBit Anschl&uuml;sse</para>
        </listitem>

        <listitem>
          <para>Symbios 53C1000 Ultra160 SCSI Hostadapter</para>
        </listitem>

        <listitem>
          <para>Erweiterungen: 2 64 Bit PCI Steckpl&auml;tze (2/3
            L&auml;nge)</para>
        </listitem>
      </itemizedlist>

      <para>Das CS20 wird standardm&auml;&szlig;ig mit SRM Konsole
        geliefert.  Die SRM Konsole ist einem 2 MByte gro&szlig;en
        Flash ROM untergebracht.</para>

      <para>Das CS20 ben&ouml;tigt ECC-f&auml;hige DIMMs.  Beachten
        Sie, da&szlig; es <emphasis>gepufferte</emphasis> DIMMs
        verwendet.</para>

      <para>Das CS20 verf&uuml;gt &uuml;ber ein internes
        &Uuml;berwachungssystem auf I2C-Basis, mit dem Temperatur,
        L&uuml;fter, Spannungen, etc. &uuml;berwacht werden.  Das I2C
        unterst&uuml;tzt auch <quote>wake on LAN</quote>.</para>

      <para>Jeder PCI Steckplatz ist mit einem eigenem PCI Bus auf dem
        Tsunami verbunden.</para>

      <para>Die SRM Konsole kann von den eingebauten Ultra DMA EIDE
        Kan&auml;le booten.</para>

      <para>Das CS20 verf&uuml;gt &uuml;ber ein eingebautes slim-line
        IDE CDROM.  Weiterhin steht ein von vorne zug&auml;nglicher
        Schacht f&uuml;r eine 1&quot; hohe 3.5&quot; SCSI Festplatte
        mit SCA Anschlu&szlig; zur Verf&uuml;gung.</para>

      <para>Bitte beachten Sie, da&szlig; es kein Diskettenlaufwerk
      (und auch keinen Anschlu&szlig; daf&uuml;r) gibt.</para>

      <para>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die
        folgenden Zeilen enthalten:</para>

      <programlisting>options   DEC_ST6600
cpu     EV5</programlisting>

      <para>Obwohl Sie es vielleicht erwartet haben, ist es nicht
        notwendig, <literal>cpu EV6</literal> anzugeben.  Das
        <literal>cpu EV5</literal> ist nur notwendig, damit
        &man.config.8;  nicht meckert.</para>
    </sect3>
  </sect2>

  <sect2>
    <title>&Uuml;bersicht &uuml;ber die unterst&uuml;tzte Hardware</title>

    <para>Ein Hinweis vorab:  Es sind l&auml;ngst nicht so viele &os;/Alpha
      Systeme in Betrieb wie &os;/Intel.  Mit anderen Worten, es
      ist sehr viel unwahrscheinlicher, da&szlig; eine der vielen
      verschiedenen PCI/ISA Karten auf einer Alpha getestet wurde, als
      das bei Intel der Fall ist.  Das bedeutet nicht unbedingt,
      da&szlig; es Probleme geben mu&szlig;, allerdings ist es
      deutlich wahrscheinlicher, da&szlig;  Sie sich auf unbekanntes
      Gebiet wagen.  <filename>GENERIC</filename> enth&auml;lt nur
      Ger&auml;te, von denen wir wissen, da&szlig; Sie in einer Alpha
      funktionieren.</para>

    <para>PCI und ISA werden komplett unterst&uuml;tzt.  Turbo Channel
      ist nicht im Standardkernel (<filename>GENERIC</filename>)
      enthalten und wird nur bedingt unterst&uuml;tzt
      (n&auml;here Informationen finden Sie bei den einzelnen
      Systemen).  MCA wird nicht unterst&uuml;tzt.  Bei EISA werden
      EISA-Karten nicht unterst&uuml;tzt, weil die notwendigen Treiber
      fehlen.  ISA Karten in EISA Steckpl&auml;tzen sollten
      funktionieren.  Die Compaq Qvision EISA VGA Karte wird im
      ISA-Modus betrieben und ist als Konsole verwendbar.</para>

    <para>Diskettenlaufwerke mit 1.44 MByte und 1.2 MByte werden
      unterst&uuml;tzt.  Die in einigen Alpha Systemen vorhandenen
      2.88 MByte Diskettenlaufwerke werden nur als 1.44 MByte
      Laufwerke unterst&uuml;tzt.</para>

    <para>ATA und ATAPI (IDE) Ger&auml;te werden von der &man.ata.4;
      Treiberfamilie unterst&uuml;tzt.  Da die meisten Anwender in
      Ihren Alphas SCSI Festplatten nutzen, werden diese Treiber nicht
      so intensiv getestet wie die SCSI-Treiber.  Achten Sie auf die
      Einschr&auml;nkungen beim Booten von IDE Festplatten, diese
      Angaben finden Sie bei den Informationen zu den einzelnen
      Systemen.</para>

    <para>In Punkto SCSI werden &uuml;ber die CAM Schicht die
      folgenden Hostadapter vollst&auml;ndig unterst&uuml;tzt:
      Adaptec 2940x (auf Basis der AIC7xxx chips), Qlogic Familie und
      Symbios.  Denken Sie daran, da&szlig; es system-spezifische
      Einschr&auml;nken gibt, wenn Sie von den verschiedenen
      Hostadaptern booten wollen.</para>

    <para>Die Qlogic QL2x00 FibreChannel Hostadapter werden
      vollst&auml;ndig unterst&uuml;tzt.</para>

    <para>Wenn Sie Ihre Alpha &uuml;ber Netzwerk booten wollen,
      brauchen Sie eine Netzwerkkarte, die von der SRM Konsole
      unterst&uuml;tzt wird.  Mit anderen Worten, eine Karte mit einem
      21x4x Chip. Genau diese Karten wurden auch von Digital eingesetzt.
      Diese Chips werden bei &os; von &man.de.4; (alter
      Treiber) oder &man.dc.4; (neuer Treiber) unterst&uuml;tzt.
      Einige neueren Versionen des SRM sollen auch die Intel 8255x
      Ethernet Chips unterst&uuml;tzen, die vom &os; &man.fxp.4;
      unterst&uuml;tzt werden.  Aber hier ist Vorsicht geboten:  Es
      gibt Berichte, da&szlig; der &man.fxp.4; nicht sauber mit &os;
      l&auml;uft (obwohl er bei &os;/x86 ausgezeichnet
      funktioniert).</para>

    <para>DEC DEFPA PCI FDDI Netzwerkkarten werden auf der Alpha
      unterst&uuml;tzt.</para>

    <para>Die SRM Konsole emuliert normalerweise einen VGA
      kompatiblen Modus bei PCI VGA Karten.  Allerdings garantiert
      Compaq/DEC nicht daf&uuml;r, da&szlig; das bei jeder
      m&ouml;glichen Karte funktioniert.  Wenn der SRM der Meinung
      ist, da&szlig; das VGA in Ordnung ist, kann &os; die Karte
      benutzen.  Der Treiber f&uuml;r die Konsole funktioniert genau
      wie auf einem &os;/intel System.  Bitte denken Sie daran,
      da&szlig; die VESA Modi auf der Alpha nicht unterst&uuml;tzt
      werden, Ihnen bleibt also nur die 80x25 Konsole.</para>

    <para>In einigen Alphas finden Sie Grafikkarte mit einem
      TGA-Baustein.  Diese einfache Grafikkarte unterst&uuml;tzt die
      VGA-Emulation nicht und kann daher nicht als &os;-Konsole
      verwendet werden.  Die TGA2 Grafikkarten unterst&uuml;tzen
      dagegen eine VGA-Emulation und k&ouml;nnen als &os;-Konsole
      genutzt werden.</para>

    <para>Die in den meisten Alphas vorhandenen seriellen
      Schnittstellen nach dem <quote>PC Standard</quote>, werden
      unterst&uuml;tzt.</para>

    <para>ISDN (i4b) wird von &os;/alpha nicht unterst&uuml;tzt.</para>
  </sect2>

  <sect2>
    <title>Danksagung</title>

    <para>Um dieses Dokument zusammenzustellen, wurden viele Quellen
      genutzt; aber die wichtigste und wertvollste Quelle waren die
      <ulink url="http://www.netbsd.org/">NetBSD Webseiten</ulink>.
      Ohne NetBSD/alpha g&auml;be es kein &os;/alpha.</para>

    <para>Die folgenden Personen haben mich bei der Arbeit an diesem
      Kapitel unterst&uuml;tzt:</para>

    <itemizedlist>
      <listitem>
        <para>&a.gallatin;</para>
      </listitem>

      <listitem>
        <para>&a.chuckr;</para>
      </listitem>

      <listitem>
        <para>&a.mjacob;</para>
      </listitem>

      <listitem>
        <para>&a.msmith;</para>
      </listitem>

      <listitem>
        <para>&a.obrien;</para>
      </listitem>

      <listitem>
        <para>Christian Weisgerber</para>
      </listitem>

      <listitem>
        <para>Kazutaka YOKOTA</para>
      </listitem>

      <listitem>
        <para>Nick Maniscalco</para>
      </listitem>

      <listitem>
        <para>Eric Schnoebelen</para>
      </listitem>

      <listitem>
        <para>Peter van Dijk</para>
      </listitem>

      <listitem>
        <para>Peter Jeremy</para>
      </listitem>

      <listitem>
        <para>Dolf de Waal</para>
      </listitem>

      <listitem>
        <para>Wim Lemmers, ex-Compaq</para>
      </listitem>

      <listitem>
        <para>Wouter Brackman, Compaq</para>
      </listitem>

      <listitem>
        <para>Lodewijk van den Berg, Compaq</para>
      </listitem>
    </itemizedlist>
  </sect2>
</sect1>
