freebsd/freebsd-src/tools/tools/bpfstat/bpfstat.8
.\" Copyright (c) 2005 Christian S.J. Peron
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 22, 2005
.Os
.Dt BPFSTAT 8
.Sh NAME
.Nm bpfstat
.Nd "retrieve bpf statistics"
.Sh SYNOPSIS
.Nm
.Op Fl q
.Op Fl c Ar procname
.Op Fl i Ar seconds
.Op Fl I Ar interface
.Op Fl p Ar pid
.Sh DESCRIPTION
The
.Nm
utility will print statistics associated with active
.Xr bpf 4
devices.
These statistics contain information about device state as
well as packets which have been received, dropped or
matched by the bpf filter program.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl c Ar procname
Print information about devices which were opened by processes named
.Ar procname .
.It Fl i Ar seconds
Continuously retrieve statistics for devices, sleeping for
.Ar seconds
seconds after each iteration.
.It Fl I Ar interface
Print information about devices if they are attached to network
interface
.Ar interface .
.It Fl p Ar pid
Print information about devices if they were opened by process ID
.Ar pid .
.It Fl q
Suppress printing of column names.
.El
.Sh "EXIT STATUS"
The
.Nm
utility exits 0 on success, and >0 if an error occurs.
.Sh "SEE ALSO"
.Xr pcap 3 ,
.Xr bpf 4 ,
.Xr tcpdump 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 7.0 .
.Sh AUTHORS
.An "Christian S.J. Peron" Aq csjp@FreeBSD.org
