freebsd/freebsd-src/usr.sbin/fwget/fwget.8
.\" Copyright (c) 2023 Beckhoff Automation GmbH & Co. KG
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Apr 26, 2023
.Dt FWGET 8
.Os
.Sh NAME
.Nm fwget
.Nd Install firmwares for the running system
.Sh SYNOPSIS
.Nm
.Op Fl v
.Op Fl n
.Ar subsystem
.Sh DESCRIPTION
The
.Nm
utility can be used to install firmwares packaged needed for the running
system
.Pp
If not specified the
.Ar subsystem
argument will default to pci cards.
.Pp
The options are as follows:
.Bl -tag -width
.It Fl n
Dry run, only show needed packages
.It Fl v
Be more verbose
.El
.Sh SEE ALSO
.Xr firmware 9
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 14.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility and this manual page were written by
.An Emmanuel Vadot Aq Mt manu@FreeBSD.org
for Beckhoff Automation GmbH & Co. KG .
