freebsd/freebsd-src/usr.sbin/geom-events/geom-events.conf.5
.\"
.\" Copyright (c) 2011 Lev Serebryakov <lev@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd September 12, 2011
.Dt GEOM-EVENTS.CONF 5
.Os
.Sh NAME
.Nm geom-events.conf
.Nd
.Xr geom-events 8
configuration file
.Sh DESCRIPTION
The
.Bl -item -compact
.It
.Pa /etc/geom-events.conf
.It
.Pa /etc/geom-events/ Ns Ao Ar class Ac Ns Pa .conf
.It
.Pa /usr/local/etc/geom-events/ Ns Ao Ar class Ac Ns Pa .conf
.It
.Pa /etc/geom-events/ Ns Ao Ar class Ac Ns Pa / Ns Ao Ar device Ac Ns Pa .conf
.It
.Pa /usr/local/etc/geom-events/ Ns Ao Ar class Ac Ns Pa / Ns Ao Ar device Ac Ns Pa .conf
.El
.Pp
configuration files contains configuration for
.Xr geom-events 8
script. Exact description of how they are processed,
please see in
.Sx CONFIGURATION
section of
.Xr geom-events 8
.Sh SEE ALSO
.Xr geom-events 8 ,
.Xr devd 8 ,
.Xr geom 8 ,
.Xr geom 4
.Sh HISTORY
The
.Nm
manual page first appeared in
.Fx 10.0 .
.Sh AUTHORS
This manual page was written by
.An Lev Serebryakov Aq lev@FreeBSD.org .
