freebsd/freebsd-src/usr.bin/backlight/backlight.8
.\" Copyright (c) 2020 Emmanuel Vadot <manu@freebsd.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 06, 2020
.Dt BACKLIGHT 8
.Os
.Sh NAME
.Nm backlight
.Nd configure backlight hardware
.Sh SYNOPSIS
.Nm
.Op Fl f Ar device
.Op Fl q
.Op Fl i
.Op Ar value
.Nm
.Op Fl f Ar device
incr | +
.Op Ar value
.Nm
.Op Fl f Ar device
decr | -
.Op Ar value
.Sh DESCRIPTION
The
.Nm
utility can be used to configure brightness levels for registered backlights
.Pp
The options are as follows:
.Bl -tag -width "-f device"
.It Fl f Ar device
Device to operate on.
If not specified,
.Pa /dev/backlight/backlight0
is used.
If an unqualified name is provided,
.Pa /dev/backlight
is automatically prepended.
.It Fl q
When querying the brightness level only print the value.
.It Fl i
Query information about the backlight (name, type).
.It Ar value
Set the brightness level to this value, must be between 0 and 100.
A trailing '%' is valid.
.It Ar incr | +
.Op Ar value
Decrement the backlight level.
If no value is specified a default of 10 percent is used.
.It Ar decr | -
.Op Ar value
Increment the backlight level.
If no value is specified a default of 10 percent is used.
.El
.Sh EXAMPLES
.Bl -bullet
.It
Show the current brightness level
.Bd -literal
backlight -f /dev/backlight/backlight0
.Ed
.El
.Sh SEE ALSO
.Xr backlight 9
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 13.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility and this manual page were written by
.An Emmanuel Vadot Aq Mt manu@FreeBSD.org .
