freebsd/freebsd-src/usr.bin/gensetdefs/gensetdefs.8
.\"
.\" $FreeBSD$
.\"
.Dd March 10, 1999
.Dt GENSETDEFS 8
.Os
.Sh NAME
.Nm gensetdefs
.Nd generate linker set definitions
.Sh SYNOPSIS
.Nm
.Ar file ...
.Sh DESCRIPTION
The
.Nm
command is a special-purpose program to generate the
linker set definitions needed when building an ELF kernel.
Its
.Ar file
arguments are the names of ELF object files.
It scans the section names of the object files,
building a table of those that begin with
.Dv .set. ,
which represent linker sets.  Finally, for each set
.Dv foo
with 
.Dv count
elements, it writes a line 
.Fn DEFINE_SET foo count ;
to the standard output.
.Pp
This command is used by the kernel
.Pa makefile ,
such as
.Pa /sys/i386/conf/Makefile.i386
generic makefile for the
.Tn i386 .
.Sh SEE ALSO
.Xr config 8
.Sh AUTHORS
The
.Nm
command was written by
.An John D. Polstra .
