freebsd/freebsd-src/sbin/ldconfig/ldconfig.8
.Dd October 3, 1993
.Dt LDCONFIG 8
.Os FreeBSD 1.1
.Sh NAME
.Nm ldconfig
.Nd configure the shared library cache
.Sh SYNOPSIS
.Nm ldconfig
.Op Fl rsv
.Op Ar directory Ar ...
.Sh DESCRIPTION
.Nm
is used to prepare a set of
.Dq hints
for use by the run-time linker
.Xr ld.so
to facilitate quick lookup of shared libraries available in multiple
directories.  It scans a set of built-in system directories and any
.Ar directories
specified on the command line (in the given order) looking for shared
libraries and stores the results in the file
.Xr /var/run/ld.so.hints
to forstall the overhead that would otherwise result from the
directory search operations
.Xr ld.so
would have to perform to load the required shared libraries.
.Pp
The shared libraries so found will be automatically available for loading
if needed by the program being prepared for execution. This obviates the need
for storing search paths within the executable.
.Pp
The
.Ev LD_LIBRARY_PATH
environment variable can be used to override the use of
directories (or the order thereof) from the cache or to specify additional
directories where shared libraries might be found.
.Ev LD_LIBRARY_PATH
is a
.Sq \:
separated list of directory paths which are searched by
.Xr ld.so
when it needs to load a shared library. It can be viewed as the run-time
equivalent of the
.Fl L
switch of
.Xr ld.
.Pp
.Nm Ldconfig
is typically run as part of the boot sequence.
.Pp
The following options recognized by
.Nm ldconfig:
.Bl -tag -width indent
.It Fl r
Lists the current contents of
.Xr ld.so.hints
on the standard output. The hints file will not be modified.
.It Fl s
Do not scan
.Nm ldconfig
's builtin system directories
.Sq /usr/lib
and
.Sq /usr/local/lib
for shared libraries.
.It Fl v
Switch on verbose mode.
.Sh Security
Special care must be taken when loading shared libraries into the address
space of
.Ev set-user-Id
programs. Whenever such a program is run,
.Xr ld.so
will only load shared libraries from the
.Ev ld.so.hints
file. In particular, the
.Ev LD_LIBRARY_PATH
is not used to search for libraries. Thus, the role of ldconfig is dual. In
addition to building a set of hints for quick lookup, it also serves to
specify the trusted collection of directories from which shared objects can
be safely loaded. It is presumed that the set of directories specified to
.Nm ldconfig
are under control of the system's administrator.
.Xr ld.so
further assists set-user-Id programs by erasing the
.Ev LD_LIBRARY_PATH
from the environment.

.Sh FILES
.Xr /var/run/ld.so.hints
.Sh SEE ALSO
.Xr ld 1 ,
.Xr link 5
.Sh HISTORY
A
.Nm
utility first appeared in SunOS 4.0, it appeared in its current form
in FreeBSD 1.1.
