freebsd/freebsd-src/eBones/registerd/registerd.8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)registerd.8	8.2 (Berkeley) 12/11/93
.\"
.Dd December 11, 1993
.Dt REGISTERD 8
.Os
.Sh NAME
.Nm registerd
.Nd Kerberos registration daemon
.Sh SYNOPSIS
.Nm registerd
.Sh DESCRIPTION
Act as a registration agent for a Kerberos domain.
.Sh FILES
.Bl -tag -width /etc/kerberosIV/register_keys -compact
.It Pa /.update.keyxx.xx.xx.xx
shared
.Tn DES
key with server
.It Pa /etc/kerberosIV/principal*
Kerberos database
.It Pa /etc/kerberosIV/register_keys
directory containing keys for trusted hosts
.El
.Sh SEE ALSO
.Xr registerd 8 ,
.Xr kerberos 1
.Sh DIAGNOSTICS
.Dq Already exists ,
if the user already exists in the Kerberos database.
.Pp
.Dq Permission Denied ,
if the host on which register is being run is untrusted.
.Sh HISTORY
The
.Nm registerd
utility
first appeared in 4.4BSD.

