freebsd/freebsd-src/usr.sbin/rtadvd/rtadvd.conf.5
.\"	$KAME: rtadvd.conf.5,v 1.8 2000/10/25 05:37:43 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$FreeBSD$
.\"
.Dd May 17, 1998
.Dt RTADVD.CONF 5
.Os
.Sh NAME
.Nm rtadvd.conf
.Nd config file for router advertisement daemon
.Sh DESCRIPTION
This file describes how the router advertisement packet must be constructed
for each of the interfaces.
As described in
.Xr rtadvd 8 ,
you do not have to set this configuration file up at all,
unless you need some special configurations.
You may even omit to create this file. In such cases, the
.Nm rtadvd
daemon will automatically configure itself using default values
specified in the specification.
.Pp
It obeys the famous
.Xr termcap 5
file format.
Each line in the file describes a network interface.
Fields are separated by a colon
.Pq Sq \&: ,
and each field contains one capability description.
Lines may be concatenated by
.Sq \e
character.
The comment marker is the
.Sq \#
character.
.Pp
.Sh CAPABILITIES
Capabilities describe the value to be filled into ICMPv6 router
advertisement messages and to control
.Xr rtadvd 8
behavior.
You are therefore encouraged to read IETF neighbor discovery documents
if you would like to modify the sample configuration file.
.Pp
As explained above, note that almost all items have default values.
If you omit an item, the default value of the item will be used.
.Pp
There are two items which control the interval of sending router advertisements.
These items can be omitted, then
.Nm rtadvd
will use the default values.
.Bl -tag -width indent
.It Cm \&maxinterval
(num) The maximum time allowed between sending unsolicited
multicast router advertisements
.Pq unit: seconds .
The default value is 600.
Its value must be no less than 4 seconds
and no greater than 1800 seconds.
.It Cm \&mininterval
(num) The minimum time allowed between sending unsolicited multicast
router advertisements
.Pq unit: seconds .
The default value is the one third of value of
.Ic maxinterval.
Its value must be no less than 3 seconds and no greater than .75 *
the value of
.Ic maxinterval.
.El
.Pp
The following items are for ICMPv6 router advertisement message
header.
These items can be omitted, then
.Nm rtadvd
will use the default values.
.Bl -tag -width indent
.It Cm \&chlim
(num) The value for Cur Hop Limit field.
The default value is 64.
.It Cm \&raflags
(num) Flags field in router advertisement message header.
Bit 7
.Po
.Li 0x80
.Pc
means Managed address configuration flag bit,
and Bit 6
.Po
.Li 0x40
.Pc
means Other stateful configuration flag bit.
The default value is 0.
.It Cm \&rltime
(num) Router lifetime field
.Pq unit: seconds .
Its value must be no greater than 3600000.
The default value is 1800.
.It Cm \&rtime
(num) Reachable time field
.Pq unit: milliseconds .
The default value is 0, which means unspecified by this router.
.It Cm \&retrans
(num) Retrans Timer field
.Pq unit: milliseconds .
The default value is 0, which means unspecified by this router.
.El
.Pp
The following items are for ICMPv6 prefix information option,
which will be attached to router advertisement header.
These items can be omitted, then
.Nm rtadvd
will automatically get appropriate prefixes from the kernel's routing table,
and advertise the prefixes with the default parameters.
.Bl -tag -width indent
.It Cm \&addrs
(num) Number of prefixes.
Its default is 0, so it must explicitly be set to positve values
if you want to specify any prefix information option.
If its value is 0,
.Xr rtadvd 8
looks up the system routing table and
advertise the prefixes corresponding to interface routes
on the interface.
If its value is more than 1, you must specify the index of the prefix
for each item below.
Indices vary from 0 to N-1, where N is the
value of
.Ic addrs .
Each index shall follow the name of each item, e.g.,
.Dq prefixlen2 .
.It Cm \&prefixlen
(num) Prefix length field.
The default value is 64.
.It Cm \&pinfoflags
(num) Flags field in prefix information option.
Bit 7
.Po
.Li 0x80
.Pc
means On-link flag bit,
and Bit 6
.Po
.Li 0x40
.Pc
means Autonomous address-configuration flag bit.
The default value is 0xc0, i.e., both bits are set.
.It Cm \&addr
(str) The address filled into Prefix field.
Since
.Dq \&:
is used for
.Xr termcap 5
file format as well as IPv6 numeric address, the field MUST be quoted by
doublequote character.
This field cannot be
omitted if the value of
.Ic addrs
is more than 0.
.It Cm \&vltime
(num) Valid lifetime field
.Pq unit: seconds .
The default value is 2592000(30 days).
.It Cm \&pltime
(num) Preferred lifetime field
.Pq unit: seconds .
The default value is 604800(7 days).
.El
.Pp
The following item is for ICMPv6 MTU option,
which will be attached to router advertisement header.
This item can be omitted, then
.Nm rtadvd
will use the default value.
.Bl -tag -width indent
.It Cm \&mtu
(num or str) MTU (maximum transmission unit) field.
If 0 is specified, it means that the option will not be included.
The default value is 0.
If the special string
.Dq auto
is specified for this item, MTU option will be included and its value
will be set to the interface MTU automatically.
.El
.Pp
The following item controls ICMPv6 source link-layer address option,
which will be attached to router advertisement header.
As noted above, you can just omit the item, then
.Nm rtadvd
will use the default value.
.Bl -tag -width indent
.It Cm \&nolladdr
(bool) By default
.Po
if
.Cm \&nolladdr
is not specified
.Pc ,
.Xr rtadvd 8
will try to get link-layer address for the interface from the kernel,
and attach that in source link-layer address option.
If this capability exists,
.Xr rtadvd 8
will not attach source link-layer address option to
router advertisement packets.
.El
.Pp
You can also refer one line from another by using
.Cm tc
capability.
See
.Xr termcap 5
for details on the capability.
.Sh EXAMPLES
.Bd -literal -offset
#
# common definitions.
#
# Note: All of the following parameters have default values defined
#       in specifications, and hence you usually do not have to set them
#       by hand unless you need special non-default values.
#
#       You even do not need to create the configuration file. rtadvd
#       would usually work well without a configuration file.
#       See also: rtadvd(8)

#default:\\
#	:chlim#64:raflags#0:rltime#1800:rtime#30000:retrans#1000:\\
#	:pinfoflags#192:vltime#3600000:pltime#3600000:mtu#1500:
#ether:\\
#	:mtu#1500:tc=default:

# per-interface definitions.
#   Mainly IPv6 prefixes are configured in this part. However, rtadvd
#   automatically learns appropriate prefixes from the kernel's routing
#   table, and advertises the prefixes, so you don't have to configure
#   this part, either.
#   If you don't want the automatic advertisement, invoke rtadvd with
#   the -s option and configure this part by hand.
 
#ef0:\\
#	:addrs#1:addr="3ffe:501:4819:1000::":prefixlen#64:tc=ether:

.Ed
.Sh SEE ALSO
.Xr termcap 5 ,
.Xr rtadvd 8 ,
.Xr rtsol 8
.Pp
Thomas Narten, Erik Nordmark and W. A. Simpson,
.Do
Neighbor Discovery for IP version 6 (IPv6)
.Dc ,
RFC 2461
.Sh HISTORY
The
.Xr rtadvd 8
and the configuration file
.Nm
first appeared in WIDE Hydrangea IPv6 protocol stack kit.
.\" .Sh BUGS
.\" (to be written)
