freebsd/freebsd-src/sbin/ddb/ddb.8
.\"-
.\" Copyright (c) 2007 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd 25 December, 2007
.Dt DDB 8
.Os
.Sh NAME
.Nm ddb
.Nd Configure DDB kernel debugger properties
.Sh SYNOPSIS
.Nm
.Cm script
.Ar scriptname
.Nm
.Cm script
.Ar scriptname=script
.Nm
.Cm scripts
.Nm
.Cm unscript
.Ar scriptname
.Sh DESCRIPTION
.Nm
configures certain aspects of the
.Xr DDB 4
kernel debugger from user space that are not configured at compile-time or
easily via
.Xr sysctl 8
MIB entries.
.Sh SCRIPTING
.Nm
can be used to configure aspects of
.Xr DDB 4
scripting from user space; scripting support is described in more detail in
.Xr DDB 4 .
Each of the debugger commands is available from the command line:
.Bl -tag -width indent
.It Cm script Ar scriptname
Print the script named
.Ar scriptname .
.It Cm script Ar scriptname=scriptvalue
Define a script named
.Ar scriptname ;
as many scripts contain characters interpreted in special ways by the shell,
it is advisable to enclose
.Ar scriptvalue
in quotes.
.It Cm scripts
List currently defined scripts.
.It Cm unset Ar scriptname
Delete the script named
.Ar scriptname .
.El
.Sh EXAMPLES
The following example defines a script that will execute when the kernel
debugger is entered as a result of a break signal:
.Bd -literal -offset indent
ddb script kdb.enter.break="show pcpu;bt"
.Ed
.Pp
The following example will delete the script:
.Bd -literal -offset indent
ddb unscript kdb.enter.break
.Ed
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr DDB 4 ,
.Xr sysctl 8
.Sh HISTORY
.Nm
first appeared in
.Fx 8.0 .
.Sh AUTHORS
.An Robert N M Watson
.Sh BUGS
Ideally,
.Nm
would not exist, as all pertinent aspects of
.Xr DDB 4
could be configured directly via
.Xr sysctl 8 .
