freebsd/freebsd-src/appl/popper/popper.8
.\" Copyright (c) 2001 - 2004 Kungliga Tekniska Högskolan
.\" (Royal Institute of Technology, Stockholm, Sweden).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the Institute nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id$
.\"
.Dd July 14, 2004
.Dt POPPER 8
.Os HEIMDAL
.Sh NAME
.Nm popper
.Nd POP3 server
.Sh SYNOPSIS
.Nm
.Op Fl k
.Op Fl a Ar plaintext Ns \*(Ba Ns Ar otp Ns \*(Ba Ns Ar sasl
.Op Fl t Ar file
.Op Fl T Ar seconds
.Op Fl d
.Op Fl i
.Op Fl p Ar port
.Op Fl Fl address-log= Ns Pa file
.Sh DESCRIPTION
.Nm
serves mail via the Post Office Protocol.  Supported options include:
.Bl -tag -width Ds
.It Fl a Ar plaintext Ns \*(Ba Ns Ar otp Ns \*(Ba Ns Ar sasl
Tells
.Nm
which authentication mode is acceptable,
.Ar sasl
enables SASL (RFC2222),  and
.Ar otp
enables OTP (RFC1938) authentication. Both disable plaintext passwords.
.It Fl Fl address-log= Ns Pa file
Logs the addresses (along with a timestamp) of all clients to the
specified file. This can be used to implement POP-before-SMTP
authentication.
.It Fl d
Enables more verbose log messages.
.It Fl i
When not started by inetd, this flag tells
.Nm
that it has to create a socket by itself.
.It Fl k
Tells
.Nm
to use Kerberos for authentication. This is the traditional way of
doing Kerberos authentication, and is normally done on a separate port
(as it doesn't follow RFC1939), and should be used instead of using
SASL.
.It Fl p Ar port
Port to listen to, in combination with
.Fl i .
.It Fl t Ar file
Trace all commands to file.
.It Fl T Ar seconds
Set timeout to something other than the default of 120 seconds.
.El
.\".Sh ENVIRONMENT
.\".Sh FILES
.\".Sh EXAMPLES
.\".Sh DIAGNOSTICS
.Sh SEE ALSO
.Xr push 8 ,
.Xr movemail 8
.Sh STANDARDS
RFC1939 (Post Office Protocol - Version 3)
.\" RFC2449 (POP3 Extension Mechanism)
.\".Sh HISTORY
.Sh AUTHORS
The server was initially developed at the University of California,
Berkeley.
.Pp
Many changes have been made as part of the KTH Kerberos distributions.
.\".Sh BUGS
