freebsd/freebsd-src/eBones/kdb_edit/kdb_edit.8
.\" from: kdb_edit.8,v 4.1 89/01/23 11:08:55 jtkohl Exp $
.\" $Id: kdb_edit.8,v 1.2 1994/07/19 19:27:27 g89r4222 Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <Copyright.MIT>.
.\"
.TH KDB_EDIT 8 "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
kdb_edit \-  Kerberos key distribution center database editing utility
.SH SYNOPSIS
kdb_edit [
.B \-n
]
.SH DESCRIPTION
.I kdb_edit
is used to create or change principals stored in the Kerberos key
distribution center (KDC) database.
.PP
When executed,
.I kdb_edit
prompts for the master key string and verifies that it matches the
master key stored in the database.
If the
.B \-n
option is specified, the master key is instead fetched from the master
key cache file.
.PP
Once the master key has been verified,
.I kdb_edit
begins a prompt loop.  The user is prompted for the principal and
instance to be modified.  If the entry is not found the user may create
it.
Once an entry is found or created, the user may set the password,
expiration date, maximum ticket lifetime, and attributes.
Default expiration dates, maximum ticket lifetimes, and attributes are
presented in brackets; if the user presses return the default is selected.
There is no default password.
The password RANDOM is interpreted specially, and if entered
the user may have the program select a random DES key for the
principal.
.PP
Upon successfully creating or changing the entry, ``Edit O.K.'' is
printed.
.SH DIAGNOSTICS
.TP 20n
"verify_master_key: Invalid master key, does not match database."
The master key string entered was incorrect.
.SH FILES
.TP 20n
/kerberos/principal.pag, /kerberos/principal.dir
DBM files containing database
.TP
/.k
Master key cache file.
