freebsd/freebsd-src/sbin/geom/class/label/glabel.8
.\" Copyright (c) 2004 Pawel Jakub Dawidek <pjd@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd Jul 2, 2004
.Dt GLABEL 8
.Os
.Sh NAME
.Nm glabel
.Nd "disk labelization control utility"
.Sh SYNOPSIS
.Nm
.Cm create
.Op Fl v
.Ar name
.Ar dev
.Nm
.Cm destroy
.Op Fl fv
.Ar name
.Op Ar name Op Ar ...
.Nm
.Cm label
.Op Fl v
.Ar name
.Ar dev
.Nm
.Cm stop
.Op Fl fv
.Ar name
.Op Ar name Op Ar ...
.Nm
.Cm clear
.Op Fl v
.Ar dev
.Op Ar dev Op Ar ...
.Nm
.Cm list
.Op Ar prov Op Ar ...
.Nm
.Cm load
.Op Fl v
.Nm
.Cm unload
.Op Fl v
.Sh DESCRIPTION
The
.Nm
utility is used for GEOM providers labelization.
A label can be setup on a GEOM provider in two ways:
.Dq manual
or
.Dq automatic .
When using the
.Dq manual
method, no metadata are stored on the devices, so a label has to be configured
by hand every time it is needed.
The
.Dq automatic
method uses on-disk metadata to store the label and detect it automatically in
the future.
.Pp
This class also provides volume label detection for file systems.
Those labels cannot be set with
.Nm ,
but must be set with the appropriate file system utility, e.g. for UFS
the file system label is set with
.Xr tunefs 8 .
Currently supported file systems are:
.Pp
.Bl -bullet -offset indent -compact
.It
UFS1 (directory
.Pa /dev/ufs/ ) .
.It
UFS2 (directory
.Pa /dev/ufs/ ) .
.It
MSDOSFS (FAT12, FAT16, FAT32) (directory
.Pa /dev/msdosfs/ ) .
.It
CD ISO9660 (directory
.Pa /dev/iso9660/ ) .
.El
.Pp
Non file-system labels are created in the directory
.Pa /dev/label/ .
.Pp
The first argument to
.Nm
indicates an action to be performed:
.Bl -tag -width ".Cm destroy"
.It Cm create
Create temporary label
.Ar name
for the given provider.
This is the
.Dq manual
method.
The kernel module
.Pa geom_label.ko
will be loaded if it is not loaded already.
.It Cm label
Setup a label
.Ar name
for the given provider.
This is the
.Dq automatic
method, where metadata is stored in provider's last sector.
The kernel module
.Pa geom_label.ko
will be loaded if it is not loaded already.
.It Cm stop
Turn off the given label by its
.Ar name .
This command doesn't touch on-disk metadata!
.It Cm destroy
Same as
.Cm stop .
.It Cm clear
Clear metadata on the given devices.
.It Cm list
List all currently configured devices, or list the given devices.
.It Cm load
Load
.Pa geom_label.ko
kernel module.
.It Cm unload
Unload
.Pa geom_label.ko
kernel module.
.El
.Pp
Additional options:
.Bl -tag -width indent
.It Fl f
Force the removal of the specified labels.
.It Fl v
Be more verbose.
.El
.Sh EXAMPLES
The following example shows how to setup a label for disk da2,
create a file system on it, and mount it:
.Bd -literal -offset indent
glabel label -v usr /dev/da2
newfs /dev/label/usr
mount /dev/label/usr /usr
[...]
umount /usr
glabel stop usr
glabel unload
.Ed
.Pp
The next example shows how to setup a label for a UFS file system:
.Bd -literal -offset indent
tunefs -L data /dev/da4s1a
mount /dev/ufs/data /mnt/data
.Ed
.Sh DIAGNOSTICS
Exit status is 0 on success, and 1 if the command fails.
.Sh SEE ALSO
.Xr geom 4 ,
.Xr geom 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr tunefs 8 ,
.Xr umount 8
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.3 .
.Sh AUTHORS
.An Pawel Jakub Dawidek Aq pjd@FreeBSD.org
