freebsd/freebsd-src/sbin/adjkerntz/adjkerntz.8
.\" Copyright (C) 1993 by Andrew A. Chernov, Moscow, Russia.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 15, 1993
.Dt ADJKERNTZ 8
.Os FreeBSD
.Sh NAME
.Nm adjkerntz
.Nd "adjusts the kernel time if the machine runs wall CMOS clock"
.Sh SYNOPSIS
.Nm adjkerntz
.Sh DESCRIPTION
.Nm Adjkerntz
daemon
fixes kernel time (makes it UTC) using the current wall CMOS clock value,
the current time zone rule and the kernel timezone value. The adjustment is
enabled only if the file
.Pa /etc/wall_cmos_clock
exists, in other cases it is assumed that the machine runs UTC CMOS clock and
.Nm adjkerntz
does nothing and exits immediately.
.Pp
The adjustment is usually needed at boot stage and when a time zone
change occurs.
.Nm Adjkerntz
started in
.Pa /etc/rc
(before any daemons are started).
.Nm Adjkerntz
makes the first adjustment and the initial time zone offset is stored into
.Pa adjkerntz
kernel variable
for following subsequent
.Nm adjkerntz
time zone change spying.
When time zone changes occur,
.Nm Adjkerntz
uses the previously stored
time zone offset and the changed time zone rule to
produce the new time zone offset, fix RTC clock and store the new
offset into
.Pa adjkerntz
kernel variable
too.
.Pp
.Nm Adjkerntz
clears the kernel timezone structure and makes kernel always run at UTC
time zone.
Super-user privilege is required for all operations.
.Sh ENVIRONMENT
.Bl -tag -width Fl
.It Ev TZ
Time zone change rule, see
.Xr tzset 3 ;
not needed when
.Xr /usr/sbin/tzsetup
or
.Xr zic 8
is used.
.Sh FILES
.Bl -tag -width /etc/wall_cmos_clock -compact
.It Pa /etc/localtime
current zoneinfo file, see
.Xr /usr/sbin/tzsetup
and
.Xr zic 8 .
.It Pa /etc/wall_cmos_clock
Empty file.
Presence of it indicates that the machine runs wall CMOS clock,
absence indicates UTC CMOS clock.
.Sh SEE ALSO
.Xr tzset 3 ,
.Xr zic 8 ,
.Xr rc 8 ,
.Xr sysctl 8 ,
.Xr /usr/sbin/tzsetup
.Sh DIAGNOSTICS
No diagnostics.
If any error occurs, an error message printed via
.Xr syslog 3
and
.Nm adjkerntz
exits with return code greater than zero.
.Sh AUTHOR
Andrew A. Chernov <ache@astral.msk.su>
.Sh HISTORY
The
.Nm adjkerntz
command appeared in FreeBSD 1.0.1

