freebsd/freebsd-src/share/man/man5/autofs.5
.\" Copyright (c) 2004 Alfred Perlstein <alfred@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: autofs.5,v 1.1 2004/08/31 16:05:39 bright Exp $
.\" $FreeBSD: src/share/man/man5/autofs.5,v 1.3 2005/06/15 13:31:22 ru Exp $
.Dd August 30, 2004
.Dt AUTOFS 5
.Os
.Sh NAME
.Nm autofs
.Nd auto file system
.Sh SYNOPSIS
.Bd -literal
autofs	/auto	autofs rw 0 0
.Ed
.Sh DESCRIPTION
The auto file system, or
.Nm ,
provides a method to dynamically graft mountpoints into the file system
namespace.
.Sh SEE ALSO
.Xr libautofs 3 ,
.Xr mount_autofs 8
.Sh HISTORY
The
.Nm
file system first appeared in
.Fx 6.0 .
The
.Nm
manual page first appeared in
.Fx 6.0 .
.Sh AUTHORS
The
.Nm
manual page was written by
.An Alfred Perlstein Aq alfred@FreeBSD.org .
