freebsd/freebsd-src/share/man/man5/drivers.conf.5
.\" Copyright (c) 2002 Murray Stokely <murray@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 23, 2002
.Dt DRIVERS.CONF 5
.Os
.Sh NAME
.Nm drivers.conf
.Nd "driver configuration file for boot floppies"
.Sh DESCRIPTION
The file
.Nm
is used during the release build process.
A
.Fx
release includes three installation floppies.
The first floppy image,
.Pa kern.flp ,
contains a statically linked kernel.
The second floppy image,
.Pa mfsroot.flp ,
contains
.Xr sysinstall 8 ,
a collection of essential commands necessary for installation, and
kernel modules to supplement the boot kernel.
The third floppy image,
.Pa drivers.flp ,
contains optional device drivers that may not be necessary for
installation.
Users must initially boot the system with
.Pa kern.flp .
Once the system has booted, the user is prompted to insert the
.Pa mfsroot.flp .
The modules present in the
.Pa /stand/modules
directory of the mfsroot floppy will automatically be loaded by
.Xr sysinstall 8 .
If the user requires additional drivers, then the drivers present
on
.Pa drivers.flp
may be loaded from
.Xr sysinstall 8 .
.Pp
The
.Pa /usr/src/release/${arch}/drivers.conf
file contains a list of drivers that should be omitted from the boot
kernel and installed as kernel modules on the mfsroot floppy or the
driver floppy.
This is necessary because a static kernel with all of the
.Fx
device drivers would be far too large for a single floppy disk.
Each driver is described on a separate line; fields on each line are
separated by tabs or spaces.
.Pp
The first field,
.Ar driver ,
is the name of the driver or option in the kernel configuration file.
This is used by
.Pa driver-remove.awk
to remove drivers from the boot floppy kernel configuration
file that are included as modules on the mfsroot floppy.
.Pp
The second field,
.Ar filename ,
is the name of the associated kernel module (without the
.Pa .ko
extension).
.Pp
The third field,
.Ar floppy ,
specifies which floppy disk should include the kernel module.
A value of 2 represents the
.Pa mfsroot.flp
floppy image, and a value of 3 represents the optional
.Pa drivers.flp
floppy image.
.Pp
The fourth field,
.Ar type ,
specifies the driver category.
If set to
.Dq Li options ,
then this module is assumed to add the
functionality of a kernel option.
Otherwise, this module is assumed to represent a device driver.
.Pp
The fifth field,
.Ar description ,
provides a short description of the device driver.
This description is displayed to the user by
.Xr sysinstall 8
when the module is loaded.
The descriptions for all drivers on the optional
.Pa drivers.flp
image are listed in the file
.Pa DRIVERS.TXT
which is created by
.Pa driver-desc.awk
and accompanies the floppy images on the FTP sites and release media.
.Sh FILES
.Bl -tag -compact
.It Pa /usr/src/release/Makefile
.It Pa /usr/src/release/${arch}/drivers.conf
.It Pa /usr/src/release/scripts/driver-copy2.awk
.It Pa /usr/src/release/scripts/driver-desc.awk
.It Pa /usr/src/release/scripts/driver-remove.awk
.El
.Sh SEE ALSO
.Xr release 7 ,
.Xr kldload 8 ,
.Xr sysinstall 8
.Rs
.%T "FreeBSD Release Engineering"
.%O http://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/releng/
.Re
.Sh HISTORY
The
.Nm
file appeared in
.Fx 4.5 .
.Sh AUTHORS
.An -nosplit
.An HOSOKAWA, Tatsumi Aq hosokawa@FreeBSD.org
originally added support for moving kernel modules to the mfsroot
installer floppy image.
This manual page was written by
.An Murray Stokely Aq murray@FreeBSD.org .
