freebsd/freebsd-src/share/man/man5/make.conf.5
.\" Copyright (c) 2000
.\"	Mike W. Meyer
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 3, 2000
.Dt MAKE.CONF 5
.Os
.Sh NAME
.Nm make.conf
.Nd system build information
.Sh DESCRIPTION
The file
.Nm
contains settings that control the compilation of the
.Fx
sources
and ported applications.
The file
.Nm
is generally created by the system administrator when the values need
to be changed from their defaults.
.Pp
The purpose of
.Nm
is not to run commands or perform compilation actions
directly.
Instead, it is included by the
various makefiles in
.Pa /usr/src ,
.Pa /usr/ports
and
.Pa /usr/doc
which conditionalize their
internal actions according to the settings found there.
.Pp
The
.Pa /etc/make.conf
file is included from the the appropriate
.Pa Makefile
which specifies the default settings for all the available options.
Options need only be specified in
.Pa /etc/make.conf
when the system administrator wishes to override these defaults.
.Pp
The build procedures occur in four broad areas: the world, the kernel,
documentations and ports.
Variables set in
.Nm
may be applicable during builds in one, two, or all four of these
areas.
They may be specified for a particular build via the
.Fl D
option of
.Xr make 1 .
.Pp
The following lists provide a name and short description for each
variable you can use during the indicated builds.
The values of
variables flagged as
.Vt bool
are ignored; the variable being
set at all (even to 
.Dq Li FALSE
or
.Dq Li NO )
cause it to
be treated as if it were set.
.Pp
The following list provides a name and short description for variables
that are used for all builds, or are used by the
.Pa makefiles
for things other than builds.
.Bl -tag -width Ar
.It Va CFLAGS
.Vt ( str )
Controls the compiler setting when compiling C code.
Optimization levels above
.Oo Fl O ( O2 , No ...\& ) Oc
are not supported.
.Va BDECFLAGS
is provided as a set of
.Xr gcc 1
settings suggested by
.An "Bruce Evans" Aq bde@FreeBSD.org
for developing and testing changes.
They can be used by:
.Pp
.Bd -literal -offset indent
CXFLAGS+=${BDECFLAGS}
.Ed
.It Va CVS_UPDATE
.Vt ( bool )
Set this to use
.Xr cvs 1
to update your ports with
.Dq Li "make update" .
.It Va CXXFLAGS
.Vt ( str )
Controls the compiler settings when compiling C++ code.
.Va CXXFLAGS
is initially set to the value of
.Va CFLAGS .
If you want to
add to the
.Va CXXFLAGS
value, use
.Dq Li +=
instead of
.Dq Li = .
.It Va INSTALL
.Vt ( str )
the default install command.
To have commands compared before doing
the install, use
.Bd -literal -offset indent
INSTALL="install -C"
.Ed
.It Va LOCAL_DIRS
.Vt ( str )
List any directories that should be entered when doing
make's in
.Pa /usr/src
in this variable.
.It Va MTREE_FOLLOWS_SYMLINKS
.Vt ( str )
Set this to
.Dq Fl L
to cause
.Xr mtree 8
to follow symlinks.
.It Va NO_DOCUPDATE
.Vt ( bool )
Set this to not update the doc tree during
.Dq Li "make update" .
.It Va NO_PORTSUPDATE
.Vt ( bool )
Set this to not update the ports tree during
.Dq Li "make update" .
.It Va SUP_UPDATE
.Vt ( bool )
Set this to use
.Xr cvsup 1
to update your ports with
.Dq Li "make update" .
.It Va SUP
.Vt ( str )
The location of the
.Xr cvsup 1
command for
.Dq Li "make update" .
.It Va SUPFLAGS
.Vt ( str )
The flag for the
.Xr sup 1
command when doing
.Dq Li "make update" .
This defaults to
.Op Fl g L Ar 2 .
.It Va SUPHOST
.Vt ( str )
The hostname of the sup server to use when doing
.Dq Li "make update" .
.It Va SUPFILE
.Vt ( str )
The first
.Ar supfile
to use when doing a
.Dq Li "make update" .
This defaults to
.Pa /usr/share/examples/cvsup/standard\-supfile .
.It Va SUPFILE1
.Vt ( str )
The second
.Ar supfile
to use when doing a
.Dq Li "make update" .
This defaults to
.Pa /usr/share/examples/cvsup/secure\-supfile .
.It Va SUPFILE2
.Vt ( str )
The third
.Ar supfile
to use when doing a
.Dq Li "make update" .
This defaults to
.Pa /usr/share/examples/cvsup/secure\-supfile .
.It Va PORTSSUPFILE
.Vt ( str )
The ports
.Ar supfile
to use when doing a
.Dq Li "make update" .
This defaults to
.Pa /usr/share/examples/cvsup/ports\-supfile .
.It Va DOCSUPFILE
.Vt ( str )
The documentation
.Ar supfile
to use when doing a
.Dq Li "make update" .
This defaults to
.Pa /usr/share/examples/cvsup/doc\-supfile .
.El
.Pp
The following list provides a name and short description for variables
that are only used doing a kernel build:
.Bl -tag -width Ar
.It Va BOOT_COMCONSOLE_PORT
.Vt ( str )
The port address to use for the console if the boot blocks have
been configured to use a serial console instead of the keyboard/video card.
.It Va BOOT_COMCONSOLE_SPEED
.Vt ( int )
The baud rate to use for the console if the boot blocks have
been configured to use a serial console instead of the keyboard/video card.
.It Va BOOTWAIT
.Vt ( int )
Controls the amount of time the kernel waits for a console keypress
before booting the default kernel.
The value is approximately milliseconds.
Keypresses are accepted by the BIOS before booting from disk,
making it possible to give custom boot parameters even when this is
set to 0.
.It Va COPTFLAGS
.Vt ( str )
Controls the compiler settings when building the
kernel.
Optimization levels above
.Oo Fl O ( O2 , No ...\& ) Oc
are not supported.
.It Va KERNEL
.Vt ( str )
Controls which kernel configurations will be
built by
.Dq Li "${MAKE} buildkernel"
and installed by
.Dq Li "${MAKE} installkernel" .
For example,
.Bd -literal -offset indent
KERNEL=MINE DEBUG GENERIC OTHERMACHINE
.Ed
.Pp
will build the the kernels specified by the config files
.Pa MINE , DEBUG , GENERIC ,
and
.Pa OTHERMACHINE ,
and install the kernel specified by the config file
.Pa MINE .
It defaults to
.Pa GENERIC .
.It Va NO_KERNELCONFIG
.Vt ( bool )
Set this to skip running
.Xr config 8
during
.Dq Li "${MAKE} buildkernel" .
.It Va NO_KERNELDEPEND
.Vt ( bool )
Set this to skip running
.Dq Li "${MAKE} depend"
during
.Dq Li "${MAKE} buildkernel" .
.It Va NO_MODULES
.Vt ( bool )
Set to not build modules with the kernel.
.El
.Pp
The following list provides a name and short description for variables
that are used during the world build:
.Bl -tag -width Ar
.It Va COMPAT1X
.Vt ( bool )
Set to install the
.Fx
1 compatibility libraries.
.It Va COMPAT20
.Vt ( bool )
Set to install the
.Fx 2.0
compatibility libraries.
.It Va COMPAT21
.Vt ( bool )
Set to install the
.Fx 2.1
compatibility libraries.
.It Va COMPAT22
.Vt ( bool )
Set to install the
.Fx 2.2
compatibility libraries.
.It Va COMPAT3X
.Vt ( bool )
Set to install the
.Fx
3
compatibility libraries.
.It Va ENABLE_SUIDPERL
.Vt ( bool )
Set to enable the installation of an suid
.Xr perl 1
binary.
.It Va FETCH_CMD
.Vt ( str )
Command to use to fetch files.
Normally
.Xr fetch 1 .
.It Va MAKE_IDEA
.Vt ( bool )
Set to build the IDEA encryption code.
This code is patented in the USA and many European countries.
It is
.Em "YOUR RESPONSIBILITY"
to determine if you can legally use IDEA.
.It Va MAKE_KERBEROS4
.Vt ( bool )
Set this to build KerberosIV (KTH eBones).
.It Va MAKE_KERBEROS5
.Vt ( bool )
Set this to build Kerberos5 (KTH Heimdal).
.Em WARNING !
This is still experimental code.
If you need stable Kerberos5, use the
port(s).
.It Va MODULES_WITH_WORLD
.Vt ( bool )
Set to build modules with the system instead of the kernel.
.It Va NO_CVS
.Vt ( bool )
Set to not build CVS.
.It Va NO_BIND
.Vt ( bool )
Set to not build BIND.
.It Va NO_FORTRAN
.Vt ( bool )
Set to not build
.Xr g77 1
and related libraries.
.It Va NO_LPR
.Vt ( bool )
Set to not build
.Xr lpr 1
and related programs.
.It Va NO_MAILWRAPPER
.Vt ( bool )
Set to not build the
.Xr mailwrapper 8
MTA selector.
.It Va NO_MAKEDEV_INSTALL
.Vt ( bool )
Set to avoid installing MAKEDEV in
.Pa /dev .
This implies the
.Va NO_MAKEDEV_RUN
variable.
.It Va NO_MAKEDEV_RUN
.Vt ( bool )
Set to avoid running
.Dq Li "MAKEDEV all"
on
.Pa /dev
during install.
.It Va NO_OBJC
.Vt ( bool )
Set to not build Objective C support.
.It Va NO_OPENSSH
.Vt ( bool )
Set to not build OpenSSH.
.It Va NO_OPENSSL
.Vt ( bool )
Set to not build OpenSSL (implies
.Va NO_OPENSSH ) .
.It Va NO_SENDMAIL
.Vt ( bool )
Set to not build
.Xr sendmail 8
and related programs.
.It Va NO_SHAREDOCS
.Vt ( bool )
Set to not build the
.Bx 4.4
legacy docs.
.It Va NO_TCSH
.Vt ( bool )
Set to not build and install
.Pa /bin/csh
(which is
.Xr tcsh 1 ) .
.It Va NO_X
.Vt ( bool )
Set to not compile in X\-Windows support (e.g.\&
.Xr doscmd 1 ) .
.It Va NOCLEAN
.Vt ( bool )
Set this to disable cleaning during
.Dq Li "make buildworld" .
This should not be set unless you know what you are doing.
.It Va NOCLEANDIR
.Vt ( bool )
Set this to run
.Dq Li "${MAKE} clean"
instead of
.Dq Li "${MAKE} cleandir" .
.It Va NOCRYPT
.Vt ( bool )
Set to not build any crypto code.
.It Va NOGAMES
.Vt ( bool )
Set to not build games.
.It Va NOINFO
.Vt ( bool )
Set to not make or install
.Xr info 5
files.
.It Va NOLIBC_R
.Vt ( bool )
Set to not build
.Nm libc_r
(reentrant version of
.Nm libc ) .
.It Va NOMANCOMPRESS
.Vt ( bool )
Set to install man pages uncompressed.
.It Va NOPERL
.Vt ( bool )
Set to avoid building
.Xr perl 1 .
.It Va NOPROFILE
.Vt ( bool )
Set to avoid compiling profiled libraries.
.It Va NOSECURE
.Vt ( bool )
set to not build crypto code in
.Pa secure
subdir.
.It Va NOSHARE
.Vt ( bool )
Set to not build in the
.Pa share
subdir.
.It Va NOUUCP
.Vt ( bool )
Set to not build
.Xr uucp 1
related programs.
.It Va PERL_THREADED
.Vt ( bool )
Set to enable the building and installation of
.Xr perl 1
with thread
support.
.It Va PPP_NOSUID
.Vt ( bool )
Set to disable the installation of
.Xr ppp 8
as an suid root program.
.It Va SENDMAIL_MC
.Vt ( str )
The default m4 configuration file to use at install time.
The value should include the full path to the .mc file, e.g.,
.Pa /etc/mail/myconfig.mc .
Use with caution as a make install will overwrite any existing
.Pa /etc/mail/sendmail.cf .
Note that
.Va SENDMAIL_CF
is now deprecated.
.It Va SENDMAIL_ADDITIONAL_MC
.Vt ( str )
Additional .mc files which should be built into .cf files at build time.
The value should include the full path to the .mc file(s), e.g.,
.Pa /etc/mail/foo.mc
.Pa /etc/mail/bar.mc .
.It Va SENDMAIL_CFLAGS
.Vt ( str )
Flags to pass to the compile command when building
.Xr sendmail 8 .
The
.Va SENDMAIL_*
flags can be used to provide SASL support with setting such as:
.Bd -literal -offset indent
SENDMAIL_CFLAGS=-I/usr/local/include -DSASL
SENDMAIL_LDFLAGS=-L/usr/local/lib
SENDMAIL_LDADD=-lsasl
.Ed
.It Va SENDMAIL_LDFLAGS
.Vt ( str )
Flags to pass to the
.Xr ld 1
command when building
.Xr sendmail 8 .
.It Va SENDMAIL_LDADD
.Vt ( str )
Flags to add to the end of the
.Xr ld 1
command when building
.Xr sendmail 8 .
.It Va SENDMAIL_DPADD
.Vt ( str )
This variable is undocumented.
.El
.Pp
The following list provides a name and short description for variables
that are used when building documentation.
.Bl -tag -width Ar
.It Va DISTDIR
.Vt ( str )
Where distfiles are kept.
Normally, this is
.Pa distfiles
in
.Va PORTSDIR .
.It Va DOC_LANG
.Vt ( str )
The list of languages and encodings to build and install.
.It Va PRINTERDEVICE
.Vt ( str )
The default format for system documentation, depends on your
printer.
This can be set to
.Dq Li ascii
for simple printers or
.Dq Li ps
for postscript or graphics printers with a ghostscript
filter.
.El
.Pp
The following list provides a name and short description for variables
that are used when building ports:
.Bl -tag -width Ar
.It Va FORCE_PKG_RESIDENT
.Vt ( bool )
Set this to override any existing package registration.
.It Va HAVE_MOTIF
.Vt ( bool )
Set this if you have Motif on your system.
.It Va KRB5_HOME
.Vt ( str )
Set this if you want to install the MIT Kerberos5 port somewhere
other than
.Pa /usr/local .
.It Va LOCALBASE
.Vt ( str )
Set this to the base directory that non\-X ports should be
installed in.
It provides the default for
.Va PREFIX
when building in
.Pa /usr/ports .
.It Va MASTER_SITE_AFTERSTEP
.Vt ( str )
Set this to change the master site for AfterStep ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_BACKUP
.Vt ( str )
Controls the site location that ports check for distfiles if the
locations listed in their
.Pa Makefile
do not work.
The last part of the path must be
.Dq Li /${DIST_SUBDIR}/ .
.It Va MASTER_SITE_COMP_SOURCES
.Vt ( str )
Controls the master site location for
.Pa comp.sources
ports.
The
last part of the path must be
.Dq Li %SUBDIR%/
.It Va MASTER_SITE_GNOME
.Vt ( str )
Controls the master site location for GNOME ports.
The
last part of the path must be
.Dq Li /%SUBDIR%/
.It Va MASTER_SITE_GNU
.Vt ( str )
Controls the master site location for GNU ports.
The
last part of the path must be
.Dq Li /%SUBDIR%/
.It Va MASTER_SITE_KDE
.Vt ( str )
Controls the master site location for KDE ports.
The
last part of the path must be
.Dq Li /%SUBDIR%/
.It Va MASTER_SITE_FREEBSD
.Vt ( bool )
If set, go to the master
.Fx
site for all files.
.It Va MASTER_SITE_MOZILLA
.Vt ( str )
Controls the master site location for Mozilla ports.
The
last part of the path must be
.Dq Li /%SUBDIR%/
.It Va MASTER_SITE_OVERRIDE
.Vt ( str )
If set, this site is checked before the sites listed in the ports
.Pa Makefile .
You can have it check the backup site first by like so:
.Bd -literal -offset indent
MASTER_SITE_OVERRIDE?=	${MASTER_SITE_BACKUP}
.Ed
.It Va MASTER_SITE_PERL_CPAN
.Vt ( str )
Controls the master site location for Perl ports.
The
last part of the path must be
.Bd -literal -offset indent
/%SUBDIR%/
.Ed
.It Va MASTER_SORT_REGEX
.Vt ( str )
Set this to control the sort order for mirror sets.
To set it to
prefer mirrors in the
.Pa .jp
domain, use:
.Bd -literal -offset indent
MASTER_SORT_REGEX?=	^file: ^ftp://ftp\.FreeBSD\.org/pub/FreeBSD/ports/local-distfiles/ ://[^/]*\.jp/ ://[^/]*\.jp\.
.Ed
.Pp
Users of other ccTLD domains should change the
.Dq Li jp
to the
appropriate domain.
.It Va MASTER_SITE_RINGSERVER
.Vt ( str )
Controls the master site location for Ringserver ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_RUBY
.Vt ( str )
Controls the master site location for Ruby ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_SUNSITE
.Vt ( str )
Controls the master site location for Sunsite ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_TCLTK
.Vt ( str )
Controls the master site location for Tcl and Tk ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_TEX_CTAN
.Vt ( str )
Controls the master site location for TeX ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_WINDOWMAKER
.Vt ( str )
Controls the master site location for WindowMaker ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_XCONTRIB
.Vt ( str )
Controls the master site location for contributed X ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_XEMACS
.Vt ( str )
Controls the master site location for Xemacs ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MASTER_SITE_XFREE
.Vt ( str )
Controls the master site location for XFree ports.
The last
part of the path must be
.Dq Li /%SUBDIR%/ .
.It Va MOTIFLIB
.Vt ( str )
Location of
.Pa libXm.a
and
.Pa libXm.so .
.It Va MOTIF_STATIC
.Vt ( bool )
Set this if you want ports that use Motif to be built so they
can be run on systems without the Motif shared libraries.
.It Va NOCLEANDEPENDS
.Vt ( bool )
Set this to prevent
.Dq Li "make clean"
from cleaning the ports that the one being cleaned depends on.
.It Va NOPORTDOCS
.Vt ( bool )
Set this to disable installing additional documentation with ports.
.It Va PACKAGES
.Vt ( str )
Used only for the package target; the directory for the package tree.
.It Va PATCH_SITES
.Vt ( str )
Primary location(s) for the distribution of patch files.
.It Va PORTSDIR
.Vt ( str )
The location of the ports tree.
.It Va USA_RESIDENT
.Vt ( bool )
Set this if you are a resident of the USA so that ports that
need to can attempt to comply with U.S. export regulations.
.It Va WRKDIRPREFIX
.Vt ( str )
Where to create temporary files used when building ports.
.It Va X11BASE
.Vt ( str )
Should be set to where the X11 distribution has been
installed if it is installed anywhere other than
.Pa /usr/X11R6 .
.El
.Sh FILES
.Bl -tag -width /etc/defaults/make.conf -compact
.It Pa /etc/defaults/make.conf
.It Pa /etc/make.conf
.It Pa /usr/doc/Makefile
.It Pa /usr/src/Makefile
.It Pa /usr/src/Makefile.inc1
.It Pa /usr/ports/Mk/bsd.port.mk
.It Pa /usr/ports/Mk/bsd.sites.mk
.El
.Sh SEE ALSO
.Xr gcc 1 ,
.Xr install 1 ,
.Xr lpd 8 ,
.Xr make 1 ,
.Xr make 7 ,
.Xr ports 7 ,
.Xr sendmail 8
.Sh HISTORY
The
.Nm
file appeared sometime before
.Fx 4.0 .
.Sh AUTHORS
This
manual page was written by
.An Mike W. Meyer Aq mwm@mired.org .
.Sh BUGS
This manual page may occasionally be out of date with respect to
the options currently available for use in
.Nm .
Please check the
.Pa /etc/defaults/make.conf
file for the latest options which are available.
