freebsd/freebsd-src/share/man/man5/procfs.5
.\" $Id: procfs.5,v 1.3 1996/12/09 07:45:50 mpp Exp $
.\" Written by Garrett Wollman
.\" This file is in the public domain.
.\"
.Dd August 10, 1994
.Dt PROCFS 5
.Os BSD 4.4
.Sh NAME
.Nm procfs
.Nd process file system
.Sh SYNOPSIS
.Bd -literal
proc		/proc	procfs	rw 0 0
.Ed
.Sh DESCRIPTION
The process file system, or
.Nm procfs ,
implements a view of the system process table inside the file system.
It is normally mounted on
.Pa /proc ,
and is required for the complete operation of programs such as
.Xr ps 1
and
.Xr w 1 .
.Pp
The
.Nm
provides a two-level view of process space, unlike the previous
.Fx 1.1
.Nm
implementation.
At the highest level, processes themselves are named, according to
their process ids in decimal, with no leading zeros.  There is also a
special node called
.Pa curproc
which always refers to the process making the lookup request.
.Pp
Each node is a directory which contains the following entries:
.Bl -tag -width fpregsxx
.It Pa ctl
used to send control messages to the process, such as might be used by
a debugger
.It Pa etype
the type of the current executable image
.It Pa file
the executable image 
.It Pa fpregs
the process floating point register set
.It Pa map
map of the process' address space
.It Pa mem
the complete virtual address space of the process
.It Pa note
used to send signals to the process (not currently implemented)
.It Pa notepg
used to send signals to the process group that the process belongs to
(not currently implemented)
.It Pa regs
the process register set
.It Pa status
the process's current status
.El
.Pp
Each node is owned by the process's user, and belongs to that user's
primary group, except for the
.Pa mem
node, which belongs to the
.Li kmem
group instead.
.Pp
This manual page should eventually document what you can do with all
these nodes.
.Sh FILES
.Bl -tag -width /procxx
.It Pa /proc
normal mount point for the
.Nm procfs .
.El
.Sh AUTHOR
This manual page written by Garrett Wollman, based on the description
provided by Jan-Simon Pendry.
