freebsd/freebsd-src/share/man/man5/resolver.5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\" Copyright (c) 2026 Dag-Erling Smørgrav
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 6, 2026
.Dt RESOLVER 5
.Os
.Sh NAME
.Nm resolver
.Nd resolver configuration file
.Sh SYNOPSIS
.Nm resolv.conf
.Sh DESCRIPTION
The
.Xr resolver 3
is a set of routines in the C library
which provide access to the Internet Domain Name System.
The resolver configuration file contains information that is read
by the resolver routines the first time they are invoked by a process.
.Pp
The file is read line by line.
Anything after a
.Sq #
or
.Sq \&;
character is considered a comment and discarded.
Blank lines are ignored.
The first word on each non-blank line is a keyword which determines
how the rest of the line is interpreted.
Available keywords are:
.Bl -tag -width indent
.It Cm nameserver Ar address
IPv4 or IPv6 address of a name server that the resolver should query.
Up to
.Dv MAXNS
(currently 3) name servers may be listed on separate lines.
If there are multiple servers, the resolver library queries them in
the order listed, unless
.Dv RES_ROTATE
is in effect
.Po
See the
.Cm rotate
option below
.Pc .
If no
.Cm nameserver
entries are present,
the default is to use the name server on the local machine.
(The algorithm used is to try a name server, and if the query times out,
try the next, until out of name servers,
then repeat trying all the name servers
until a maximum number of retries are made).
.It Cm domain Ar name
Set both the local domain name and the search list to
.Ar name .
Most queries for names within this domain can use short names
relative to the local domain.
If no domain name has been set, it is derived from the local host name
returned by
.Xr gethostname 3 ;
the domain part is taken to be everything after the first
.Ql \&. .
Finally, if the host name does not contain a domain part, the root
domain is assumed.
.It Cm search Ar name1 Op name2 ...
Set the domain search list.
Additionally, sets the local domain to
.Ar name1 .
Most resolver queries will be attempted using each component
of the search path in turn until a match is found.
Note that this process may be slow and will generate a lot of network
traffic if the servers for the listed domains are not local,
and that queries will time out if no server is available
for one of the domains.
.Pp
The search list is currently limited to six domains
with a total of 256 characters.
.It Sy sortlist
Sortlist allows addresses returned by the resolver to be sorted.
A sortlist is specified by IP address netmask pairs.
If the netmask is not specified,
it defaults to the historical Class A/B/C netmask of the net;
this usage is deprecated.
The IP address
and network pairs are separated by slashes.
Up to 10 pairs may
be specified.
E.g.,
.Pp
.Dl "sortlist 10.9.1.0/255.255.240.0 10.9.0.0/255.255.0.0"
.It Cm options Ar option1 Op Ar option2 ...
Options allows certain internal resolver variables to be modified.
The following options are supported:
.Bl -tag -width indent
.It Cm debug
Set
.Dv RES_DEBUG
in
.Va _res.options .
.It Cm usevc
Set
.Dv RES_USEVC
to use TCP instead of UDP for queries.
.It Cm ndots Ns Li : Ns Ar n
Set a threshold for the number of dots which must appear in a name given to
.Fn res_query
(see
.Xr resolver 3 )
before an
.Em initial absolute query
will be made.
The default for
.Em n
is
.Dq 1 ,
meaning that if there are any dots in a name, the name
will be tried first as an absolute name before any
.Em search list
elements are appended to it.
.It Cm timeout Ns Li : Ns Ar n
Set the initial amount of time the resolver will wait
for a response from a remote
name server before retrying the query via a different name server.
The resolver may wait longer during subsequent retries
of the current query since an exponential back-off is applied to
the timeout value.
Measured in seconds, the default is
.Dv RES_TIMEOUT ,
the allowed maximum is
.Dv RES_MAXRETRANS
(see
.In resolv.h ) .
.It Cm attempts Ns Li : Ns Ar n
Set the number of times the resolver will send a query to each of
its name servers
before giving up and returning an error to the calling application.
The default is
.Dv RES_DFLRETRY ,
the allowed maximum is
.Dv RES_MAXRETRY
(see
.In resolv.h ) .
.It Cm edns0
Set
.Dv RES_USE_EDNS0 .
Attach an OPT pseudo-RR for the EDNS0 extension,
as specified in RFC 2671.
This allows the resolver to advertise a larger UDP receive buffer size,
permitting responses larger than the original 512-byte limit.
.It Cm inet6
Set
.Dv RES_USE_INET6 .
Causes the resolver
to look up AAAA records before A records
and to map IPv4 responses into IPv6 addresses.
The use of this option is discouraged.
.It Cm insecure1
Set
.Dv RES_INSECURE1 .
This disables the check that the response was received from the
same server to which the query was sent.
Use of this option is a security risk and is not recommended.
.It Cm insecure2
Set
.Dv RES_INSECURE2 .
This disables the check that the response contains a query
matching the one that was sent.
Use of this option is a security risk and is not recommended.
.It Cm no-check-names
Set
.Dv RES_NOCHECKNAME .
This disables the check of incoming host names for invalid characters
such as underscore, non-ASCII, or control characters.
.It Cm no-tld-query
Set
.Dv RES_NOTLDQUERY .
This tells the resolver not to attempt to resolve a top level domain
name, that is, a name that contains no dots.
Use of this option does not prevent
the resolver from obeying the standard
.Cm domain
and
.Cm search
rules with the given name.
.It Cm rotate
Set
.Dv RES_ROTATE .
This causes the resolver to round-robin among the configured name
servers, distributing the query load instead of always trying the
first listed server.
.It Cm reload-period Ns Li : Ns Ar n
The resolver checks the modification time of
.Pa /etc/resolv.conf
if more than
.Ar n
seconds have elapsed since the last check.
If the file has changed, it is automatically reloaded.
The default for
.Ar n
is two seconds.
Setting it to zero disables the file check.
.El
.Pp
Options may also be passed as a space- or tab-separated list in the
.Dv RES_OPTIONS
environment variable.
This environment variable is applied after the configuration file has
been read.
.El
.Pp
The
.Cm domain
and
.Cm search
keywords are mutually exclusive.
If more than one instance of these keywords is present,
the last instance will override all previous instances.
.Pp
The keyword and value must appear on a single line, and the keyword
.Pq for example, Sy nameserver
must start the line.
The value follows the keyword, separated by white space.
.Sh ENVIRONMENT
.Bl -tag -width indent
.It Dv LOCALDOMAIN
If set, overrides the local domain and search list set in the resolver
configuration file.
.It Dv RES_OPTIONS
If set, its value is split into words and interpreted as resolver
options as described for the
.Cm options
keyword in the resolver configuration file.
.El
.Sh FILES
.Bl -tag -width indent
.It Pa /etc/resolv.conf
resolver configuration file
.El
.Sh EXAMPLES
.Bd -literal
# Set the local domain to example.com and the search list to
# example.com, example.net, example.org
search example.com example.net example.org

# Set the local domain and search list to example.com,
# completely overriding the previous line
domain example.com

# Use this if you are running a local caching forwarding (or
# recursing) resolver like local-unbound(8)
nameserver 127.0.0.1

# IP address of the local or ISP name service
nameserver 198.51.100.53
nameserver 203.0.113.53

# Enable EDNS0, which tells the name server that we are capable of
# handling large responses.  This is required for DNSSEC.
options edns0
.Ed
.Sh SEE ALSO
.Xr getaddrinfo 3 ,
.Xr gethostbyname 3 ,
.Xr gethostname 3 ,
.Xr resolver 3 ,
.Xr hostname 7 ,
.Xr resolvconf 8
.Sh HISTORY
The
.Nm resolv.conf
file format appeared in
.Bx 4.3 .
