freebsd/freebsd-src/share/man/man5/src.conf.5
.\" DO NOT EDIT-- this file is automatically generated.
.\" from FreeBSD$
.\" $FreeBSD$
.Dd June 26, 2008
.Dt SRC.CONF 5
.Os
.Sh NAME
.Nm src.conf
.Nd "source build options"
.Sh DESCRIPTION
The
.Nm
file contains settings that will apply to every build involving the
.Fx
source tree; see
.Xr build 7 .
.Pp
The
.Nm
file uses the standard makefile syntax.
However,
.Nm
should not specify any dependencies to
.Xr make 1 .
Instead,
.Nm
is to set
.Xr make 1
variables that control the aspects of how the system builds.
.Pp
The default location of
.Nm
is
.Pa /etc/src.conf ,
though an alternative location can be specified in the
.Xr make 1
variable
.Va SRCCONF .
Overriding the location of
.Nm
may be necessary if the system-wide settings are not suitable
for a particular build.
For instance, setting
.Va SRCCONF
to
.Pa /dev/null
effectively resets all build controls to their defaults.
.Pp
The only purpose of
.Nm
is to control the compilation of the
.Fx
source code, which is usually located in
.Pa /usr/src .
As a rule, the system administrator creates
.Nm
when the values of certain control variables need to be changed
from their defaults.
.Pp
In addition, control variables can be specified
for a particular build via the
.Fl D
option of
.Xr make 1
or in environment; see
.Xr environ 7 .
.Pp
The values of variables are ignored regardless of their setting;
even if they would be set to
.Dq Li FALSE
or
.Dq Li NO .
Just the existence of an option will cause
it to be honoured by
.Xr make 1 .
.Pp
The following list provides a name and short description for variables
that can be used for source builds.
.Bl -tag -width indent
.It Va WITHOUT_ACPI
.\" $FreeBSD$
Set to not build
.Xr acpiconf 8 ,
.Xr acpidump 8
and related programs.
.It Va WITHOUT_ASSERT_DEBUG
.\" $FreeBSD$
Set to compile programs and libraries without the
.Xr assert 3
checks.
.It Va WITHOUT_ATM
.\" $FreeBSD$
Set to not build
programs and libraries related to ATM networking.
.It Va WITHOUT_AUDIT
.\" $FreeBSD$
Set to not build audit support into system programs.
.It Va WITHOUT_AUTHPF
.\" $FreeBSD$
Set to not build
.Xr authpf 8 .
.It Va WITHOUT_BIND
.\" $FreeBSD$
Setting this variable will prevent any part of BIND from being built.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BIND_DNSSEC
.It
.Va WITHOUT_BIND_ETC
.It
.Va WITHOUT_BIND_LIBS_LWRES
.It
.Va WITHOUT_BIND_MTREE
.It
.Va WITHOUT_BIND_NAMED
.It
.Va WITHOUT_BIND_UTILS
.El
.It Va WITHOUT_BIND_DNSSEC
.\" $FreeBSD$
Set to avoid building or installing the DNSSEC related binaries,
.Xr dnssec-keygen 8
and
.Xr dnssec-signzone 8 .
.It Va WITHOUT_BIND_ETC
.\" $FreeBSD$
Set to avoid installing the default files to
.Pa /var/named/etc/namedb .
.It Va WITH_BIND_LIBS
.\" $FreeBSD$
Set to install BIND libraries and include files.
.It Va WITHOUT_BIND_LIBS_LWRES
.\" $FreeBSD$
Set to avoid installing the lightweight resolver library in
.Pa /usr/lib .
.It Va WITHOUT_BIND_MTREE
.\" $FreeBSD$
Set to avoid running
.Xr mtree 8
to create the chroot directory structure under
.Pa /var/named ,
and avoid creating an
.Pa /etc/namedb
symlink to the chroot directory.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BIND_ETC
.El
.It Va WITHOUT_BIND_NAMED
.\" $FreeBSD$
Set to avoid building or installing
.Xr named 8 ,
.Xr named.reload 8 ,
.Xr named-checkconf 8 ,
.Xr named-checkzone 8 ,
.Xr rndc 8 ,
and
.Xr rndc-confgen 8 .
.It Va WITHOUT_BIND_UTILS
.\" $FreeBSD$
Set to avoid building or installing the BIND userland utilities,
.Xr dig 1 ,
.Xr host 1 ,
.Xr nslookup 1 ,
and
.Xr nsupdate 8 .
.It Va WITHOUT_BLUETOOTH
.\" $FreeBSD$
Set to not build Bluetooth related kernel modules, programs and libraries.
.It Va WITHOUT_BOOT
.\" $FreeBSD$
Set to not build the boot blocks and loader.
.It Va WITHOUT_BSD_CPIO
.\" from FreeBSD: head/tools/build/options/WITHOUT_BSD_CPIO 179813 2008-06-16 05:48:15Z dougb
Set to not build the BSD licensed version of cpio based on
.Xr libarchive 3 .
.It Va WITHOUT_BZIP2
.\" $FreeBSD$
Set to not build contributed bzip2 software as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BZIP2_SUPPORT
.El
.It Va WITHOUT_BZIP2_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional bzip2 support.
.It Va WITHOUT_CALENDAR
.\" $FreeBSD$
Set to not build
.Xr calendar 1 .
.It Va WITHOUT_CDDL
.\" $FreeBSD$
Set to not build code licensed under Sun's CDDL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_ZFS
.El
.It Va WITHOUT_CPP
.\" $FreeBSD$
Set to not build
.Xr cpp 1 .
.It Va WITHOUT_CRYPT
.\" $FreeBSD$
Set to not build any crypto code.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GSSAPI
(can be overridden with
.Va WITH_GSSAPI )
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL
.El
.It Va WITHOUT_CVS
.\" $FreeBSD$
Set to not build CVS.
.It Va WITHOUT_CXX
.\" $FreeBSD$
Set to not build
.Xr g++ 1
and related libraries.
.It Va WITHOUT_DICT
.\" $FreeBSD$
Set to not build the Webster dictionary files.
.It Va WITHOUT_DYNAMICROOT
.\" $FreeBSD$
Set this if you do not want to link
.Pa /bin
and
.Pa /sbin
dynamically.
.It Va WITHOUT_EXAMPLES
.\" $FreeBSD$
Set to avoid installing examples to
.Pa /usr/share/examples/ .
.It Va WITHOUT_FORTH
.\" $FreeBSD$
Set to build bootloaders without Forth support.
.It Va WITHOUT_FP_LIBC
.\" $FreeBSD$
Set to build
.Nm libc
without floating-point support.
.It Va WITHOUT_GAMES
.\" $FreeBSD$
Set to not build games.
.It Va WITHOUT_GCOV
.\" $FreeBSD$
Set to not build the
.Xr gcov 1
tool.
.It Va WITHOUT_GDB
.\" $FreeBSD$
Set to not build
.Xr gdb 1 .
.It Va WITHOUT_GNU
.\" $FreeBSD$
Set to not build contributed GNU software as a part of the base system.
This option can be useful if the system built must not contain any code
covered by the GNU Public License due to legal reasons.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GNU_SUPPORT
.El
.It Va WITH_GNU_CPIO
.\" from FreeBSD: head/tools/build/options/WITH_GNU_CPIO 179813 2008-06-16 05:48:15Z dougb
Set to build GNU cpio as a part of the base system,
and symlink
.Pa /usr/bin/cpio
to this version.
(This will override the symlink to the BSD version.)
.It Va WITHOUT_GNU_GREP
.\" from FreeBSD: head/tools/build/options/WITHOUT_GNU_GREP 179813 2008-06-16 05:48:15Z dougb
Set to not build GNU grep as a part of the base system.
.It Va WITHOUT_GNU_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional GNU support.
.It Va WITHOUT_GPIB
.\" $FreeBSD$
Set to not build GPIB bus support.
.It Va WITHOUT_GROFF
.\" $FreeBSD$
Set to not build
.Xr groff 1 .
.It Va WITHOUT_GSSAPI
.\" $FreeBSD$
Set to not build libgssapi.
.It Va WITH_HESIOD
.\" $FreeBSD$
Set to build Hesiod support.
.It Va WITHOUT_HTML
.\" $FreeBSD$
Set to not build HTML docs.
.It Va WITH_IDEA
.\" $FreeBSD$
Set to build the IDEA encryption code.
This code is patented in the USA and many European countries.
It is
.Em "YOUR RESPONSIBILITY"
to determine if you can legally use IDEA.
.It Va WITHOUT_INET6
.\" $FreeBSD$
Set to not build
programs and libraries related to IPv6 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET6_SUPPORT
.El
.It Va WITHOUT_INET6_SUPPORT
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without IPv6 support.
.It Va WITHOUT_INFO
.\" $FreeBSD$
Set to not make or install
.Xr info 5
files.
.It Va WITHOUT_INSTALLLIB
.\" $FreeBSD$
Set this if you do not want to install optional libraries.
For example when creating a
.Xr nanobsd 8
image.
.It Va WITHOUT_IPFILTER
.\" $FreeBSD$
Set to not build IP Filter package.
.It Va WITHOUT_IPX
.\" $FreeBSD$
Set to not build programs and libraries related to IPX networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_IPX_SUPPORT
.It
.Va WITHOUT_NCP
.El
.It Va WITHOUT_IPX_SUPPORT
.\" $FreeBSD$
Set to build some programs without IPX support.
.It Va WITHOUT_KERBEROS
.\" $FreeBSD$
Set this if you do not want to build Kerberos 5 (KTH Heimdal).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GSSAPI
(can be overridden with
.Va WITH_GSSAPI )
.It
.Va WITHOUT_KERBEROS_SUPPORT
.El
.It Va WITHOUT_KERBEROS_SUPPORT
.\" $FreeBSD$
Set to build some programs without Kerberos support, like
.Xr cvs 1 ,
.Xr ssh 1 ,
.Xr telnet 1 ,
.Xr sshd 8 ,
and
.Xr telnetd 8 .
.It Va WITHOUT_KVM
.\" $FreeBSD$
Set to not build the
.Nm libkvm
library as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KVM_SUPPORT
.El
.It Va WITHOUT_KVM_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional
.Nm libkvm
support.
.It Va WITHOUT_LIB32
.\" $FreeBSD$
On amd64, set to not build 32-bit library set and a
.Nm ld-elf32.so.1
runtime linker.
.It Va WITHOUT_LIBPTHREAD
.\" $FreeBSD$
Set to not build either of the
.Nm libpthread
providing libraries
.Nm ( libthr
(1:1) &
.Nm libkse
(M:N)).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BIND
.It
.Va WITHOUT_BIND_DNSSEC
.It
.Va WITHOUT_BIND_ETC
.It
.Va WITHOUT_BIND_LIBS_LWRES
.It
.Va WITHOUT_BIND_MTREE
.It
.Va WITHOUT_BIND_NAMED
.It
.Va WITHOUT_BIND_UTILS
.It
.Va WITHOUT_LIBTHR
.El
.It Va WITHOUT_LIBTHR
.\" $FreeBSD$
Set to not build the
.Nm libthr
(1:1 threading)
library.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BIND
.It
.Va WITHOUT_BIND_DNSSEC
.It
.Va WITHOUT_BIND_ETC
.It
.Va WITHOUT_BIND_LIBS_LWRES
.It
.Va WITHOUT_BIND_MTREE
.It
.Va WITHOUT_BIND_NAMED
.It
.Va WITHOUT_BIND_UTILS
.El
.It Va WITHOUT_LOCALES
.\" $FreeBSD$
Set to not build localization files; see
.Xr locale 1 .
.It Va WITHOUT_LPR
.\" $FreeBSD$
Set to not build
.Xr lpr 1
and related programs.
.It Va WITHOUT_MAILWRAPPER
.\" $FreeBSD$
Set to not build the
.Xr mailwrapper 8
MTA selector.
.It Va WITHOUT_MAN
.\" $FreeBSD$
Set to not build manual pages.
.It Va WITHOUT_NCP
.\" $FreeBSD$
Set to not build programs, libraries, and kernel modules
related to NetWare Core protocol.
.It Va WITHOUT_NETCAT
.\" $FreeBSD$
Set to not build
.Xr nc 1
utility.
.It Va WITHOUT_NIS
.\" $FreeBSD$
Set to not build
.Xr NIS 8
support and related programs.
If set, you might need to adopt your
.Xr nsswitch.conf 5
and remove
.Sq nis
entries.
.It Va WITHOUT_NLS
.\" $FreeBSD$
Set to not build NLS catalogs.
.It Va WITHOUT_NLS_CATALOGS
.\" $FreeBSD$
Set to not build NLS catalog support for
.Xr csh 1 .
.It Va WITHOUT_NS_CACHING
.\" $FreeBSD$
Set to disable name caching in the
.Pa nsswitch
subsystem.
The generic caching daemon,
.Xr nscd 8 ,
will not be built either if this option is set.
.It Va WITHOUT_OBJC
.\" $FreeBSD$
Set to not build Objective C support.
.It Va WITHOUT_OPENSSH
.\" $FreeBSD$
Set to not build OpenSSH.
.It Va WITHOUT_OPENSSL
.\" $FreeBSD$
Set to not build OpenSSL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GSSAPI
(can be overridden with
.Va WITH_GSSAPI )
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.El
.It Va WITHOUT_PAM
.\" $FreeBSD$
Set to not build PAM library and modules.
.Bf -symbolic
This option is deprecated and does nothing.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_PAM_SUPPORT
.El
.It Va WITHOUT_PAM_SUPPORT
.\" $FreeBSD$
Set to build some programs without PAM support, particularly
.Xr ftpd 8
and
.Xr ppp 8 .
.It Va WITHOUT_PF
.\" $FreeBSD$
Set to not build PF firewall package.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_AUTHPF
.El
.It Va WITHOUT_PROFILE
.\" $FreeBSD$
Set to avoid compiling profiled libraries.
.It Va WITHOUT_RCMDS
.\" $FreeBSD$
Disable building of the
.Bx
r-commands.
This includes
.Xr rlogin 1 ,
.Xr rsh 1 ,
etc.
.It Va WITHOUT_RCS
.\" $FreeBSD$
Set to not build
.Xr rcs 1
and related utilities.
.It Va WITHOUT_RESCUE
.\" $FreeBSD$
Set to not build
.Xr rescue 8 .
.It Va WITHOUT_SENDMAIL
.\" $FreeBSD$
Set to not build
.Xr sendmail 8
and related programs.
.It Va WITHOUT_SETUID_LOGIN
.\" $FreeBSD$
Set this to disable the installation of
.Xr login 1
as a set-user-ID root program.
.It Va WITHOUT_SHAREDOCS
.\" $FreeBSD$
Set to not build the
.Bx 4.4
legacy docs.
.It Va WITHOUT_SSP
.\" from FreeBSD: head/tools/build/options/WITHOUT_SSP 180012 2008-06-25 21:33:28Z ru
Set to not build world with propolice stack smashing protection.
.It Va WITHOUT_SYMVER
.\" $FreeBSD$
Set to disable symbol versioning when building shared libraries.
.It Va WITHOUT_SYSCONS
.\" $FreeBSD$
Set to not build
.Xr syscons 4
support files such as keyboard maps, fonts, and screen output maps.
.It Va WITHOUT_TCSH
.\" $FreeBSD$
Set to not build and install
.Pa /bin/csh
(which is
.Xr tcsh 1 ) .
.It Va WITHOUT_TOOLCHAIN
.\" $FreeBSD$
Set to not install
programs used for program development,
compilers, debuggers etc.
.Bf -symbolic
The option does not work for build targets.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GDB
.El
.It Va WITHOUT_USB
.\" $FreeBSD$
Set to not build USB-related programs and libraries.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
.\" $FreeBSD$
Build
.Xr wpa_supplicant 8
without support for the IEEE 802.1X protocol and without
support for EAP-PEAP, EAP-TLS, EAP-LEAP, and EAP-TTLS
protocols (usable only via 802.1X).
.It Va WITHOUT_ZFS
.\" $FreeBSD$
Set to not build ZFS file system.
.It Va WITHOUT_ZONEINFO
.\" $FreeBSD$
Set to not build the timezone database
.El
.Sh FILES
.Bl -tag -compact
.It Pa /etc/src.conf
.It Pa /usr/share/mk/bsd.own.mk
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7
.Sh HISTORY
The
.Nm
file appeared in
.Fx 7.0 .
.Sh AUTHORS
This manual page was autogenerated.
