freebsd/freebsd-src/share/man/man5/src.conf.5
.\" DO NOT EDIT-- this file is automatically generated.
.\" from FreeBSD: head/tools/build/options/makeman 255964 2013-10-01 07:22:04Z des
.\" $FreeBSD$
.Dd December 4, 2013
.Dt SRC.CONF 5
.Os
.Sh NAME
.Nm src.conf
.Nd "source build options"
.Sh DESCRIPTION
The
.Nm
file contains settings that will apply to every build involving the
.Fx
source tree; see
.Xr build 7 .
.Pp
The
.Nm
file uses the standard makefile syntax.
However,
.Nm
should not specify any dependencies to
.Xr make 1 .
Instead,
.Nm
is to set
.Xr make 1
variables that control the aspects of how the system builds.
.Pp
The default location of
.Nm
is
.Pa /etc/src.conf ,
though an alternative location can be specified in the
.Xr make 1
variable
.Va SRCCONF .
Overriding the location of
.Nm
may be necessary if the system-wide settings are not suitable
for a particular build.
For instance, setting
.Va SRCCONF
to
.Pa /dev/null
effectively resets all build controls to their defaults.
.Pp
The only purpose of
.Nm
is to control the compilation of the
.Fx
source code, which is usually located in
.Pa /usr/src .
As a rule, the system administrator creates
.Nm
when the values of certain control variables need to be changed
from their defaults.
.Pp
In addition, control variables can be specified
for a particular build via the
.Fl D
option of
.Xr make 1
or in its environment; see
.Xr environ 7 .
.Pp
The values of variables are ignored regardless of their setting;
even if they would be set to
.Dq Li FALSE
or
.Dq Li NO .
Just the existence of an option will cause
it to be honoured by
.Xr make 1 .
.Pp
The following list provides a name and short description for variables
that can be used for source builds.
.Bl -tag -width indent
.It Va WITHOUT_ACCT
.\" from FreeBSD: head/tools/build/options/WITHOUT_ACCT 223201 2011-06-17 20:47:44Z ed
Set to not build process accounting tools such as
.Xr accton 8
and
.Xr sa 8 .
.It Va WITHOUT_ACPI
.\" from FreeBSD: head/tools/build/options/WITHOUT_ACPI 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr acpiconf 8 ,
.Xr acpidump 8
and related programs.
.It Va WITHOUT_AMD
.\" from FreeBSD: head/tools/build/options/WITHOUT_AMD 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr amd 8 ,
and related programs.
.It Va WITHOUT_APM
.\" from FreeBSD: head/tools/build/options/WITHOUT_APM 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr apm 8 ,
.Xr apmd 8
and related programs.
.It Va WITHOUT_ARM_EABI
.\" from FreeBSD: head/tools/build/options/WITHOUT_ARM_EABI 253396 2013-07-16 19:15:19Z andrew
Set the ARM ABI to OABI.
.It Va WITHOUT_ASSERT_DEBUG
.\" from FreeBSD: head/tools/build/options/WITHOUT_ASSERT_DEBUG 162215 2006-09-11 13:55:27Z ru
Set to compile programs and libraries without the
.Xr assert 3
checks.
.It Va WITHOUT_AT
.\" from FreeBSD: head/tools/build/options/WITHOUT_AT 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr at 1
and related utilities.
.It Va WITHOUT_ATF
.\" from FreeBSD: head/tools/build/options/WITHOUT_ATF 241823 2012-10-22 01:18:41Z marcel
Set to not build programs and libraries related to the ATF testing framework.
.It Va WITHOUT_ATM
.\" from FreeBSD: head/tools/build/options/WITHOUT_ATM 156932 2006-03-21 07:50:50Z ru
Set to not build
programs and libraries related to ATM networking.
.It Va WITHOUT_AUDIT
.\" from FreeBSD: head/tools/build/options/WITHOUT_AUDIT 156932 2006-03-21 07:50:50Z ru
Set to not build audit support into system programs.
.It Va WITHOUT_AUTHPF
.\" from FreeBSD: head/tools/build/options/WITHOUT_AUTHPF 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr authpf 8 .
.It Va WITHOUT_BINUTILS
.\" from FreeBSD: head/tools/build/options/WITHOUT_BINUTILS 255974 2013-10-01 17:40:56Z emaste
Set to not install binutils (as, c++-filt, gconv,
ld, nm, objcopy, objdump, readelf, size and strip).
.Bf -symbolic
The option does not generally work for build targets, unless some alternative
toolchain is enabled.
.Ef
.It Va WITHOUT_BLUETOOTH
.\" from FreeBSD: head/tools/build/options/WITHOUT_BLUETOOTH 156932 2006-03-21 07:50:50Z ru
Set to not build Bluetooth related kernel modules, programs and libraries.
.It Va WITHOUT_BMAKE
.\" from FreeBSD: head/tools/build/options/WITHOUT_BMAKE 250839 2013-05-21 00:41:49Z delphij
Set to not build and install the portable BSD make (bmake) as
.Xr make 1
instead of the traditional FreeBSD make.
This build option is temporary.
It allows developers to switch to bmake in order to work out any remaining
kinks or issues.
This option will be removed in due time.
.It Va WITHOUT_BOOT
.\" from FreeBSD: head/tools/build/options/WITHOUT_BOOT 156932 2006-03-21 07:50:50Z ru
Set to not build the boot blocks and loader.
.It Va WITHOUT_BSD_CPIO
.\" from FreeBSD: head/tools/build/options/WITHOUT_BSD_CPIO 179813 2008-06-16 05:48:15Z dougb
Set to not build the BSD licensed version of cpio based on
.Xr libarchive 3 .
.It Va WITH_BSD_GREP
.\" from FreeBSD: head/tools/build/options/WITH_BSD_GREP 222273 2011-05-25 01:04:12Z obrien
Install BSD-licensed grep as '[ef]grep' instead of GNU grep.
.It Va WITHOUT_BSNMP
.\" from FreeBSD: head/tools/build/options/WITHOUT_BSNMP 183306 2008-09-23 16:15:42Z sam
Set to not build or install
.Xr bsnmpd 1
and related libraries and data files.
.It Va WITHOUT_BZIP2
.\" from FreeBSD: head/tools/build/options/WITHOUT_BZIP2 174550 2007-12-12 16:43:17Z ru
Set to not build contributed bzip2 software as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BZIP2_SUPPORT
.El
.It Va WITHOUT_BZIP2_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_BZIP2_SUPPORT 166255 2007-01-26 10:19:08Z delphij
Set to build some programs without optional bzip2 support.
.It Va WITHOUT_CALENDAR
.\" from FreeBSD: head/tools/build/options/WITHOUT_CALENDAR 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr calendar 1 .
.It Va WITHOUT_CAPSICUM
.\" from FreeBSD: head/tools/build/options/WITHOUT_CAPSICUM 229319 2012-01-02 21:57:58Z rwatson
Set to not build Capsicum support into system programs.
.It Va WITHOUT_CDDL
.\" from FreeBSD: head/tools/build/options/WITHOUT_CDDL 163861 2006-11-01 09:02:11Z jb
Set to not build code licensed under Sun's CDDL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CTF
.It
.Va WITHOUT_ZFS
.El
.It Va WITHOUT_CLANG
.\" from FreeBSD: head/tools/build/options/WITHOUT_CLANG 208971 2010-06-10 06:20:26Z ed
Set to not build the Clang C/C++ compiler.
.Pp
It is a default setting on
arm/armeb, ia64/ia64, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32 and sparc64/sparc64.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.El
.It Va WITH_CLANG
.\" from FreeBSD: head/tools/build/options/WITH_CLANG 221730 2011-05-10 11:14:40Z ru
Set to build the Clang C/C++ compiler.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armv6, i386/i386, pc98/i386, powerpc/powerpc and powerpc/powerpc64.
.It Va WITH_CLANG_EXTRAS
.\" from FreeBSD: head/tools/build/options/WITH_CLANG_EXTRAS 231057 2012-02-05 23:56:22Z dim
Set to build additional clang and llvm tools, such as bugpoint.
.It Va WITHOUT_CLANG_FULL
.\" from FreeBSD: head/tools/build/options/WITHOUT_CLANG_FULL 246259 2013-02-02 22:28:29Z dim
Set to avoid building the ARCMigrate, Rewriter and StaticAnalyzer components of
the Clang C/C++ compiler.
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, ia64/ia64, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32 and sparc64/sparc64.
.It Va WITH_CLANG_FULL
.\" from FreeBSD: head/tools/build/options/WITH_CLANG_FULL 246259 2013-02-02 22:28:29Z dim
Set to build the ARCMigrate, Rewriter and StaticAnalyzer components of the
Clang C/C++ compiler.
.Pp
It is a default setting on
amd64/amd64, i386/i386, pc98/i386, powerpc/powerpc and powerpc/powerpc64.
.It Va WITHOUT_CLANG_IS_CC
.\" from FreeBSD: head/tools/build/options/WITHOUT_CLANG_IS_CC 242629 2012-11-05 21:53:23Z brooks
Set to install the GCC compiler as
.Pa /usr/bin/cc ,
.Pa /usr/bin/c++
and
.Pa /usr/bin/cpp .
.Pp
It is a default setting on
arm/armeb, ia64/ia64, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LLDB
.El
.It Va WITH_CLANG_IS_CC
.\" from FreeBSD: head/tools/build/options/WITH_CLANG_IS_CC 235342 2012-05-12 16:12:36Z gjb
Set to install the Clang C/C++ compiler as
.Pa /usr/bin/cc ,
.Pa /usr/bin/c++
and
.Pa /usr/bin/cpp .
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armv6, i386/i386 and pc98/i386.
.It Va WITHOUT_CPP
.\" from FreeBSD: head/tools/build/options/WITHOUT_CPP 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr cpp 1 .
.It Va WITHOUT_CROSS_COMPILER
.\" from FreeBSD: head/tools/build/options/WITHOUT_CROSS_COMPILER 250659 2013-05-15 14:30:03Z brooks
Set to not build a cross compiler in the cross-tools stage of
buildworld, buildkernel, etc.
.It Va WITHOUT_CRYPT
.\" from FreeBSD: head/tools/build/options/WITHOUT_CRYPT 156932 2006-03-21 07:50:50Z ru
Set to not build any crypto code.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITH_CTF
.\" from FreeBSD: head/tools/build/options/WITH_CTF 228159 2011-11-30 18:22:44Z fjoe
Set to compile with CTF (Compact C Type Format) data.
CTF data encapsulates a reduced form of debugging information
similar to DWARF and the venerable stabs and is required for DTrace.
.It Va WITHOUT_CTM
.\" from FreeBSD: head/tools/build/options/WITHOUT_CTM 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr ctm 1
and related utilities.
.It Va WITHOUT_CXX
.\" from FreeBSD: head/tools/build/options/WITHOUT_CXX 220402 2011-04-06 20:19:07Z uqs
Set to not build
.Xr g++ 1
and related libraries.
It will also prevent building of
.Xr gperf 1
and
.Xr devd 8 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_GROFF
.El
.It Va WITH_DEBUG_FILES
.\" from FreeBSD: head/tools/build/options/WITH_DEBUG_FILES 251512 2013-06-07 21:40:02Z emaste
Set to strip debug info into a separate file for each executable binary
and shared library.
The debug files will be placed in a subdirectory of
.Pa /usr/lib/debug
and are located automatically by
.Xr gdb 1 .
.It Va WITHOUT_DICT
.\" from FreeBSD: head/tools/build/options/WITHOUT_DICT 156932 2006-03-21 07:50:50Z ru
Set to not build the Webster dictionary files.
.It Va WITHOUT_DYNAMICROOT
.\" from FreeBSD: head/tools/build/options/WITHOUT_DYNAMICROOT 156932 2006-03-21 07:50:50Z ru
Set this if you do not want to link
.Pa /bin
and
.Pa /sbin
dynamically.
.It Va WITHOUT_ED_CRYPTO
.\" from FreeBSD: head/tools/build/options/WITHOUT_ED_CRYPTO 235660 2012-05-19 20:05:27Z marcel
Set to build
.Xr ed 1
without support for encryption/decryption.
.It Va WITHOUT_EXAMPLES
.\" from FreeBSD: head/tools/build/options/WITHOUT_EXAMPLES 156938 2006-03-21 09:06:24Z ru
Set to avoid installing examples to
.Pa /usr/share/examples/ .
.It Va WITHOUT_FDT
.\" from FreeBSD: head/tools/build/options/WITHOUT_FDT 221539 2011-05-06 19:10:27Z ru
Set to not build Flattened Device Tree support as part of the base system.
This includes the device tree compiler (dtc) and libfdt support library.
.Pp
It is a default setting on
amd64/amd64, i386/i386, ia64/ia64, pc98/i386 and sparc64/sparc64.
.It Va WITH_FDT
.\" from FreeBSD: head/tools/build/options/WITH_FDT 221730 2011-05-10 11:14:40Z ru
Set to build Flattened Device Tree support as part of the base system.
This includes the device tree compiler (dtc) and libfdt support library.
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc and powerpc/powerpc64.
.It Va WITHOUT_FLOPPY
.\" from FreeBSD: head/tools/build/options/WITHOUT_FLOPPY 221540 2011-05-06 19:13:03Z ru
Set to not build or install programs
for operating floppy disk driver.
.It Va WITHOUT_FORMAT_EXTENSIONS
.\" from FreeBSD: head/tools/build/options/WITHOUT_FORMAT_EXTENSIONS 250658 2013-05-15 13:04:10Z brooks
Set to not enable
.Fl fformat-extensions
when compiling the kernel.
Also disables all format checking.
.It Va WITHOUT_FORTH
.\" from FreeBSD: head/tools/build/options/WITHOUT_FORTH 156932 2006-03-21 07:50:50Z ru
Set to build bootloaders without Forth support.
.It Va WITHOUT_FP_LIBC
.\" from FreeBSD: head/tools/build/options/WITHOUT_FP_LIBC 156932 2006-03-21 07:50:50Z ru
Set to build
.Nm libc
without floating-point support.
.It Va WITHOUT_FREEBSD_UPDATE
.\" from FreeBSD: head/tools/build/options/WITHOUT_FREEBSD_UPDATE 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr freebsd-update 8 .
.It Va WITHOUT_GAMES
.\" from FreeBSD: head/tools/build/options/WITHOUT_GAMES 156932 2006-03-21 07:50:50Z ru
Set to not build games.
.It Va WITHOUT_GCC
.\" from FreeBSD: head/tools/build/options/WITHOUT_GCC 255326 2013-09-06 20:49:48Z zeising
Set to not build and install gcc and g++.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armv6 and i386/i386.
.It Va WITH_GCC
.\" from FreeBSD: head/tools/build/options/WITH_GCC 255326 2013-09-06 20:49:48Z zeising
Set to build and install gcc and g++.
.Pp
It is a default setting on
arm/armeb, ia64/ia64, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GCOV
.\" from FreeBSD: head/tools/build/options/WITHOUT_GCOV 156932 2006-03-21 07:50:50Z ru
Set to not build the
.Xr gcov 1
tool.
.It Va WITHOUT_GDB
.\" from FreeBSD: head/tools/build/options/WITHOUT_GDB 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr gdb 1 .
.It Va WITHOUT_GNU
.\" from FreeBSD: head/tools/build/options/WITHOUT_GNU 174550 2007-12-12 16:43:17Z ru
Set to not build contributed GNU software as a part of the base system.
This option can be useful if the system built must not contain any code
covered by the GNU Public License due to legal reasons.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GNU_SUPPORT
.El
.It Va WITHOUT_GNUCXX
.\" from FreeBSD: head/tools/build/options/WITHOUT_GNUCXX 255321 2013-09-06 20:08:03Z theraven
Do not build the GNU C++ stack (g++, libstdc++).
This is the default on platforms where clang is the system compiler.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armv6, i386/i386 and pc98/i386.
.It Va WITH_GNUCXX
.\" from FreeBSD: head/tools/build/options/WITH_GNUCXX 255321 2013-09-06 20:08:03Z theraven
Build the GNU C++ stack (g++, libstdc++).
This is the default on platforms where gcc is the system compiler.
.Pp
It is a default setting on
arm/armeb, ia64/ia64, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GNU_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_GNU_SUPPORT 156932 2006-03-21 07:50:50Z ru
Set to build some programs without optional GNU support.
.It Va WITHOUT_GPIB
.\" from FreeBSD: head/tools/build/options/WITHOUT_GPIB 156932 2006-03-21 07:50:50Z ru
Set to not build GPIB bus support.
.It Va WITHOUT_GPIO
.\" from FreeBSD: head/tools/build/options/WITHOUT_GPIO 228081 2011-11-28 17:54:34Z dim
Set to not build
.Xr gpioctl 8
as part of the base system.
.It Va WITH_GPL_DTC
.\" from FreeBSD: head/tools/build/options/WITH_GPL_DTC 246262 2013-02-02 22:42:46Z dim
Set to build the GPL'd version of the device tree compiler from elinux.org,
instead of the BSD licensed one.
.It Va WITHOUT_GROFF
.\" from FreeBSD: head/tools/build/options/WITHOUT_GROFF 218941 2011-02-22 08:13:49Z uqs
Set to not build
.Xr groff 1
and
.Xr vgrind 1 .
You should consider installing the textproc/groff port to not break
.Xr man 1 .
.It Va WITHOUT_GSSAPI
.\" from FreeBSD: head/tools/build/options/WITHOUT_GSSAPI 174548 2007-12-12 16:39:32Z ru
Set to not build libgssapi.
.It Va WITH_HESIOD
.\" from FreeBSD: head/tools/build/options/WITH_HESIOD 156932 2006-03-21 07:50:50Z ru
Set to build Hesiod support.
.It Va WITHOUT_HTML
.\" from FreeBSD: head/tools/build/options/WITHOUT_HTML 156932 2006-03-21 07:50:50Z ru
Set to not build HTML docs.
.It Va WITHOUT_ICONV
.\" from FreeBSD: head/tools/build/options/WITHOUT_ICONV 254919 2013-08-26 17:15:56Z antoine
Set to not build iconv as part of libc.
.It Va WITHOUT_INET
.\" from FreeBSD: head/tools/build/options/WITHOUT_INET 221266 2011-04-30 17:58:28Z bz
Set to not build programs and libraries related to IPv4 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET_SUPPORT
.El
.It Va WITHOUT_INET6
.\" from FreeBSD: head/tools/build/options/WITHOUT_INET6 156932 2006-03-21 07:50:50Z ru
Set to not build
programs and libraries related to IPv6 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET6_SUPPORT
.El
.It Va WITHOUT_INET6_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_INET6_SUPPORT 156932 2006-03-21 07:50:50Z ru
Set to build libraries, programs, and kernel modules without IPv6 support.
.It Va WITHOUT_INET_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_INET_SUPPORT 221266 2011-04-30 17:58:28Z bz
Set to build libraries, programs, and kernel modules without IPv4 support.
.It Va WITHOUT_INFO
.\" from FreeBSD: head/tools/build/options/WITHOUT_INFO 156932 2006-03-21 07:50:50Z ru
Set to not make or install
.Xr info 5
files.
.It Va WITHOUT_INSTALLLIB
.\" from FreeBSD: head/tools/build/options/WITHOUT_INSTALLLIB 174497 2007-12-09 21:56:21Z dougb
Set this if you do not want to install optional libraries.
For example when creating a
.Xr nanobsd 8
image.
.It Va WITH_INSTALL_AS_USER
.\" from FreeBSD: head/tools/build/options/WITH_INSTALL_AS_USER 238021 2012-07-02 20:24:01Z marcel
Set to make install targets succeed for non-root users by installing
files with owner and group attributes set to that of the user running
the
.Xr make 1
command.
The user still has to set the
.Va DESTDIR
variable to point to a directory where the user has write permissions.
.It Va WITHOUT_IPFILTER
.\" from FreeBSD: head/tools/build/options/WITHOUT_IPFILTER 156932 2006-03-21 07:50:50Z ru
Set to not build IP Filter package.
.It Va WITHOUT_IPFW
.\" from FreeBSD: head/tools/build/options/WITHOUT_IPFW 183242 2008-09-21 22:02:26Z sam
Set to not build IPFW tools.
.It Va WITHOUT_IPX
.\" from FreeBSD: head/tools/build/options/WITHOUT_IPX 156932 2006-03-21 07:50:50Z ru
Set to not build programs and libraries related to IPX networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_IPX_SUPPORT
.El
.It Va WITHOUT_IPX_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_IPX_SUPPORT 156932 2006-03-21 07:50:50Z ru
Set to build some programs without IPX support.
.It Va WITHOUT_JAIL
.\" from FreeBSD: head/tools/build/options/WITHOUT_JAIL 249966 2013-04-27 04:09:09Z eadler
Set to not build tools for the support of jails; e.g.,
.Xr jail 8 .
.It Va WITHOUT_KDUMP
.\" from FreeBSD: head/tools/build/options/WITHOUT_KDUMP 240690 2012-09-19 11:38:37Z zeising
Set to not build
.Xr kdump 1
and
.Xr truss 1 .
.It Va WITHOUT_KERBEROS
.\" from FreeBSD: head/tools/build/options/WITHOUT_KERBEROS 174549 2007-12-12 16:42:03Z ru
Set this if you do not want to build Kerberos 5 (KTH Heimdal).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS_SUPPORT
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITHOUT_KERBEROS_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_KERBEROS_SUPPORT 251794 2013-06-15 20:29:07Z eadler
Set to build some programs without Kerberos support, like
.Xr ssh 1 ,
.Xr telnet 1 ,
.Xr sshd 8 ,
and
.Xr telnetd 8 .
.It Va WITHOUT_KERNEL_SYMBOLS
.\" from FreeBSD: head/tools/build/options/WITHOUT_KERNEL_SYMBOLS 222189 2011-05-22 18:23:17Z imp
Set to not install kernel symbol files.
.Bf -symbolic
This option is recommended for those people who have small root partitions.
.Ef
.It Va WITHOUT_KVM
.\" from FreeBSD: head/tools/build/options/WITHOUT_KVM 174550 2007-12-12 16:43:17Z ru
Set to not build the
.Nm libkvm
library as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KVM_SUPPORT
.El
.It Va WITHOUT_KVM_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_KVM_SUPPORT 170644 2007-06-13 02:08:04Z sepotvin
Set to build some programs without optional
.Nm libkvm
support.
.It Va WITHOUT_LDNS
.\" from FreeBSD: head/tools/build/options/WITHOUT_LDNS 255591 2013-09-15 13:11:13Z des
Setting this variable will prevent the LDNS library from being built.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LDNS_UTILS
.It
.Va WITHOUT_UNBOUND
.El
.It Va WITHOUT_LDNS_UTILS
.\" from FreeBSD: head/tools/build/options/WITHOUT_LDNS_UTILS 255850 2013-09-24 14:33:31Z des
Setting this variable will prevent building the LDNS utilities
.Xr drill 1
and
.Xr host 1 .
.It Va WITHOUT_LEGACY_CONSOLE
.\" from FreeBSD: head/tools/build/options/WITHOUT_LEGACY_CONSOLE 249966 2013-04-27 04:09:09Z eadler
Set to not build programs that support a legacy PC console; e.g.,
.Xr kbdcontrol 8
and
.Xr vidcontrol 8 .
.It Va WITHOUT_LIB32
.\" from FreeBSD: head/tools/build/options/WITHOUT_LIB32 156932 2006-03-21 07:50:50Z ru
On amd64, set to not build 32-bit library set and a
.Nm ld-elf32.so.1
runtime linker.
.It Va WITHOUT_LIBCPLUSPLUS
.\" from FreeBSD: head/tools/build/options/WITHOUT_LIBCPLUSPLUS 246262 2013-02-02 22:42:46Z dim
Set to avoid building libcxxrt and libc++.
.It Va WITHOUT_LIBPTHREAD
.\" from FreeBSD: head/tools/build/options/WITHOUT_LIBPTHREAD 188848 2009-02-20 11:09:55Z mtm
Set to not build the
.Nm libpthread
providing library,
.Nm libthr .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LIBTHR
.El
.It Va WITHOUT_LIBTHR
.\" from FreeBSD: head/tools/build/options/WITHOUT_LIBTHR 156932 2006-03-21 07:50:50Z ru
Set to not build the
.Nm libthr
(1:1 threading)
library.
.It Va WITH_LLDB
.\" from FreeBSD: head/tools/build/options/WITH_LLDB 255722 2013-09-20 01:52:02Z emaste
Set to build the LLDB debugger.
.It Va WITHOUT_LOCALES
.\" from FreeBSD: head/tools/build/options/WITHOUT_LOCALES 156932 2006-03-21 07:50:50Z ru
Set to not build localization files; see
.Xr locale 1 .
.It Va WITHOUT_LOCATE
.\" from FreeBSD: head/tools/build/options/WITHOUT_LOCATE 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr locate 1
and related programs.
.It Va WITHOUT_LPR
.\" from FreeBSD: head/tools/build/options/WITHOUT_LPR 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr lpr 1
and related programs.
.It Va WITHOUT_LS_COLORS
.\" from FreeBSD: head/tools/build/options/WITHOUT_LS_COLORS 235660 2012-05-19 20:05:27Z marcel
Set to build
.Xr ls 1
without support for colors to distinguish file types.
.It Va WITHOUT_MAIL
.\" from FreeBSD: head/tools/build/options/WITHOUT_MAIL 183242 2008-09-21 22:02:26Z sam
Set to not build any mail support (MUA or MTA).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_MAILWRAPPER
.It
.Va WITHOUT_SENDMAIL
.El
.It Va WITHOUT_MAILWRAPPER
.\" from FreeBSD: head/tools/build/options/WITHOUT_MAILWRAPPER 156932 2006-03-21 07:50:50Z ru
Set to not build the
.Xr mailwrapper 8
MTA selector.
.It Va WITHOUT_MAKE
.\" from FreeBSD: head/tools/build/options/WITHOUT_MAKE 183242 2008-09-21 22:02:26Z sam
Set to not install
.Xr make 1
and related support files.
.It Va WITHOUT_MAN
.\" from FreeBSD: head/tools/build/options/WITHOUT_MAN 156932 2006-03-21 07:50:50Z ru
Set to not build manual pages.
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_MAN_UTILS
(unless
.Va WITH_MAN_UTILS
is set explicitly)
.El
.It Va WITHOUT_MAN_UTILS
.\" from FreeBSD: head/tools/build/options/WITHOUT_MAN_UTILS 208322 2010-05-20 00:07:21Z jkim
Set to not build utilities for manual pages,
.Xr apropos 1 ,
.Xr catman 1 ,
.Xr makewhatis 1 ,
.Xr man 1 ,
.Xr whatis 1 ,
.Xr manctl 8 ,
and related support files.
.It Va WITH_NAND
.\" from FreeBSD: head/tools/build/options/WITH_NAND 235537 2012-05-17 10:11:18Z gber
Set to build the NAND Flash components.
.It Va WITHOUT_NDIS
.\" from FreeBSD: head/tools/build/options/WITHOUT_NDIS 183242 2008-09-21 22:02:26Z sam
Set to not build programs and libraries
related to NDIS emulation support.
.It Va WITHOUT_NETCAT
.\" from FreeBSD: head/tools/build/options/WITHOUT_NETCAT 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr nc 1
utility.
.It Va WITHOUT_NETGRAPH
.\" from FreeBSD: head/tools/build/options/WITHOUT_NETGRAPH 183242 2008-09-21 22:02:26Z sam
Set to not build applications to support
.Xr netgraph 4 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_ATM
.It
.Va WITHOUT_BLUETOOTH
.It
.Va WITHOUT_NETGRAPH_SUPPORT
.El
.It Va WITHOUT_NETGRAPH_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_NETGRAPH_SUPPORT 183305 2008-09-23 16:11:15Z sam
Set to build libraries, programs, and kernel modules without netgraph support.
.It Va WITHOUT_NIS
.\" from FreeBSD: head/tools/build/options/WITHOUT_NIS 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr NIS 8
support and related programs.
If set, you might need to adopt your
.Xr nsswitch.conf 5
and remove
.Sq nis
entries.
.It Va WITHOUT_NLS
.\" from FreeBSD: head/tools/build/options/WITHOUT_NLS 156932 2006-03-21 07:50:50Z ru
Set to not build NLS catalogs.
.It Va WITHOUT_NLS_CATALOGS
.\" from FreeBSD: head/tools/build/options/WITHOUT_NLS_CATALOGS 156932 2006-03-21 07:50:50Z ru
Set to not build NLS catalog support for
.Xr csh 1 .
.It Va WITHOUT_NMTREE
.\" from FreeBSD: head/tools/build/options/WITHOUT_NMTREE 257138 2013-10-25 22:45:18Z brooks
Set to install
.Xr fmtree 8
as
.Xr mtree 8 .
By default
.Xr nmtree 8
is installed as
.Xr mtree 8 .
.It Va WITHOUT_NS_CACHING
.\" from FreeBSD: head/tools/build/options/WITHOUT_NS_CACHING 172803 2007-10-19 14:01:25Z ru
Set to disable name caching in the
.Pa nsswitch
subsystem.
The generic caching daemon,
.Xr nscd 8 ,
will not be built either if this option is set.
.It Va WITHOUT_NTP
.\" from FreeBSD: head/tools/build/options/WITHOUT_NTP 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr ntpd 8
and related programs.
.It Va WITH_OFED
.\" from FreeBSD: head/tools/build/options/WITH_OFED 228081 2011-11-28 17:54:34Z dim
Set to build the
.Dq "OpenFabrics Enterprise Distribution"
Infiniband software stack.
.It Va WITHOUT_OPENSSH
.\" from FreeBSD: head/tools/build/options/WITHOUT_OPENSSH 156932 2006-03-21 07:50:50Z ru
Set to not build OpenSSH.
.It Va WITH_OPENSSH_NONE_CIPHER
.\" from FreeBSD: head/tools/build/options/WITH_OPENSSH_NONE_CIPHER 245527 2013-01-17 01:51:04Z bz
Set to include the "None" cipher support in OpenSSH and its libraries.
Additional adjustments may need to be done to system configuration
files, such as
.Xr sshd_config 5 ,
to enable this cipher.
Please see
.Pa /usr/src/crypto/openssh/README.hpn
for full details.
.It Va WITHOUT_OPENSSL
.\" from FreeBSD: head/tools/build/options/WITHOUT_OPENSSL 156932 2006-03-21 07:50:50Z ru
Set to not build OpenSSL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITHOUT_PAM
.\" from FreeBSD: head/tools/build/options/WITHOUT_PAM 174550 2007-12-12 16:43:17Z ru
Set to not build PAM library and modules.
.Bf -symbolic
This option is deprecated and does nothing.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_PAM_SUPPORT
.El
.It Va WITHOUT_PAM_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_PAM_SUPPORT 156932 2006-03-21 07:50:50Z ru
Set to build some programs without PAM support, particularly
.Xr ftpd 8
and
.Xr ppp 8 .
.It Va WITHOUT_PC_SYSINSTALL
.\" from FreeBSD: head/tools/build/options/WITHOUT_PC_SYSINSTALL 245606 2013-01-18 15:57:09Z eadler
Set to not build
.Xr pc-sysinstall 8
and related programs.
.It Va WITHOUT_PF
.\" from FreeBSD: head/tools/build/options/WITHOUT_PF 156932 2006-03-21 07:50:50Z ru
Set to not build PF firewall package.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_AUTHPF
.El
.It Va WITHOUT_PKGBOOTSTRAP
.\" from FreeBSD: head/tools/build/options/WITHOUT_PKGBOOTSTRAP 258924 2013-12-04 15:58:42Z bdrewery
Set to not build
.Xr pkg 7
bootstrap tool.
.It Va WITHOUT_PMC
.\" from FreeBSD: head/tools/build/options/WITHOUT_PMC 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr pmccontrol 8
and related programs.
.It Va WITHOUT_PORTSNAP
.\" from FreeBSD: head/tools/build/options/WITHOUT_PORTSNAP 183242 2008-09-21 22:02:26Z sam
Set to not build or install
.Xr portsnap 8
and related files.
.It Va WITHOUT_PPP
.\" from FreeBSD: head/tools/build/options/WITHOUT_PPP 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr ppp 8
and related programs.
.It Va WITHOUT_PROFILE
.\" from FreeBSD: head/tools/build/options/WITHOUT_PROFILE 228196 2011-12-02 09:09:54Z fjoe
Set to avoid compiling profiled libraries.
.It Va WITHOUT_QUOTAS
.\" from FreeBSD: head/tools/build/options/WITHOUT_QUOTAS 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr quota 8
and related programs.
.It Va WITHOUT_RCMDS
.\" from FreeBSD: head/tools/build/options/WITHOUT_RCMDS 156932 2006-03-21 07:50:50Z ru
Disable building of the
.Bx
r-commands.
This includes
.Xr rlogin 1 ,
.Xr rsh 1 ,
etc.
.It Va WITHOUT_RCS
.\" from FreeBSD: head/tools/build/options/WITHOUT_RCS 256198 2013-10-09 17:07:20Z gjb
Set to not build
.Xr rcs 1
and related utilities.
.It Va WITHOUT_RESCUE
.\" from FreeBSD: head/tools/build/options/WITHOUT_RESCUE 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr rescue 8 .
.It Va WITHOUT_ROUTED
.\" from FreeBSD: head/tools/build/options/WITHOUT_ROUTED 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr routed 8
utility.
.It Va WITHOUT_SENDMAIL
.\" from FreeBSD: head/tools/build/options/WITHOUT_SENDMAIL 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr sendmail 8
and related programs.
.It Va WITHOUT_SETUID_LOGIN
.\" from FreeBSD: head/tools/build/options/WITHOUT_SETUID_LOGIN 156932 2006-03-21 07:50:50Z ru
Set this to disable the installation of
.Xr login 1
as a set-user-ID root program.
.It Va WITHOUT_SHAREDOCS
.\" from FreeBSD: head/tools/build/options/WITHOUT_SHAREDOCS 156932 2006-03-21 07:50:50Z ru
Set to not build the
.Bx 4.4
legacy docs.
.It Va WITH_SHARED_TOOLCHAIN
.\" from FreeBSD: head/tools/build/options/WITH_SHARED_TOOLCHAIN 235342 2012-05-12 16:12:36Z gjb
Set to build the toolchain binaries shared.
The set includes
.Xr cc 1 ,
.Xr make 1
and necessary utilities like assembler, linker and library archive manager.
.It Va WITHOUT_SOURCELESS
.\" from FreeBSD: head/tools/build/options/WITHOUT_SOURCELESS 230972 2012-02-04 00:54:43Z rmh
Set to not build kernel modules that include sourceless code (either microcode or native code for host CPU).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_SOURCELESS_HOST
.It
.Va WITHOUT_SOURCELESS_UCODE
.El
.It Va WITHOUT_SOURCELESS_HOST
.\" from FreeBSD: head/tools/build/options/WITHOUT_SOURCELESS_HOST 230972 2012-02-04 00:54:43Z rmh
Set to not build kernel modules that include sourceless native code for host CPU.
.It Va WITHOUT_SOURCELESS_UCODE
.\" from FreeBSD: head/tools/build/options/WITHOUT_SOURCELESS_UCODE 230972 2012-02-04 00:54:43Z rmh
Set to not build kernel modules that include sourceless microcode.
.It Va WITHOUT_SSP
.\" from FreeBSD: head/tools/build/options/WITHOUT_SSP 180012 2008-06-25 21:33:28Z ru
Set to not build world with propolice stack smashing protection.
.It Va WITH_SVN
.\" from FreeBSD: head/tools/build/options/WITH_SVN 252561 2013-07-03 12:36:47Z zeising
Set to install
.Xr svnlite 1
as
.Xr svn 1 .
.It Va WITHOUT_SVNLITE
.\" from FreeBSD: head/tools/build/options/WITHOUT_SVNLITE 252561 2013-07-03 12:36:47Z zeising
Set to not build
.Xr svnlite 1
and related programs.
.It Va WITHOUT_SYMVER
.\" from FreeBSD: head/tools/build/options/WITHOUT_SYMVER 169649 2007-05-17 05:03:24Z deischen
Set to disable symbol versioning when building shared libraries.
.It Va WITHOUT_SYSCONS
.\" from FreeBSD: head/tools/build/options/WITHOUT_SYSCONS 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr syscons 4
support files such as keyboard maps, fonts, and screen output maps.
.It Va WITHOUT_SYSINSTALL
.\" from FreeBSD: head/tools/build/options/WITHOUT_SYSINSTALL 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr sysinstall 8
and related programs.
.It Va WITHOUT_TCSH
.\" from FreeBSD: head/tools/build/options/WITHOUT_TCSH 156932 2006-03-21 07:50:50Z ru
Set to not build and install
.Pa /bin/csh
(which is
.Xr tcsh 1 ) .
.It Va WITHOUT_TELNET
.\" from FreeBSD: head/tools/build/options/WITHOUT_TELNET 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr telnet 8
and related programs.
.It Va WITH_TESTS
.\" from FreeBSD: head/tools/build/options/WITH_TESTS 258014 2013-11-11 21:13:14Z gjb
Set to install the Kyua test suite.
.It Va WITHOUT_TEXTPROC
.\" from FreeBSD: head/tools/build/options/WITHOUT_TEXTPROC 183242 2008-09-21 22:02:26Z sam
Set to not build
programs used for text processing.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GROFF
.El
.It Va WITHOUT_TOOLCHAIN
.\" from FreeBSD: head/tools/build/options/WITHOUT_TOOLCHAIN 174550 2007-12-12 16:43:17Z ru
Set to not install
programs used for program development,
compilers, debuggers etc.
.Bf -symbolic
The option does not work for build targets.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BINUTILS
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_GCC
.It
.Va WITHOUT_GDB
.El
.It Va WITHOUT_UNBOUND
.\" from FreeBSD: head/tools/build/options/WITHOUT_UNBOUND 255597 2013-09-15 14:51:23Z des
Set to not build
.Xr unbound 8
and related programs.
.It Va WITHOUT_USB
.\" from FreeBSD: head/tools/build/options/WITHOUT_USB 156932 2006-03-21 07:50:50Z ru
Set to not build USB-related programs and libraries.
.It Va WITH_USB_GADGET_EXAMPLES
.\" from FreeBSD: head/tools/build/options/WITH_USB_GADGET_EXAMPLES 254919 2013-08-26 17:15:56Z antoine
Set to build USB gadget kernel modules.
.It Va WITHOUT_UTMPX
.\" from FreeBSD: head/tools/build/options/WITHOUT_UTMPX 231530 2012-02-11 20:28:42Z ed
Set to not build user accounting tools such as
.Xr last 1 ,
.Xr users 1 ,
.Xr who 1 ,
.Xr ac 8 ,
.Xr lastlogin 8
and
.Xr utx 8 .
.It Va WITHOUT_WIRELESS
.\" from FreeBSD: head/tools/build/options/WITHOUT_WIRELESS 183242 2008-09-21 22:02:26Z sam
Set to not build programs used for 802.11 wireless networks; especially
.Xr wpa_supplicant 8
and
.Xr hostapd 8 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_WIRELESS_SUPPORT
.El
.It Va WITHOUT_WIRELESS_SUPPORT
.\" from FreeBSD: head/tools/build/options/WITHOUT_WIRELESS_SUPPORT 183305 2008-09-23 16:11:15Z sam
Set to build libraries, programs, and kernel modules without
802.11 wireless support.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
.\" from FreeBSD: head/tools/build/options/WITHOUT_WPA_SUPPLICANT_EAPOL 156932 2006-03-21 07:50:50Z ru
Build
.Xr wpa_supplicant 8
without support for the IEEE 802.1X protocol and without
support for EAP-PEAP, EAP-TLS, EAP-LEAP, and EAP-TTLS
protocols (usable only via 802.1X).
.It Va WITHOUT_ZFS
.\" from FreeBSD: head/tools/build/options/WITHOUT_ZFS 168409 2007-04-06 02:13:30Z pjd
Set to not build ZFS file system.
.It Va WITHOUT_ZONEINFO
.\" from FreeBSD: head/tools/build/options/WITHOUT_ZONEINFO 235342 2012-05-12 16:12:36Z gjb
Set to not build the timezone database.
.El
.Sh FILES
.Bl -tag -compact -width Pa
.It Pa /etc/src.conf
.It Pa /usr/share/mk/bsd.own.mk
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7
.Sh HISTORY
The
.Nm
file appeared in
.Fx 7.0 .
.Sh AUTHORS
This manual page was autogenerated.
