freebsd/freebsd-src/share/man/man5/src.conf.5
.\" DO NOT EDIT-- this file is automatically generated.
.\" from FreeBSD: src/tools/build/options/makeman,v 1.2 2006/03/21 09:08:45 ru Exp
.\" $FreeBSD$
.Dd March 21, 2006
.Dt SRC.CONF 5
.Os
.Sh NAME
.Nm src.conf
.Nd source build options
.Sh DESCRIPTION
The
.Nm
file contains settings that will apply to every build involving the
.Fx
source tree; see
.Xr build 7 .
.Pp
The
.Nm
file uses the standard makefile syntax.
However,
.Nm
should not specify any dependencies to
.Xr make 1 .
Instead,
.Nm
is to set
.Xr make 1
variables that control the aspects of how the system builds.
.Pp
The default location of
.Nm
is
.Pa /etc/src.conf ,
though an alternative location can be specified in the
.Xr make 1
variable
.Va SRCCONF .
Overriding the location of
.Nm
maybe necessary if the system-wide settings are not suitable
for a particular build.
For instance, setting
.Va SRCCONF
to
.Pa /dev/null
effectively resets all build controls to their defaults.
.Pp
The only purpose of
.Nm
is to control the compilation of the
.Fx
sources, which are usually found in
.Pa /usr/src .
As a rule, the system administrator creates
.Nm
when the values of certain control variables need to be changed
from their defaults.
.Pp
In addition, control variables can be specified
for a particular build via the
.Fl D
option of
.Xr make 1
or in environment; see
.Xr environ 7 .
.Pp
The values of variables are ignored; the variable being
set at all (even to
.Dq Li FALSE
or
.Dq Li NO )
causes it to be treated as if it was set with no value.
.Pp
The following list provides a name and short description for variables
that can be used for source builds.
.Bl -tag -width indent
.It Va WITHOUT_ACPI
.\" from FreeBSD: src/tools/build/options/WITHOUT_ACPI,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr acpiconf 8 ,
.Xr acpidump 8
and related programs.
.It Va WITHOUT_ATM
.\" from FreeBSD: src/tools/build/options/WITHOUT_ATM,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
programs and libraries related to ATM networking.
.It Va WITHOUT_AUDIT
.\" from FreeBSD: src/tools/build/options/WITHOUT_AUDIT,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build audit support into system programs.
.It Va WITHOUT_AUTHPF
.\" from FreeBSD: src/tools/build/options/WITHOUT_AUTHPF,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr authpf 8 .
.It Va WITHOUT_BIND
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND,v 1.1 2006/03/21 07:50:49 ru Exp
Setting this variable will prevent any part of BIND from being built.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BIND_DNSSEC
.It
.Va WITHOUT_BIND_ETC
.It
.Va WITHOUT_BIND_LIBS_LWRES
.It
.Va WITHOUT_BIND_MTREE
.It
.Va WITHOUT_BIND_NAMED
.It
.Va WITHOUT_BIND_UTILS
.El
.It Va WITHOUT_BIND_DNSSEC
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND_DNSSEC,v 1.1 2006/03/21 07:50:49 ru Exp
Set to avoid building or installing the DNSSEC related binaries,
.Xr dnssec-keygen 8
and
.Xr dnssec-signzone 8 .
.It Va WITHOUT_BIND_ETC
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND_ETC,v 1.1 2006/03/21 07:50:49 ru Exp
Set to avoid installing the default files to
.Pa /var/named/etc/namedb .
.It Va WITH_BIND_LIBS
.\" from FreeBSD: src/tools/build/options/WITH_BIND_LIBS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to install BIND libraries and include files.
.It Va WITHOUT_BIND_LIBS_LWRES
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND_LIBS_LWRES,v 1.1 2006/03/21 07:50:49 ru Exp
Set to avoid installing the lightweight resolver library in
.Pa /usr/lib .
.It Va WITHOUT_BIND_MTREE
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND_MTREE,v 1.1 2006/03/21 07:50:49 ru Exp
Set to avoid running
.Xr mtree 8
to create the chroot directory structure under
.Pa /var/named ,
and avoid creating an
.Pa /etc/namedb
symlink to the chroot directory.
This option implies
.Va WITHOUT_BIND_ETC .
.It Va WITHOUT_BIND_NAMED
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND_NAMED,v 1.1 2006/03/21 07:50:49 ru Exp
Set to avoid building or installing
.Xr named 8 ,
.Xr named.reload 8 ,
.Xr named-checkconf 8 ,
.Xr named-checkzone 8 ,
.Xr rndc 8 ,
and
.Xr rndc-confgen 8 .
.It Va WITHOUT_BIND_UTILS
.\" from FreeBSD: src/tools/build/options/WITHOUT_BIND_UTILS,v 1.1 2006/03/21 07:50:49 ru Exp
Set to avoid building or installing the BIND userland utilities,
.Xr dig 1 ,
.Xr host 1 ,
.Xr nslookup 1 ,
and
.Xr nsupdate 8 .
.It Va WITHOUT_BLUETOOTH
.\" from FreeBSD: src/tools/build/options/WITHOUT_BLUETOOTH,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build Bluetooth related kernel modules, programs and libraries.
.It Va WITHOUT_BOOT
.\" from FreeBSD: src/tools/build/options/WITHOUT_BOOT,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build the boot blocks and loader.
.It Va WITHOUT_CALENDAR
.\" from FreeBSD: src/tools/build/options/WITHOUT_CALENDAR,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr calendar 1 .
.It Va WITHOUT_CPP
.\" from FreeBSD: src/tools/build/options/WITHOUT_CPP,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr cpp 1 .
.It Va WITHOUT_CRYPT
.\" from FreeBSD: src/tools/build/options/WITHOUT_CRYPT,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build any crypto code.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL
.El
.It Va WITHOUT_CVS
.\" from FreeBSD: src/tools/build/options/WITHOUT_CVS,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build CVS.
.It Va WITHOUT_CXX
.\" from FreeBSD: src/tools/build/options/WITHOUT_CXX,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr g++ 1
and related libraries.
.It Va WITHOUT_DICT
.\" from FreeBSD: src/tools/build/options/WITHOUT_DICT,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build the Webster dictionary files.
.It Va WITHOUT_DYNAMICROOT
.\" from FreeBSD: src/tools/build/options/WITHOUT_DYNAMICROOT,v 1.1 2006/03/21 07:50:49 ru Exp
Set this if you do not want to link
.Pa /bin
and
.Pa /sbin
dynamically.
.It Va WITHOUT_EXAMPLES
.\" from FreeBSD: src/tools/build/options/WITHOUT_EXAMPLES,v 1.2 2006/03/21 09:06:24 ru Exp
Set to avoid installing examples to
.Pa /usr/share/examples/ .
.It Va WITHOUT_FORTH
.\" from FreeBSD: src/tools/build/options/WITHOUT_FORTH,v 1.1 2006/03/21 07:50:49 ru Exp
Set to build bootloaders without Forth support.
.It Va WITHOUT_FORTRAN
.\" from FreeBSD: src/tools/build/options/WITHOUT_FORTRAN,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr g77 1
and related libraries.
.It Va WITHOUT_FP_LIBC
.\" from FreeBSD: src/tools/build/options/WITHOUT_FP_LIBC,v 1.1 2006/03/21 07:50:49 ru Exp
Set to build
.Nm libc
without floating-point support.
.It Va WITHOUT_GAMES
.\" from FreeBSD: src/tools/build/options/WITHOUT_GAMES,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build games.
.It Va WITHOUT_GCOV
.\" from FreeBSD: src/tools/build/options/WITHOUT_GCOV,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build the
.Xr gcov 1
tool.
.It Va WITHOUT_GDB
.\" from FreeBSD: src/tools/build/options/WITHOUT_GDB,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr gdb 1 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GNU_SUPPORT
.El
.It Va WITHOUT_GNU_SUPPORT
.\" from FreeBSD: src/tools/build/options/WITHOUT_GNU_SUPPORT,v 1.1 2006/03/21 07:50:49 ru Exp
Set to build some programs without optional GNU support.
.It Va WITHOUT_GPIB
.\" from FreeBSD: src/tools/build/options/WITHOUT_GPIB,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build GPIB bus support.
.It Va WITHOUT_GROFF
.\" from FreeBSD: src/tools/build/options/WITHOUT_GROFF,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build
.Xr groff 1 .
.It Va WITH_HESIOD
.\" from FreeBSD: src/tools/build/options/WITH_HESIOD,v 1.1 2006/03/21 07:50:50 ru Exp
Set to build Hesiod support.
.It Va WITHOUT_HTML
.\" from FreeBSD: src/tools/build/options/WITHOUT_HTML,v 1.1 2006/03/21 07:50:49 ru Exp
Set to not build HTML docs.
.It Va WITHOUT_I4B
.\" from FreeBSD: src/tools/build/options/WITHOUT_I4B,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build isdn4bsd package.
.It Va WITH_IDEA
.\" from FreeBSD: src/tools/build/options/WITH_IDEA,v 1.1 2006/03/21 07:50:50 ru Exp
Set to build the IDEA encryption code.
This code is patented in the USA and many European countries.
It is
.Em "YOUR RESPONSIBILITY"
to determine if you can legally use IDEA.
.It Va WITHOUT_INET6
.\" from FreeBSD: src/tools/build/options/WITHOUT_INET6,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
programs and libraries related to IPv6 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET6_SUPPORT
.El
.It Va WITHOUT_INET6_SUPPORT
.\" from FreeBSD: src/tools/build/options/WITHOUT_INET6_SUPPORT,v 1.1 2006/03/21 07:50:50 ru Exp
Set to build libraries, programs, and kernel modules without IPv6 support.
.It Va WITHOUT_INFO
.\" from FreeBSD: src/tools/build/options/WITHOUT_INFO,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not make or install
.Xr info 5
files.
.It Va WITHOUT_IPFILTER
.\" from FreeBSD: src/tools/build/options/WITHOUT_IPFILTER,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build IP Filter package.
.It Va WITHOUT_IPX
.\" from FreeBSD: src/tools/build/options/WITHOUT_IPX,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build programs and libraries related to IPX networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_IPX_SUPPORT
.It
.Va WITHOUT_NCP
.El
.It Va WITHOUT_IPX_SUPPORT
.\" from FreeBSD: src/tools/build/options/WITHOUT_IPX_SUPPORT,v 1.1 2006/03/21 07:50:50 ru Exp
Set to build some programs without IPX support.
.It Va WITHOUT_KERBEROS
.\" from FreeBSD: src/tools/build/options/WITHOUT_KERBEROS,v 1.1 2006/03/21 07:50:50 ru Exp
Set this if you do not want to build Kerberos 5 (KTH Heimdal).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS_SUPPORT
.El
.It Va WITHOUT_KERBEROS_SUPPORT
.\" from FreeBSD: src/tools/build/options/WITHOUT_KERBEROS_SUPPORT,v 1.1 2006/03/21 07:50:50 ru Exp
Set to build some programs without Kerberos support, like
.Xr cvs 1 ,
.Xr ssh 1 ,
.Xr telnet 1 ,
.Xr sshd 8 ,
and
.Xr telnetd 8 .
.It Va WITHOUT_LIB32
.\" from FreeBSD: src/tools/build/options/WITHOUT_LIB32,v 1.1 2006/03/21 07:50:50 ru Exp
On amd64, set to not build 32-bit library set and a
.Nm ld-elf32.so.1
runtime linker.
.It Va WITHOUT_LIBC_R
.\" from FreeBSD: src/tools/build/options/WITHOUT_LIBC_R,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Nm libc_r
(reentrant version of
.Nm libc ) .
.It Va WITHOUT_LIBPTHREAD
.\" from FreeBSD: src/tools/build/options/WITHOUT_LIBPTHREAD,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build the
.Nm libpthread
(M:N threading)
library.
.It Va WITHOUT_LIBTHR
.\" from FreeBSD: src/tools/build/options/WITHOUT_LIBTHR,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build the
.Nm libthr
(1:1 threading)
library.
.It Va WITHOUT_LOCALES
.\" from FreeBSD: src/tools/build/options/WITHOUT_LOCALES,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build localization files; see
.Xr locale 1 .
.It Va WITHOUT_LPR
.\" from FreeBSD: src/tools/build/options/WITHOUT_LPR,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr lpr 1
and related programs.
.It Va WITHOUT_MAILWRAPPER
.\" from FreeBSD: src/tools/build/options/WITHOUT_MAILWRAPPER,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build the
.Xr mailwrapper 8
MTA selector.
.It Va WITHOUT_MAN
.\" from FreeBSD: src/tools/build/options/WITHOUT_MAN,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build manual pages.
.It Va WITHOUT_NCP
.\" from FreeBSD: src/tools/build/options/WITHOUT_NCP,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build programs, libraries, and kernel modules
related to NetWare Core protocol.
.It Va WITHOUT_NETCAT
.\" from FreeBSD: src/tools/build/options/WITHOUT_NETCAT,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr nc 1
utility.
.It Va WITHOUT_NIS
.\" from FreeBSD: src/tools/build/options/WITHOUT_NIS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr NIS 8
support and related programs.
If set, you might need to adopt your
.Xr nsswitch.conf 5
and remove
.Sq nis
entries.
.It Va WITHOUT_NLS
.\" from FreeBSD: src/tools/build/options/WITHOUT_NLS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build NLS catalogs.
.It Va WITHOUT_NLS_CATALOGS
.\" from FreeBSD: src/tools/build/options/WITHOUT_NLS_CATALOGS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build NLS catalog support for
.Xr csh 1 .
.It Va WITHOUT_OBJC
.\" from FreeBSD: src/tools/build/options/WITHOUT_OBJC,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build Objective C support.
.It Va WITHOUT_OPENSSH
.\" from FreeBSD: src/tools/build/options/WITHOUT_OPENSSH,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build OpenSSH.
.It Va WITHOUT_OPENSSL
.\" from FreeBSD: src/tools/build/options/WITHOUT_OPENSSL,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build OpenSSL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.El
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_PAM_SUPPORT
.El
.It Va WITHOUT_PAM_SUPPORT
.\" from FreeBSD: src/tools/build/options/WITHOUT_PAM_SUPPORT,v 1.1 2006/03/21 07:50:50 ru Exp
Set to build some programs without PAM support, particularly
.Xr ftpd 8
and
.Xr ppp 8 .
.It Va WITHOUT_PCVT
.\" from FreeBSD: src/tools/build/options/WITHOUT_PCVT,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr pcvt 4
system console utilities.
.It Va WITHOUT_PF
.\" from FreeBSD: src/tools/build/options/WITHOUT_PF,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build PF firewall package.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_AUTHPF
.El
.It Va WITHOUT_PROFILE
.\" from FreeBSD: src/tools/build/options/WITHOUT_PROFILE,v 1.1 2006/03/21 07:50:50 ru Exp
Set to avoid compiling profiled libraries.
.It Va WITHOUT_RCMDS
.\" from FreeBSD: src/tools/build/options/WITHOUT_RCMDS,v 1.1 2006/03/21 07:50:50 ru Exp
Disable building of the
.Bx
r-commands.
This includes
.Xr rlogin 1 ,
.Xr rsh 1 ,
etc.
.It Va WITHOUT_RCS
.\" from FreeBSD: src/tools/build/options/WITHOUT_RCS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr rcs 1
and related utilities.
.It Va WITHOUT_RESCUE
.\" from FreeBSD: src/tools/build/options/WITHOUT_RESCUE,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr rescue 8 .
.It Va WITHOUT_SENDMAIL
.\" from FreeBSD: src/tools/build/options/WITHOUT_SENDMAIL,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr sendmail 8
and related programs.
.It Va WITHOUT_SETUID_LOGIN
.\" from FreeBSD: src/tools/build/options/WITHOUT_SETUID_LOGIN,v 1.1 2006/03/21 07:50:50 ru Exp
Set this to disable the installation of
.Xr login 1
as a set-user-ID root program.
.It Va WITHOUT_SHAREDOCS
.\" from FreeBSD: src/tools/build/options/WITHOUT_SHAREDOCS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build the
.Bx 4.4
legacy docs.
.It Va WITHOUT_SYSCONS
.\" from FreeBSD: src/tools/build/options/WITHOUT_SYSCONS,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
.Xr syscons 4
support files such as keyboard maps, fonts, and screen output maps.
.It Va WITHOUT_TCSH
.\" from FreeBSD: src/tools/build/options/WITHOUT_TCSH,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build and install
.Pa /bin/csh
(which is
.Xr tcsh 1 ) .
.It Va WITHOUT_TOOLCHAIN
.\" from FreeBSD: src/tools/build/options/WITHOUT_TOOLCHAIN,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build
programs used for program development,
compilers, debuggers etc.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GDB
.El
.It Va WITHOUT_USB
.\" from FreeBSD: src/tools/build/options/WITHOUT_USB,v 1.1 2006/03/21 07:50:50 ru Exp
Set to not build USB-related programs and libraries.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
.\" from FreeBSD: src/tools/build/options/WITHOUT_WPA_SUPPLICANT_EAPOL,v 1.1 2006/03/21 07:50:50 ru Exp
Build
.Xr wpa_supplicant 8
without support for the IEEE 802.1X protocol and without
support for EAP-PEAP, EAP-TLS, EAP-LEAP, and EAP-TTLS
protocols (usable only via 802.1X).
.El
.Sh FILES
.Bl -tag -compact
.It Pa /etc/src.conf
.It Pa /usr/share/mk/bsd.own.mk
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7
.Sh HISTORY
The
.Nm
file appeared in
.Fx 7.0 .
.Sh AUTHORS
This manual page was autogenerated.
