freebsd/freebsd-src/share/man/man5/sysconfig.5
.\" Copyright (c) 1995
.\"	Jordan K. Hubbard
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $Id: sysconfig.5,v 1.1 1995/12/19 13:35:31 jkh Exp $
.\"
.Dd December 18, 1995
.Dt SYSCONFIG 5
.Os FreeBSD 2.0.5
.Sh NAME
.Nm sysconfig
.Nd local configuration information.
.Sh DESCRIPTION
The file
.Nm sysconfig
contains descriptive information about the local host name, configuration
details for any potential network interfaces and which services should be
started up at system initial boot time.  In new installations, the
.Nm sysconfig
file is generally initialized by the system installation utility:
\fB/stand/sysinstall\fR.
.sp
It is the duty of the system administrator to properly maintain this file
as changes occur on the local host.
.Sh FILES
.Bl -tag -width /etc/sysconfig -compact
.It Pa /etc/sysconfig
.El
.Sh DESCRIPTION
The purpose of
.Nm
is not to run commands or perform system startup actions
directly.  Instead, it is included by the
various generic startup scripts in \fB/etc\fR which conditionalize their
internal actions according to the settings found there.

The following list provides a name and short description for each
variable you can set in the
.Nm
file:
.Bl -tag -width Ar
.It Ar keymap
(str) If set to
.Ar NO
then no keymap is installed, otherwise the value is used to to install
the keymap file in /usr/share/syscons/keymaps/\fIvalue\fR.kbd
.It Ar keyrate
(str) The keyboard repeat speed.  Set to
.Ar slow ,
.Ar normal ,
.Ar fast
or
.Ar NO
if the default behavior is desired.
.It Ar keychange
(str) If not set to
.Ar NO ,
attempt to program the function keys with the value.  The value should
be a single string of the form:
.Ar \&"<funkey_number> <new_value> [<funkey_number> <new_value>]...\&"
.It Ar cursor
(str) Can be set to the value of
.Ar normal ,
.Ar blink ,
.Ar destructive
or
.Ar NO
to set the cursor behavior explicitly or chose the default behavior.
.It Ar scrnmap
(str) If set to
.Ar NO
then no screen map is installed, otherwise the value is used to install
the screen map file in /usr/share/syscons/scrnmaps/\fIvalue\fR
.It Ar font8x16
(str) If set to
.Ar NO
then the default 8x16 font value is used for screen size requests, otherwise
the value in /usr/share/syscons/fonts/\fIvalue\fR is used.
.It Ar font8x14
(str) If set to
.Ar NO
then the default 8x14 font value is used for screen size requests, otherwise
the value in /usr/share/syscons/fonts/\fIvalue\fR is used.
.It Ar font8x8
(str) If set to
.Ar NO
then the default 8x8 font value is used for screen size requests, otherwise
the value in /usr/share/syscons/fonts/\fIvalue\fR is used.
.It Ar blanktime
(int) If set to
.Ar NO
then the default screen blanking interval is used, otherwise it is set
to \fIvalue\fR seconds.
.It Ar hostname
(str) The Fully Qualified Domain Name of your host on the network.
This should almost certainly be set to something meaningful, even if
you've no network connected.
.It Ar defaultdomainname
(str) The NIS domainname of your host, or
.Ar NO
if you're not running NIS.
.It Ar tcp_extensions
(bool) Set to
.Ar YES
by default, this enables certain TCP options as described by
Internet RFCs 1323 and 1644.  If you have problems with connections
randomly hanging or other weird behavior of such nature, you might
try setting this to
.Ar NO
and seeing if that helps.  Some hardware/software out there is known
to be broken with respect to these options.
.It Ar network_interfaces
(str) Set to the list of network interfaces to configure on this host.
For example, if you had a loopback device (standard) and an SMC Elite
Ultra NIC, you might have this set to
.Ar \&"lo0 ed0\&"
for the two interfaces.  An ifconfig_\fIinterface\fR
variable is also assumed to exist for each value of \fIinterface\fR.
.It Ar static_routes
(str) Set to the list of static routes you would like to add at system
boot time.  If not set to
.Ar NO
then for each whitespace separated element in the value,
a route_\fIelement\fR variable is assumed to exist for each instance
of \fIelement\fR, and will later be passed to a ``route add'' operation.
.It Ar defaultrouter
(str) If not set to
.Ar NO
then create a default route to this host name or IP address (use IP
address value if you also require this router to get to a name
server!)
.It Ar routedflags
(str) Set to the arguments you wish to invoke the \fBrouted(8)\fR command
with or
.Ar NO
if you do not wish to run routed.  This command is generally only
useful in networks where the active exchange of RIP information is encouraged.
.It Ar timedflags
(str) Set to the arguments you wish to invoke the \fBtimed(8)\fR
command with or
.Ar NO
if you do not wish to run timed.  This command is intended for networks
of machines where a consistent \&"network time\&" for all of them must be
established.  This is often useful in large NFS environments where
time stamps on files are expected to be consistent network-wide.
.It Ar xntpdflags
(str) Set to the arguments you wish to invoke the \fBxntpd(8)\fR command
with or
.Ar NO
if you do not wish to run xntpd.  This command is intended for applications
where more precise time synchronization is required.
.It Ar ntpdate
(str) Set to the arguments you wish to invoke the \fBntpdate(8)\fR command
with or
.Ar NO
if you do not wish to initialize the time with ntpdate.  This command is
intended to synchronize the system clock only \fBonce\fR from some standard
server.  An option to set this up initially (from a list of known servers)
is also provided by the \fB/stand/sysinstall\fR program when the system
is first installed.
.It Ar rwhod
(bool) Set to
.Ar YES
if you want to run the \fBrwhod(8)\fR command.
.It Ar sendmail_flags
(str) Set to the arguments you wish to invoke the \fBsendmail(8)\fR command
with or
.Ar NO
if you do not wish to run sendmail.  This command should be run by any
host wishing to send and receive electronic mail and is enabled by
default.
.It Ar amdflags
(str) Set to the arguments you wish to invoke the \fBamd(8)\fR command with or
.Ar NO
if you do not wish to run amd.  This command implements an
`auto-mount' scheme using NFS and can help prevent the ``spaghetti
mount'' problem often encountered in large computational clusters.
Read the man page or see the \fBinfo(1)\fR section for AMD.
.It Ar nfs_client
(bool) Set to 
.Ar YES
if this host will be an NFS client.
.It Ar nfs_server
(bool) Set to 
.Ar YES
if this host will be an NFS server.  Note:  This also requires an
\fBexports(5)\fR file.
.It Ar nis_ypsetflags
(str) Set to the arguments you wish to invoke the \fBypset(8)\fR command
with or
.Ar NO
if you do not wish to run NIS as a client.
.It Ar nis_serverflags
(str) Set to the arguments you wish to invoke the \fBypserv(8)\fR command
with or
.Ar NO
if you do not wish to run an NIS server.
.It Ar namedflags
(str) Set to the arguments you wish to invoke the \fBnamed(8)\fR
command with or
.Ar NO
if you do not wish to run a name server (if you don't even know what
this means, then you definitely don't).
.It Ar pcnfsd
(str) Set to the arguments you wish to invoke the \fBpcnfsd(8)\fR
command with or
.Ar NO
if you do not wish to support ONC clients on DOS, OS/2, Macintosh,
etc) machines.  Note that enabling this currently also requires that
you install the optional pcnfsd package.  See the networking section
of any reasonably recent package archive or the net subdirectory of
the ports collection.
.It Ar apache_httpd
(bool) If set to
.Ar YES
then the \fBApache web server\fR will be started at system initial
boot time.  Note that enabling this currently also requires that you
install the optional apache WWW server package.  See the net or www sections
of any reasonably recent package archive or the www subdirectory of
the ports collection.
.It Ar xtend
(bool) If set to
.Ar YES
then the X-10 power controller daemon (\fBxtend(8)\fR) will be started
at system initial boot time.
.It Ar dumpdev
(str) If not set to
.Ar NO
then point kernel crash-dumps at the swap device
specified as \fIvalue\fR.
.It Ar savecore
(bool) Set to
.Ar YES
if you want kernel crash-dumps to go to
.Ar dumpdev
for later post-mortem diagnosis with the \fBgdb(1)\fR command's \fB-k\fR flag.
.It Ar kerberos_server
(bool) Set to
.Ar YES
if you want to run a Kerberos authentication server.
.It Ar gateway
(bool) Set to
.Ar YES
if this host is expected to gateway packets between interfaces (e.g. serve as
some sort of packet router).
.It Ar gated
(bool) Set to
.Ar YES
if you want to run the \fBgated(8)\fR route management system at system
initial boot time.  Note that enabling this currently also requires that
you install the optional gated package.  See the networking section
of any reasonably recent package archive or the net subdirectory of
the ports collection.
.It Ar check_quotas
(bool) Set to
.Ar YES
if you want to enable user disk quota checking via the \fBquotacheck(8)\fR
command.
.It Ar accounting
(bool) Set to
.Ar YES
if you wish to enable system accounting through the \fBaccton(8)\fR facility.
.It Ar ibcs2
(bool) Set to
.Ar YES
if you wish to enable iBCS2 (SCO) binary emulation at system initial boot
time.
.Sh SEE ALSO
.Xr accton 8 ,
.Xr amd 8 ,
.Xr exports 5 ,
.Xr gated 8 ,
.Xr gdb 1 ,
.Xr info 1 ,
.Xr named 8 ,
.Xr ntpdate 8 ,
.Xr pcnfsd 8 ,
.Xr quotacheck 8 ,
.Xr rc 8 ,
.Xr route 8 ,
.Xr routed 8 ,
.Xr rwhod 8 ,
.Xr sendmail 8 ,
.Xr timed 8 ,
.Xr xntpd 8 ,
.Xr xtend 8 ,
.Xr ypserv 8 ,
.Xr ypset 8
.Sh HISTORY
The
.Nm
file appeared in FreeBSD 2.0.5
.Sh AUTHOR
Jordan K. Hubbard.

