freebsd/freebsd-src/usr.sbin/getextattr/getextattr.8
.\"-
.\" Copyright (c) 2000 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"       $FreeBSD$
.\"
.Dd March 30, 2000
.Dt GETEXTATTR 8
.Os
.Sh NAME
.Nm getextattr
.Nd retrieve a named extended attribute
.Sh SYNOPSIS
.Nm getextattr
.Op Fl s
.Ar attrname
.Ar filename Op ...
.Sh DESCRIPTION
.Nm
is a user tool to retrieve a named extended attribute on a file or
directory.
The
.Ar attrname
argument should be the name of the attribute, and
.Ar filename
a list of files and directories from which to retrieve attribute data.
If the
.Op Fl s
flag is specified,
.Nm
will attempt to display the attribute data as a string, although the
results may not look pretty if the data is binary data.
The
.Xr strvisx 3
function is used to generate the string, so control sequences should
be safely escaped.
Otherwise, the attribute data will be represented as a series of two-digit
hex numbers.
In order for
.Nm
to succeed, the attribute service must be available on the file system,
and the attribute must of defined for the file queried.
.Sh EXAMPLES
.Bd -literal -offset indent
# getextattr md5 /kernel
/kernel:
  61 61 33 62 39 39 66 65    31 35 35 32 31 62 65 32 
  62 36 38 36 62 31 66 39    63 64 33 39 35 36 36 31 
# getextattr -s md5 /kernel
/kernel: "aa3b99fe15521be2b686b1f9cd395661"
.Ed
.Pp
Retrieve the
.Dq md5
extended attribute for the file
.Pa /kernel .
.Sh SEE ALSO
.Xr extattrctl 8 ,
.Xr setextattr 8 ,
.Xr extattr 9
.Sh HISTORY
Extended attribute support was developed as part of the TrustedBSD Project,
and introduced in
.Fx 5.0 .
It was developed to support security extensions requiring additional labels
to be associated with each file or directory.
.Sh AUTHORS
Robert N M Watson
.Sh BUGS
Only the first 2048 bytes of the extended attribute value are displayed
due to a hard-coded buffer limit.
