freebsd/freebsd-src/usr.sbin/lsdev/lsdev.8
.\" $Id: lsdev.8,v 1.1.1.1 1994/10/17 23:26:10 wollman Exp $
.\" Garrett A. Wollman, October 1994
.\" This file is in the public domain.
.\"
.Dd October 17, 1994
.Dt LSDEV 1
.Os
.Sh NAME
.Nm lsdev
.Nd list configured devices
.Sh SYNOPSIS
.Nm lsdev
.Op Fl t Ar type
.Op Fl cv
.Op Ar class Ns Op unit
.Sh DESCRIPTION
The
.Nm lsdev
utility lists devices configured in the current system, in a
machine-dependent manner.  The
.Fl t
flag can be used to restrict the listing to a specific 
.Ar type
of device;
the types available vary from machine to machine.  (Specifying an
invalid type will cause a list of valid types to be printed.)  The
.Fl v
flag requests more verbose output.  The
.Fl c
flag requests output in a format similar to the input of
.Xr config 8 .
The optional
.Ar class
argument requests information on a particular class of devices (e.g.,
.Dq Li wdc
or
.No Do Li ie Dc Ns ).
If no
.Ar unit
is specified, all units of the specified class will be listed.
.Pp
The
.Xr sysctl 3
mechanism is used to retrieve information from the kernel about which
devices are configured.
.Sh FILES
.Bl -tag -width <machine/devconf.h>
.It Aq sys/devconf.h
defines the structure examined by
.Nm
.It Aq machine/devconf.h
defines the machine-dependent parts of the structure, including the
supported device type names
.El
.Sh SEE ALSO
.\" .Xr chdev 8
.Xr sysctl 3
.Sh BUGS
Not all devices have the proper support implmented yet.
.Sh HISTORY
An
.Nm
comand appeared in
.Tn FreeBSD
2.0.
