freebsd/freebsd-src/usr.bin/monitor/monitor.1
.\" Copyright (c) 2008 The DragonFly Project.  All rights reserved.
.\"
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 16, 2008
.Dt MONITOR 1
.Os
.Sh NAME
.Nm monitor
.Nd File and directory monitoring utility
.Sh SYNOPSIS
.Nm
.Op Fl qvx
.Ar
.Sh DESCRIPTION
The
.Nm
utility monitors one or more files or directories and outputs the
appropriate file name to stdout whenever a change occurs.
Supported options are as follows:
.Bl -tag -width indent
.It Fl q
Be more quiet.
Specifying this option will cause only the file paths to be output.
.It Fl v
Be more verbose.
.It Fl x
Exit after first hit.
.Nm
will exit after reporting the first event.
.El
.\".Sh EXAMPLES
.\".Sh SEE ALSO
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 2.1 .
.Sh AUTHORS
.An Matthew Dillon Aq Mt dillon@backplane.com
