freebsd/freebsd-src/usr.bin/uucp/uuq/uuq.1
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)uuq.1	8.1 (Berkeley) 6/6/93
.\"
.Dd June 6, 1993
.Dt UUQ 1
.Os BSD 4.3
.Sh NAME
.Nm uuq
.Nd examine or manipulate the uucp queue
.Sh SYNOPSIS
.Nm uuq
.Op Fl l
.Op Fl h
.Op Fl s Ns Ar system
.Op Fl u Ns Ar user
.Op Fl d Ns Ar jobno
.Op Fl r Ns Ar sdir
.Op Fl b Ns Ar baud
.Sh DESCRIPTION
.Nm Uuq
is used to examine (and possibly delete) entries in the uucp queue.
.Pp
When listing jobs,
.Nm uuq
uses a format reminiscent of
.Xr ls .
For the long format,
information for each job listed includes
job number, number of files to transfer, user who
spooled the job, number of bytes to send, type of command requested
(S for sending files, R for receiving files, X for remote uucp),
and file or command desired.
.Pp
Several options are available:
.Bl -tag -width Ar
.It Fl h
Print only the summary lines for each system.  Summary lines give system
name, number of jobs for the system, and total number of bytes to send.
.It Fl l
Specifies a long format listing.  The default is to list only the
job numbers sorted across the page.
.It Fl s Ns Ar system
Limit output to jobs for systems whose system names begin with
.Ar system .
.It Fl u Ns Ar user
Limit output to jobs for users whose login names begin with
.Ar user .
.It Fl d Ns Ar jobno
Delete job number
.Ar jobno
(as obtained from a previous
.Nm uuq
command)
from the uucp queue.
Only the
.Tn UUCP
Administrator is permitted to delete jobs.
.It Fl r Ns Ar sdir
Look for files in the spooling directory
.Ar sdir
instead of the default
directory.
.It Fl b Ns Ar baud
Use
.Ar baud
to compute the transfer time instead of the default
1200 baud.
.El
.Sh FILES
.Bl -tag -width /usr/spool/uucp/Dhostname./D.x -compact
.It Pa /usr/spool/uucp/
Default spool directory
.It Pa /usr/spool/uucp/C./C.*
Control files
.It Pa /usr/spool/uucp/D Ns Em hostname ./D.*
Outgoing data files
.It Pa /usr/spool/uucp/X./X.*
Outgoing execution files
.El
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr uulog 1 ,
.Xr uusnap 8
.Sh BUGS
No information is available on work requested by the remote machine.
.Pp
The user who requests a remote uucp command is unknown.
.Pp
.Dq Li uq \-l
can be horrendously slow.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
