freebsd/freebsd-src/usr.sbin/fdcontrol/fdcontrol.8
.\" 
.\" Copyright (C) 1994 by Joerg Wunsch, Dresden
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
.\" OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
.\" LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\" USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\" 
.Dd May 22, 1994
.Os
.Dt FDCONTROL 8
.Sh NAME
.Nm fdcontrol
.Nd modify floppy disk parameters
.Sh SYNOPSIS
.Nm fdcontrol
.Ar device
.Sh DESCRIPTION
.Nm Fdcontrol
allows the specification of device parameters for the floppy disk at
.Ar device .
.Ar Device
should be a character device.

Since the implications of such a specification are considered harmful,
the underlying
.Xr ioctl 2
command is restricted to the super-user.

The command asks the user for each individual tunable parameter,
defaulting to the currently used value.

.Sh DIAGNOSTICS
Error codes for the underlying
.Xr ioctl 2
commands are printed by the
.Xr perror 3
facility.

.Sh BUGS
The
.Nm
command is currently under development. It's user interface is rather
silly and likely to change in future, options should be provided to
allow anything being modified from the command line.

.Sh SEE ALSO
.Xr fd 4 ,
.Xr ioctl 2 ,
.Xr perror 3 .
.Sh HISTORY
.Nm Fdcontrol
is currently under development. It's user interface and overall
functionality are subjects to future improvements and changes.
.Sh AUTHOR
The program has been contributed by
.if n Joerg Wunsch,
.if t J\(:org Wunsch,
Dresden.
