freebsd/freebsd-src/usr.sbin/pim6dd/pim6dd.8
.\" Copyright (C) 1998 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: pim6dd.8,v 1.5 2000/05/18 16:11:46 itojun Exp $
.\"	$FreeBSD: src/usr.sbin/pim6dd/pim6dd.8,v 1.3.2.3 2000/07/15 07:36:30 kris Exp $
.\"
.Dd Nov 17, 1998
.Dt PIM6DD 8
.Os
.Sh NAME
.Nm pim6dd
.Nd PIM for IPv6 dense mode daemon
.Sh SYNOPSIS
.Nm
.Op Fl c Ar configfile
.Op Fl d Op debug_level Op ,debug_level
.Sh DESCRIPTION
.Nm Pim6dd
is an IPv6 multicast routing daemon, which supports
PIMv2(Protocol Independent Multicast Version 2) dense mode
for IPv6.
.Pp
Options supported by
.Nm Ns :
.Bl -tag -width Ds
.It Fl c Ar configfile
Specify alternate location,
.Ar configfile ,
for configuration file.
By default,
.Pa /etc/pim6dd.conf
is used.
.It Fl d
Specify debug levels. If this option is specified without any arguments,
all debug messages will be printed out.
A subset of the messages to be printed out can be specified
as arguments of the option.
Valid debug levels are
.Ic timeout, packets, interfaces, kernel, mfc, pim_detail, pim_hello,
.Ic kernel, mfc, pim_detail, pim_hello, pim_jp, pim_graft, pim_asserts,
.Ic pim_routes, pim_timers, rpf, pim, routes, routers, timers,
and
.Ic asserts.
.El
.Pp
.Nm Pim6dd 
automatically configures itself to forward on all multicast-capable
interfaces, i.e., interfaces that have the IFF_MULTICAST flag set (excluding
the "loopback interface").
To override the default configuration,
configuration commands may be placed in
.Pa /etc/pim6dd.conf
.Po
or an alternative file, specified by the 
.Sq Fl c
option
.Pc .
.\"
.Sh FILES
.Bl -tag -width /etc/pim6dd.conf -compact
.It Pa /etc/pim6dd.conf
The default configuration file.
.El
.Sh SEE ALSO
.Xr daemon 3 ,
.Xr pim6dd.conf 5
.Sh HISTORY
The
.Nm
command is based on
.Nm pimdd ,
which is an IPv4 multicast routing daemon
developed at the University of Oregon.
.Nm Pimdd
has been derived from PIM sparse-mode
.Nm pimd
developed at University of Southern California.
Part of these two programs above has also been derived from
.Nm mrouted .
.Nm Mrouted
is COPYRIGHT 1989 by The Board of Trustees of
Leland Stanford Junior University.
.\"
.Sh BUGS
.Nm Pim6dd
does not contain any unicast routing engine, so a unicast routing
daemon needs to run on the system. 
.Pp
The kernel unicast routing table is periodically polled by
.Nm
in order to follow changes of existing unicast routes.
.\"
