freebsd/freebsd-src/usr.sbin/cdcontrol/cdcontrol.1
.Dd July 3, 1995
.Dt CDCONTROL 1
.Os FreeBSD
.Sh NAME
.Nm cdcontrol
.Nd compact disc control utility
.Sh SYNOPSIS
.Nm cdcontrol
.Op Fl s
.Op Fl v
.Op Fl f Ar discname
.Op Ar command args...
.Sh DESCRIPTION
.Nm cdcontrol
is a program to control audio features of a CD drive. The device is a name such
as cd0 or mcd0. 
.Pp
If the device not specified, the environment variable 
.Ev DISC
will be used to find the cd device.
.Pp
If no command is given, then
.Nm cdcontrol
enters an interactive mode, reading commands from the standard input.
.Pp
The following options are available:
.Bl -tag -width flag
.It Fl s
Silent mode - do not print table headers and human readable comments.
.It Fl v
Verbose mode - print as much information as possible.
.It Fl f Ar discname
Specifies a device name, such as /dev/cd0c or mcd0.
Both absolute path and relative to /dev filename are possible.
Suffix `c' is added to the device name if needed.
.El
.Pp
The available commands are listed below.  Only as many
characters as are required to uniquely identify a command
need be specified.
.Bl -tag -width Cm

.It Cm play Op Ar first_track Op Ar last_track
Play from track 
.Nm first_track
to track
.Nm last_track. 
The first track has number 1.

.It Cm play Ar start_m:start_s.start_f Op Ar end_m:end_s.end_f
Play from the absolute address
(MSF) defined by 
.Nm start_m
in minutes, 
.Nm start_s,
in seconds and 
.Nm start_f
(frame number) to the absolute address defined by
.Nm end_m
in minutes, 
.Nm end_s,
in seconds and 
.Nm end_f
(frame number). Minutes are in the range 0-99. Seconds are in the range 0-59.
Frame numbers are in the range 0-74.

.It Cm play Ar #start_block Op length
Play starting from the logical block
.Nm start_block
using
.Nm length
logical blocks.

.It Cm pause
Stop playing. Do not stop the disc.

.It Cm resume
Resume playing. Used after the 
.Nm pause
 command.

.It Cm stop
Stop the disc.

.It Cm eject
Eject the disc.

.It Cm volume Ar left_channel Ar right_channel
Set the volume of left channel to 
.Nm left_channel
and the volume of right channel to 
.Nm right_channel. 
Allowed values are in the range 0-255. 

.It Cm volume Ar mute
Turn the sound off.

.It Cm volume Ar mono
Set the mono mode.

.It Cm volume Ar stereo
Set the stereo mode.

.It Cm volume Ar left
Play the left subtrack on both left and right channels.

.It Cm volume Ar right
Play the right subtrack on both left and right channels.

.It Cm info
Print the information about the disc:
the current playing status and position,
the current values of the volume for left and right channels,
and the table of contents.

.It Cm help
Print the list of available commands.

.It Cm debug Ar on
Enable the debugging mode of the CD device driver.

.It Cm debug Ar off
Disable the driver debugging mode.

.It Cm debug Ar reset
Perform the hardware reset of the device.

.It Cm quit
Quit the program.

.Sh FILES
.Bl -tag -width /dev/rmcd0c -compact
.It Pa /dev/rcd0c
.It Pa /dev/rmcd0c
.It Pa /dev/rwcd0c
.El
.Sh AUTHORS
Jean-Marc Zucconi,
Andrew A.\ Chernov,
Serge V.\ Vakulenko
.Sh HISTORY
The
.Nm cdcontrol
command appeared in FreeBSD 2.1
