freebsd/freebsd-src/usr.sbin/ypbind/ypbind.8
.\" Copyright (c) 1991, 1993, 1995
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: yppush.8,v 1.1 1995/02/05 21:48:04 wpaul Exp $
.\"
.Dd April 9, 1995
.Dt YPBIND 8
.Os
.Sh NAME
.Nm ypbind
.Nd "NIS domain binding daemon"
.Sh SYNOPSIS
.Nm ypbind
.Op Fl ypset
.Op Fl ypsetme
.Op Fl s
.Sh DESCRIPTION
.Nm ypbind
is the process that maintains NIS binding information. At startup,
it searches for an NIS server responsible for serving the system's
default domain (as set by the
.Xr domainname 1
command) using network broadcasts. Initially,
.Nm ypbind
will broadcast every five seconds. Once it receives a reply,
it will store the address of the server and other
information in a special file located in
.Pa /var/yp/binding .
The NIS routines in the standard C library can then use this file
when processing NIS requests. There may be several such files
since it is possible for an NIS client to be bound to more than
one domain.
.Pp
After a binding has been established,
.Nm ypbind
will send DOMAIN_NONACK requests to the NIS server at one minute
intervals. If it fails to receive a reply to one of these requests
within twenty seconds,
.Nm ypbind
assumes that the server is no longer running and resumes its five second
broadcasts until another binding is established.
.Nm ypbind
will also log warning messages using the syslog(3) facility each time
it detects that a server has stopped responding, as well as when it
has bound to a new server.
.Pp
.Sh OPTIONS
The following options are supported by
.Nm ypbind :
.Bl -tag -width flag
.It Fl ypset
It is possible to force
.Nm ypbind
to bind to a particular NIS server host for a given domain by using the
.Xr ypset 8
command. However,
.Nm ypbind
refuses YPBINDPROC_SETDOM requests by default since it has no way of
knowing exactly who is sending them. Using the
.Fl ypset
flag causes
.Nm ypbind
to accept YPBINDPROC_SETDOM requests from any host. This option should only
be used for diagnostic purposes and only for limited periods since allowing
arbitrary users to reset the binsing of an NIS client poses a severe
security risk.
.It Fl ypsetme
This is similar to the
.Fl ypset
flag, except that it only permits YPBINDPROC_SETDOM requests to be processed
if they originated from the local host.
.It Fl s
The
.Fl s
flag causes
.Nm ypbind
to run in secure mode: it will refuse to bind to any NIS server
that is not running as root (i.e. that is not using privileged
TCP ports).
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /var/yp/binding/[domainname].[version]
The files used to hold binding information for each NIS domain.
.El
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr domainname 1 ,
.Xr ypserv 8 ,
.Xr ypset 8 ,
.Xr yp 8
.Sh AUTHOR
Theo de Raadt <deraadt@fsa.ca>
