freebsd/freebsd-src/share/misc/mdoc/example.1
.\" Copyright (c) [year]
.\"	[you name here].  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by [you name]
.\"	and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY [you name] AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd "January 2, 1997"
.Dt EXAMPLE 1
.\" Note: Only specify the operating system when the command
.\" is FreeBSD specific, otherwise use the .Os macro with no
.\" arguments.
.Os FreeBSD 3.0
.Sh NAME
.Nm example
.Nd example command manual page
.Sh SYNOPSIS
.Nm example
.Op Fl abc
.Op Fl d Ar argument
.Ar file
.Sh DESCRIPTION
This is an example manual page for
the 
.Nm
command.  It is intended
that this example can be used as a template when writing
a new manual page.
.Pp
The options are as follows:
has several options:
.Bl -tag -width Fl
.It Fl a
Example optional
.Fl a
option.
.It Fl b
Example optional
.Fl b
option.
.It Fl c 
Example optional
.Fl c
option.
.It Fl d Ar argument
Example optional
.Fl d
option with required argument
.Ar argument .
.It Ar file
Required argument
.Ar file .
.El
.Sh ENVIRONMENT
The 
.Nm
command ignores the
.Ev EXAMPLE
environment variable.
.Sh FILES
.Bl -tag -width /dev/null -compact
.It Pa /dev/null
Example of a file in the
.Sx FILES
section.
.El
.Sh SEE ALSO
.Xr example 3 ,
.Xr example 4 ,
.Xr mdoc 7 ,
.Xr mdoc.samples 7
.Sh STANDARDS
If the command conforms to some standard, such as
.St -p1003.2
or
.St -ansiC ,
it should be noted here.
.Sh DIAGNOSTICS
None.
.Sh HISTORY
The
.Nm
manual page example first appeared in
.Fx 3.0 .
.Sh AUTHOR
This
manual page was written by Mike Pritchard
.Aq mpp@FreeBSD.ORG .
.Sh BUGS
The actual code for this command is vaporware.
