freebsd/freebsd-src/usr.sbin/procctl/procctl.8
.\" $FreeBSD$
.Dd Nov 23, 1997
.Dt PROCCTL 8
.Os FreeBSD
.Sh NAME
.Nm procctl
.Nd clear procfs event flags
.Sh SYNOPSIS
.Nm procctl
.Ar command
.Op Ar ...
.Sh DESCRIPTION
.Nm Procctl
clears the
.Xr procfs 5
event mask used by
.Xr truss 1 .
This can be used in the event that a process is left stranded, since
the
.Xr procfs 5
events result in a non-killable process.
The options are a list of process ID's;
.Nm
goes through the list and clears the event masks for each specified process.
.Sh SEE ALSO
.Xr truss 1 ,
.Xr procfs 5
.Sh HISTORY
The
.Nm
command was written by
.An Sean Eric Fagan
for
.Bx Free .
