freebsd/freebsd-src/usr.sbin/procctl/procctl.8
.\" $Id$
.Dd Nov 23, 1997
.Dt PROCCTL 1
.Os FreeBSD
.Sh NAME
.Nm \&procctl
.Nd clear procfs event flags
.Sh Synopsis
.Nm \&procctl
.Ar command
.Ar [...]
.Sh DESCRIPTION
.Nm \&procctl
clears the
.Xr procfs 5
event mask used by
.Xr truss 1 .
This can be used in the event that a process is left stranded, since
the
.Xr procfs 5
events result in a non-killable process.
The options are a list of process ID's;
.Nm \&procctl
goes through the list and clears the event masks for each specified process.
.Xr truss 1 ,
.Xr procfs 5
.Sh HISTORY
The
.Nm procctl
command was written by Sean Eric Fagan for FreeBSD.
