freebsd/freebsd-src/sbin/geom/class/nop/gnop.8
.\" Copyright (c) 2004 Pawel Jakub Dawidek <pjd@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 21, 2004
.Dt GNOP 8
.Os
.Sh NAME
.Nm gnop
.Nd "control utility for NOP GEOM class"
.Sh SYNOPSIS
.Nm
.Cm create
.Op Fl v
.Op Fl f Ar failprob
.Ar dev1
.Op Ar dev2 Op Ar ...
.Nm
.Cm configure
.Op Fl v
.Op Fl f Ar failprob
.Ar prov1
.Op Ar prov2 Op Ar ...
.Nm
.Cm destroy
.Op Fl fv
.Ar prov1
.Op Ar prov2 Op Ar ...
.Nm
.Cm list
.Op Ar prov Op Ar ...
.Nm
.Cm load
.Op Fl v
.Nm
.Cm unload
.Op Fl v
.Sh DESCRIPTION
The
.Nm
utility is used for setting up transparent providers on existing ones.
Its main purpose is testing other GEOM classes, as it allows force providers
removal and I/O errors simulation with a given probability.
It is also a good starting point for implementing new GEOM classes.
.Pp
The first argument to
.Nm
indicates an action to be performed:
.Bl -tag -width ".Cm configure"
.It Cm create
Setup a transparent provider on the given devices.
If operation succeded, new provider should appear with name
.Pa /dev/<dev>.nop .
The kernel module
.Pa geom_nop.ko
will be loaded if it is not loaded already.
.It Cm configure
Configure existing transparent provider. At the moment it is only used
for changing failure probability.
The kernel module
.Pa geom_nop.ko
will be loaded if it is not loaded already.
.It Cm destroy
Turn off the given transparent providers.
.It Cm list
List all or the given currently configured providers.
.It Cm load
Load
.Pa geom_nop.ko
kernel module.
.It Cm unload
Unload
.Pa geom_nop.ko
kernel module.
.El
.Pp
Additional options:
.Bl -tag -width ".Fl f Ar failprob"
.It Fl f
Force the removal of the specified striped device.
.It Fl f Ar failprob
Specifies failure probability in percentage.
.It Fl v
Be more verbose.
.El
.Sh EXAMPLES
The following example shows how to create a transparent provider for disk
.Pa /dev/da0
with 50% failure probability and destroy it.
.Bd -literal -offset indent
gnop create -v -f 50 da0
gnop destroy -v da0.nop
.Ed
.Sh DIAGNOSTICS
Exit status is 0 on success, and 1 if the command fails.
.Sh SEE ALSO
.Xr geom 4 ,
.Xr geom 8
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.3 .
.Sh AUTHORS
.An Pawel Jakub Dawidek Aq pjd@FreeBSD.org
