freebsd/freebsd-src/lib/libc/sys/aio_error.2
.\" Copyright (c) 1999 Softweyr LLC.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Softweyr LLC AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Softweyr LLC OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id$
.\"
.Dd June 2, 1999
.Dt AIO_ERROR 2
.Os
.Sh NAME
.Nm aio_error
.Nd retrieve error status of asynchronus I/O operation (REALTIME)
.Sh SYNOPSIS
.Fd #include <aio.h>
.Ft int
.Fn aio_error "struct aiocb *iocb"
.Sh DESCRIPTION
The
.Fn aio_error
function returns the error status of the asynchronous I/O request
associated with the structure pointed to by
.Ar iocb .
.Sh RETURN VALUES
If the asynchronous I/O request has completed successfully,
.Fn aio_error
returns 0.  If the request has not yet completed,
.Dv EINPROGRESS 
is returned.  If the request has completed unsuccessfully the error
status is returned as described in
.Xr read 2 ,
.Xr write 2 ,
or
.Xr fsync 2
is returned.
On failure,
.Fn aio_error
returns
.Dv -1
and sets
.Dv errno
to indicate the error condition.
.Sh ERRORS
The
.Fn aio_error
function will fail if:
.Bl -tag -width Er
.It Bq Er EINVAL
.Ar iocb
does not reference an outstanding asynchronous I/O request.
.El
.Sh SEE ALSO
.Xr aio_return 2 ,
.Xr aio_read 2 ,
.Xr aio_write 2 ,
.Xr aio_cancel 2 ,
.Xr aio_suspend 2 ,
.Xr read 2 ,
.Xr write 2 ,
.Xr fsync 2 .
.Sh STANDARDS
.Fn aio_error
is expected to conform to the
.St -p1003.2
standard.
.Sh HISTORY
The
.Nm
function first appeared in
.Fx 3.0 .
.Sh AUTHOR
This
manual page was written by
.An Wes Peters Aq wes@softweyr.com .
.Sh BUGS
Taste icky.
