freebsd/freebsd-src/lib/libc/sys/aio_write.2
.\" Copyright (c) 1999 Softweyr LLC.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Softweyr LLC AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Softweyr LLC OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id$
.\"
.Dd June 2, 1999
.Dt AIO_WRITE 2
.Os
.Sh NAME
.Nm aio_write
.Nd asynchronus write to a file (REALTIME)
.Sh SYNOPSIS
.Fd #include <aio.h>
.Ft int
.Fn aio_write "struct aiocb *iocb"
.Sh DESCRIPTION
The
.Fn aio_write
function allows the calling process to write
.Ar iocb->aio_nbytes
from the buffer pointed to by
.Ar iocb->aio_buf
to the descriptor
.Ar iocb->aio_fildes .
The call returns immediately after the write request has been enqueued
to the descriptor; the write may or may not have completed at the time
the call returns.  If the request could not be enqueued, generally due
to invalid arguments, the call returns without having enqueued the
request.
.Pp
If 
.Dv O_APPEND 
is set for 
.Ar iocb->aio_fildes ,
.Fn aio_write
operations append to the file in the same order as the calls were
made.  If
.Dv O_APPEND
is not set for the file descriptor, the write operation will occur at
the absolute position from the beginning of the file plus
.Ar iocb->aio_offset .
.Pp
If
.Dv _POSIX_PRIORITIZED_IO 
is defined, and the descriptor supports it, then the enqueued
operation is submitted at a priority equal to that of the calling
process minus
.Ar iocb->aio_reqprio .
.Pp
The
.Ar iocb
pointer may be subsequently used as an argument to
.Fn aio_return
and
.Fn aio_error
in order to determine return or error status for the enqueued operation
while it is in progress.
.Pp
If the request is successfully enqueued, the value of
.Ar iocb->aio_offset
can be modified during the request as context, so this value must not
be referenced after the request is enqueued.
.Sh RESTRICTIONS
The Asynchronous I/O Control Block structure pointed to by
.Ar iocb
and the buffer that the
.Ar iocb->aio_buf
member of that structure references must remain valid until the
operation has completed.  For this reason, use of auto (stack) variables
for these objects is discouraged.
.Pp 
The asynchronous I/O control buffer
.Ar iocb
should be zeroed before the
.Fn aio_read
call to avoid passing bogus context information to the kernel.
.Pp
Modifications of the Asynchronous I/O Control Block structure or the
buffer contents after the request has been enqueued, but before the
request has completed, are not allowed.
.Pp
If the file offset in
.Ar iocb->aio_offset
is past the offset maximum  for
.Ar iocb->aio_fildes ,
no I/O will occur.
.Sh RETURN VALUES
.Rv -std aio_write
.Sh ERRORS
The
.Fn aio_write
function will fail if:
.Bl -tag -width Er
.It Bq Er EAGAIN
The request was not queued because of system resource limitations.
.It Bq Er ENOSYS
The
.Fn aio_write
call is not supported.
.El
.Pp
The following conditions may be synchronously detected when the
.Fn aio_write
call is made, or asynchronously, at any time thereafter.  If they
are detected at call time,
.Fn aio_write
returns -1 and sets
.Ar errno
appropriately; otherwise the
.Fn aio_return
function must be called, and will return -1, and
.Fn aio_error
must be called to determine the actual calue that would have been
returned in
.Ar errno .
.Pp
.Bl -tag -width Er
.It Bq Er EBADF
.Ar iocb->aio_fildes
is invalid, or is not opened for writing.
.It Bq Er EINVAL
The offset
.Ar iocb->aio_offset
is not valid, the priority specified by
.Ar iocb->aio_reqprio
is not a valid priority, or the number of bytes specified by
.Ar iocb->aio_nbytes
is not valid.
.El
.Pp
If the request is successfully enqueued, but subsequently cancelled
or an error occurs, the value returned by the
.Fn aio_return
function is per the
.Xr write 2
call, and the value returned by the
.Fn aio_error
function is either one of the error returns from the
.Xr write 2
call, or one of:
.Bl -tag -width Er
.It Bq Er EBADF
.Ar iocb->aio_fildes
is invalid for writing.
.It Bq Er ECANCELED
The request was explicitly cancelled via a call to
.Fn aio_cancel .
.It Bq Er EINVAL
The offset
.Ar iocb->aio_offset
would be invalid.
.El
.Sh STANDARDS
.Fn aio_write
is expected to conform to the
.St -p1003.2
standard.
.Sh HISTORY
The
.Nm
Function first appeared in
.Fx 3.0 .
.Sh AUTHOR
This manual page was written by
.An Wes Peters Aq wes@softweyr.com .
.Sh BUGS
Asynchronous I/O operations cannot be cancelled in this implementation.
Invalid information in
.Ar iocb->_aiocb_private
may confuse the kernel.

