freebsd/freebsd-src/lib/libc/sys/aio_cancel.2
.\" Copyright (c) 1999 Softweyr LLC.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Softweyr LLC AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Softweyr LLC OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: aio_cancel.2,v 1.1 1999/07/01 19:58:08 wes Exp $
.\"
.Dd June 2, 1999
.Dt AIO_CANCEL 2
.Os
.Sh NAME
.Nm aio_cancel
.Nd cancel an outstanding asynchronous I/O operation (REALTIME)
.Sh SYNOPSIS
.Fd #include <aio.h>
.Ft int
.Fn aio_cancel "int something" "struct aiocb * iocb"
.Sh DESCRIPTION
The
.Fn aio_cancel
function is supposed to cancel the specified outstanding asynchronous
I/O request.
.Fn aio_cancel
is not implemented at this time, and always fails returning
.Dv ENOSYS .
.Sh RETURN VALUES
When
.Fn aio_cancel
inevitably fails, it returns
.Dv ENOSYS
to signify it is not supported.
.Sh SEE ALSO
.Xr aio_read 2 ,
.Xr aio_write 2 ,
.Xr aio_error 2 ,
.Xr aio_return 2 ,
.Xr aio_suspend 2 .
.Sh ERRORS
The
.Fn aio_cancel
function currently always fails, due to:
.Bl -tag -width Er
.It Bq Er ENOSYS
this operation is not implemented at this time.
.El
.Sh STANDARDS
.Nm
fails to conform to the
.St -p1003.2
standard.
.Sh HISTORY
The
.Nm
function first appeared in
.Fx 3.0 .
.Sh AUTHOR
This
manual page was written by
.An Wes Peters Aq wes@softweyr.com .
.Sh BUGS
Are now movie stars.
