freebsd/freebsd-src/lib/libc/sys/kldstat.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$	
.\"
.Dd March 3, 1999
.Dt KLDSTAT 2
.Os FreeBSD
.Sh NAME
.Nm kldstat
.Nd get status of kld file 
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/linker.h>
.Ft int
.Fn kldstat "int fileid" "struct kld_file_stat *stat"
.Sh DESCRIPTION
The
.Fn kldstat
function writes the info for the file referred to by
.Va fileid
into
.Va stat .
.Bd -literal
struct kld_file_stat {
	int         version;        /* set to sizeof(linker_file_stat) */
	char        name[MAXPATHLEN];
	int         refs;
	int         id;
	caddr_t     address;        /* load address */
	size_t      size;           /* size in bytes */
};
.Ed
.Pp
.Bl -tag -width XXXaddress
.It version
This field is set to the size of the structure mentioned above by the code
calling
.Fn kldstat ,
and not
.Fn kldstat
itself.
.It name
The name of the file referred to by
.Va fileid .
.It refs
The number of modules referenced by
.Va fileid .
.It id
The id of the file specified in
.Va fileid .
.It address
The load address of the kld file.
.It size
The size of the file.
.Sh RETURN VALUES
.Fn kldstat
seems to always return 0.
.Sh ERRORS
The information for the file referred to by
.Va fileid
is filled into the structure pointed to by
.Va stat
unless:
.Bl -tag -width Er
.It Bq Er ENOENT
The file was not found (probably not loaded).
.It Bq Er EINVAL
The version specified in the
.Va version
field of stat is not the proper version.  You would need to rebuild world, the
kernel, or your application, if this error occurs, given that you did properly
fill in the
.Va version
field.
.It Bq Er EFAULT
There was a problem copying one, some, or all of the fields into
.Va stat
in the
.Fn copyout
function.
.Sh SEE ALSO
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldnext 2 ,
.Xr kldunload 2 ,
.Xr kld 4 ,
.Xr kldstat 8
.Sh HISTORY
The
.Nm kld
interface first appeared in
.Fx 3.0 .
