freebsd/freebsd-src/lib/libc/sys/minherit.2
.\" $FreeBSD$
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)minherit.2	8.1 (Berkeley) 6/9/93
.\"
.Dd February 17, 1996
.Dt MINHERIT 2
.Os
.Sh NAME
.Nm minherit
.Nd control the inheritance of pages
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/mman.h>
.Ft int
.Fn minherit "void *addr" "size_t len" "int inherit"
.Sh DESCRIPTION
The
.Fn minherit
system call
changes the specified pages to have the inheritance characteristic
.Fa inherit .
Not all implementations will guarantee that the inheritance characteristic
can be set on a page basis;
the granularity of changes may be as large as an entire region.
.Fx
is capable of adjusting inheritance characteristics on a page basis.
Inheritance only effects children created by
.Fn fork .
It has no effect on
.Fn exec .
exec'd processes replace their address space entirely.  This function also
has no effect on the parent's address space (other then to potentially
share the address space with its children).
.Pp
Inheritance is a rather esoteric feature largely superceeded by the
MAP_SHARED feature of 
.Fn mmap .
However, it is possible to use
.Fn minherit
to share a block of memory between parent and child that has been mapped
MAP_PRIVATE.  That is, modifications made by parent or child are shared but
the original underlying file is left untouched.
.Bl -tag -width MAP_HASSEMAPHORE
.It Dv VM_INHERIT_SHARE
This option causes the address space in question to be shared between
parent and child.  It has no effect on how the original underlying backing
store was mapped.
.It Dv VM_INHERIT_NONE
This option prevents the address space in question from being inherited 
at all.  The address space will be unmapped in the child.
.It Dv VM_INHERIT_COPY
This option causes the child to inherit the address space as copy-on-write.
This option also has an unfortunate side effect of causing the parent
address space to become copy-on-write when the parent forks.  If the
original mapping was MAP_SHARED, it will no longer be shared in the parent
after the parent forks and there is no way to get the previous 
shared-backing-store mapping without unmapping and remapping the address
space in the parent.
.El
.Sh RETURN VALUES
.Rv -std minherit
.Sh ERRORS
The
.Fn minherit
function will fail if:
.Bl -tag -width Er
.It Bq Er EINVAL
The virtual address range specified by the
.Fa addr
and
.Fa len
arguments is not valid.
.It Bq Er EACCES
The flags specified by the
.Fa inherit
argument were not valid for the pages specified
by the
.Fa addr
and
.Fa len
arguments.
.El
.Sh BUGS
Once you set inheritance to MAP_PRIVATE or MAP_SHARED, there is no way to
recover the originanl copy-on-write semantics short of unmapping and remapping
the area.
.Sh SEE ALSO
.Xr fork 2 ,
.Xr madvise 2 ,
.Xr mincore 2 ,
.Xr mprotect 2 ,
.Xr msync 2 ,
.Xr munmap 2 ,
.Xr rfork 2
.Sh HISTORY
The
.Fn minherit
function first appeared in
.Ox .
