freebsd/freebsd-src/usr.sbin/sade/sade.8
.\" Copyright (c) 1997
.\"	Jordan Hubbard <jkh@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Jordan Hubbard AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Jordan Hubbard OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd August 08, 2006
.Dt SADE 8
.Os
.Sh NAME
.Nm sade
.Nd sysadmins disk editor
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
utility is used for various disk administration tasks on
.Fx
systems.
.Pp
It is generally invoked without arguments for the default
behavior, where the main menu is presented.
.Sh NOTES
The
.Nm
utility aims to provide a handy tool for disk management
tasks on an already installed system. The goal is to save
some of the useful functionality of the old sysinstall, which
will be removed from the system in favour of the new installer.
.\".Sh FILES
.Sh SEE ALSO
sysinstall(8)
.Sh HISTORY
This version of
.Nm
first appeared in
.Fx 7.0 . The code is extracted from the
sysinstall
utility.
.Sh AUTHORS
.An Jordan K. Hubbard Aq jkh@FreeBSD.org
.Sh BUGS
The utility misses a lot of nice features, such as tools for
manipulating gmirror or gvinum stuff. These will be added
later.

