freebsd/freebsd-src/usr.bin/lsvfs/lsvfs.1
.\" $FreeBSD: src/usr.bin/lsvfs/lsvfs.1,v 1.7.2.1 2000/06/30 09:51:50 ps Exp $
.\" Garrett A. Wollman, September 1994
.\" This file is in the public domain.
.\"
.Dd March 16, 1995
.Dt LSVFS 1
.Os
.Sh NAME
.Nm lsvfs
.Nd list installed virtual file systems
.Sh SYNOPSIS
.Nm lsvfs
.Op Ar vfsname Ar ...
.Sh DESCRIPTION
The
.Nm
command lists information about the currently loaded virtual filesystem
modules.  When
.Ar vfsname
arguments are given,
.Nm
lists information about the specified VFS modules.  Otherwise,
.Nm
lists all currently loaded modules.
The information is as follows:
.Pp
.Bl -tag -compact -width Filesystem
.It Filesystem
the name of the filesystem, as would be used in the
.Ar type
parameter to
.Xr mount 2
and the
.Fl t
option to
.Xr mount 8
.It Refs
the number of references to this VFS; i.e., the number of currently
mounted filesystems of this type
.It Flags
flag bits.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr mount 8
.Sh HISTORY
A
.Nm
command appeared in
.Fx 2.0 .
