freebsd/freebsd-src/lib/libpam/modules/pam_securetty/pam_securetty.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 8, 2001
.Dt PAM_SECURETTY 8
.Os
.Sh NAME
.Nm pam_securetty
.Nd SecureTTY PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_securetty
.Op Ar options
.Sh DESCRIPTION
The SecureTTY authentication service module for PAM,
.Nm
provides functionality for only one PAM category:
authentication.
In terms of the 
.Ar module-type
parameter, this is the
.Dv auth
feature.
It also provides a null function for session management.
.Ss SecureTTY Authentication Module
The SecureTTY authentication component
.Pq Fn pam_sm_authenticate ,
returns success if the user is attempting to authenticate as superuser,
and the process is attached to a secure TTY.
Alternatively,
if the user is not authenticating as superuser,
the module always returns success.
.Pp
A TTY is defined as secure if its entry is fetchable from
.Pa /etc/ttys
by
.Xr getttynam 3
(see
.Xr ttys 5 ) ,
and the entry (a struct ttyent) has the 
.Dv TTY_SECURE
flag set.
.Pp
The following options may be passed to the authentication module:
.Bl -tag -xwidth ".Cm use_first_pass"
.It Cm debug
.Xr syslog 3
debugging information at
.Dv LOG_DEBUG
level.
.El
.Sh SEE ALSO
.Xr getttyynam 3 ,
.Xr syslog 3 ,
.Xr ttys 5 ,
.Xr pam.conf 5 ,
.Xr pam 8
