Repository: freebsd/freebsd-src
Catalog: bfd/po/*.po
Languages: ro

source: %s: Unknown section type in a.out.adobe file: %x
ro: %s: Tip secþiune necunoscut în fiºier adobe a.out: %x

source: %s: Invalid relocation type exported: %d
ro: %s: Tip de relocare exportat invalid: %d

source: %s: Invalid relocation type imported: %d
ro: %s: Tip de relocare importat invalid: %d

source: %s: Bad relocation record imported: %d
ro: %s: Înregistrare de relocare greºitã importatã: %d

source: %s: can not represent section `%s' in a.out object file format
ro: %s: nu se poate reprezenta secþiunea `%s' în format de fiºier obiect a.out

source: %s: can not represent section for symbol `%s' in a.out object file format
ro: %s: nu se poate reprezenta secþiunea pentru simbolul `%s' în formatul de fiºier obiect a.out

source: *unknown*
ro: *necunoscut*

source: %s: relocatable link from %s to %s not supported
ro: %s: legãtura relocalizabilã din %s cãtre %s nesuportatã

source: Warning: writing archive was slow: rewriting timestamp
ro: Avertisment: scrierea arhivei a fost lentã: se rescrie marcajul de timp(timestamp)

source: Reading archive file mod timestamp
ro: Citirea fiºierului arhivã mod marcaj de timp

source: Writing updated armap timestamp
ro: Scriere marcaj de timp armap înnoit

source: No error
ro: Nici o eroare

source: System call error
ro: Eroare apel sistem

source: Invalid bfd target
ro: Þintã bfd invalidã

source: File in wrong format
ro: Fiºier în format eronat

source: Archive object file in wrong format
ro: Fiºier obiect arhivã în format eronat

source: Invalid operation
ro: Operaþie invalidã

source: Memory exhausted
ro: Memorie plinã

source: No symbols
ro: Nici un simbol

source: Archive has no index; run ranlib to add one
ro: Arhiva nu are nici un index.; rulaþi ranlib pentru a adãuga unul

source: No more archived files
ro: Nu mai existã fiºiere arhivate

source: Malformed archive
ro: Arhivã malformatã

source: File format not recognized
ro: Formatul de fiºier nu a fost recunoscut

source: File format is ambiguous
ro: Formatul de fiºier este ambiguu

source: Section has no contents
ro: Secþiunea nu are conþinut

source: Nonrepresentable section on output
ro: Secþiune de output nereprezentabilã

source: Symbol needs debug section which does not exist
ro: Simbolul necesitã secþiune de debug care nu existã

source: Bad value
ro: Valoare eronatã

source: File truncated
ro: Fiºier trunchiat

source: File too big
ro: Fiºier prea mare

source: #<Invalid error code>
ro: #<Cod invalid de eroare>

source: BFD %s assertion fail %s:%d
ro: Aserþiunea BFD %s a eºuat %s:%d

source: BFD %s internal error, aborting at %s line %d in %s
ro: Eroare interna BFD %s, se renunþã la %s linia %d în %s

source: BFD %s internal error, aborting at %s line %d
ro: Eroare internã BFD %s, se renunþã la %s linia %d

source: Please report this bug.
ro: Vã rugãm raportaþi acest bug.

source: not mapping: data=%lx mapped=%d
ro: nu se mapeazã: data=%lx mapat =%d

source: not mapping: env var not set
ro: nu se mapeazã: variabila env nu este setatã

source: Warning: Writing section `%s' to huge (ie negative) file offset 0x%lx.
ro: Avertisment: Scrierea secþiunii `%s' spre offset de fiºier imens (sau negativ) 0x%lx

source: Missing IHCONST
ro: IHCONST lipsã

source: Missing IHIHALF
ro: IHHALF lipsã

source: Unrecognized reloc
ro: Reloc necunoscut

source: missing IHCONST reloc
ro: IHCONST reloc lipsã

source: missing IHIHALF reloc
ro: IHIHALF reloc lipsã

source: GP relative relocation used when GP not defined
ro: Relocare relativã GP folositã când GP nu este definit

source: using multiple gp values
ro: folosire de valori multiple gp

source: %s: unable to find THUMB glue '%s' for `%s'
ro: %s: nu s-a putut gãsi legãtura(glue) THUMB `%s' pentru `%s'

source: %s: unable to find ARM glue '%s' for `%s'
ro: %s: nu s-a putut gãsi legãtura(glue) ARM `%s' pentru `%s'

source: %s(%s): warning: interworking not enabled.
ro: %s(%s): avertisment: interlucrul(interworking) nu este activat

source: first occurrence: %s: arm call to thumb
ro: prima gãsire: %s: apelare braþ(arm) cãtre deget(thumb)

source: first occurrence: %s: thumb call to arm
ro: prima gãsire: %s: apelare deget(thumb) cãtre braþ(arm)

source: consider relinking with --support-old-code enabled
ro: luaþi în considerare relinkuirea cu --support-old-code activat

source: %s: bad reloc address 0x%lx in section `%s'
ro: %s: adresã eronatã de relocare 0x%lx în secþiunea `%s'

source: %s: illegal symbol index in reloc: %d
ro: %s: index ilegal de simbol în reloc: %d

source: ERROR: %s is compiled for APCS-%d, whereas %s is compiled for APCS-%d
ro: EROARE: %s este compilat pentru APCS-%d, pe când %s e compilat pentru APCS-%d

source: ERROR: %s passes floats in float registers, whereas %s passes them in integer registers
ro: EROARE: %s trimite float în regiºtrii de float, pe când %s îi trimite în regiºtrii de integer

source: ERROR: %s passes floats in integer registers, whereas %s passes them in float registers
ro: EROARE: %s trimite integer în regiºtrii de integer, pe când %s îi trimite în regiºtrii de float

source: ERROR: %s is compiled as position independent code, whereas target %s is absolute position
ro: EROARE: %s este compilat ca ºi cod independent de poziþie,pe când þinta %seste poziþie absolutã

source: ERROR: %s is compiled as absolute position code, whereas target %s is position independent
ro: EROARE: %s este compilat ca ºi cod poziþie absolutã,pe când þinta %seste independentã de poziþie

source: Warning: %s supports interworking, whereas %s does not
ro: Avertisment: %s suportã interlucru(interworking), pe când %s nu suportã

source: Warning: %s does not support interworking, whereas %s does
ro: Avertisment: %s nu suportã interlucru(interworking), pe când %s suportã

source: private flags = %x:
ro: marcaje(flags) private = %x:

source: [floats passed in float registers]
ro: [floats trecuþi în regiºtri de float]

source: [floats passed in integer registers]
ro: [floats trecuþi în regiºtrii de integer]

source: [position independent]
ro: [ independent de poziþie]

source: [absolute position]
ro: [poziþie absolutã]

source: [interworking flag not initialised]
ro: [marcajul(flag) de interlucru(interworking) nu este iniþializat]

source: [interworking supported]
ro: [interlucru(interworking) suportat]

source: [interworking not supported]
ro: [interlucru(interworking) nesuportat]

source: Warning: Not setting interworking flag of %s since it has already been specified as non-interworking
ro: Avertisment: Nu se seteazã marcajul(flagu) de interlucru(interworking) al %s atâta timp cât a fost specificat ca non-interlucru(interworking)

source: Warning: Clearing the interworking flag of %s due to outside request
ro: Avertisment: Se ºterge marcajul(flag) de interlucru(interworking) al %s datoritã unei cereri din afarã

source: cannot handle R_MEM_INDIRECT reloc when using %s output
ro: nu am putut mainpula(handle) relocarea R_MEM_INDIRECT în folosirea ieºirii(output) %s

source: uncertain calling convention for non-COFF symbol
ro: convenþie de apelare nesigurã pentru simbol non-COFF

source: unsupported reloc type
ro: tip de relocare nesuportat

source: GP relative relocation when _gp not defined
ro: Relocare relativã GP atâta timp cât _gp nu este definit

source: reloc against unsupported section
ro: relocare pe o secþiune nesuportatã

source: reloc not properly aligned
ro: relocare incorect aliniatã

source: %s: unsupported relocation type 0x%02x
ro: %s: tip de relocare nesuportat 0x%02x

source: %s: TOC reloc at 0x%x to symbol `%s' with no TOC entry
ro: %s: relocare TOC la 0x%x cãtre simbolul `%s' fãrã nici o intrare TOC

source: %s: symbol `%s' has unrecognized smclas %d
ro: %s: simbolul `%s' are un smclas necunoscut %d

source: Unrecognized reloc type 0x%x
ro: Tip de relocare necunoscut 0x%x

source: %s: warning: illegal symbol index %ld in relocs
ro: %s: avertisment: index ilegal de simbol %ld în relocãri

source: ignoring reloc %s
ro: se ignorã reloc %s

source: %s (%s): Section flag %s (0x%x) ignored
ro: %s (%s): Marcajul(flag) de secþiune %s (0x%x) ignorat

source: Unrecognized TI COFF target id '0x%x'
ro: Id þintã TI COFF necunoscut `0x%x'

source: %s: warning: illegal symbol index %ld in line numbers
ro: %s: avertisment: index ilegal de simbol %ld în numãrul de linii

source: %s: warning: duplicate line number information for `%s'
ro: %s: avertisment: informaþie duplicat a numãrului de linii pentru `%s'

source: %s: Unrecognized storage class %d for %s symbol `%s'
ro: %s: Clasã de depozitare(storage) %d necunoscutã pentru %s simbolul `%s'

source: warning: %s: local symbol `%s' has no section
ro: avertisment: %s: simbolul local `%s' nu are secþiune

source: %s: illegal relocation type %d at address 0x%lx
ro: %s: tip ilegal de relocare %d la adresa 0x%lx

source: %s: bad string table size %lu
ro: %s: mãrime tabel ºiruri invalidã %lu

source: Warning: type of symbol `%s' changed from %d to %d in %s
ro: Avertisment: tipul de simbol `%s' schimbat de la %d la %d în %s

source: %s: relocs in section `%s', but it has no contents
ro: %s: relocãri în secþiunea `%s', dar fãrã conþinut

source: %s: %s: reloc overflow: 0x%lx > 0xffff
ro: %s: %s: depãºire(overflow) de relocãri: 0x%lx > 0xffff

source: %s: warning: %s: line number overflow: 0x%lx > 0xffff
ro: %s: avertisment: %s: depãºire(overflow) numãr de linii: 0x%lx > 0xffff

source: ERROR: %s is compiled for the EP9312, whereas %s is compiled for XScale
ro: EROARE: %s este compilat pentru EP9312, pe când %s e compilat pentru XScale

source: warning: unable to update contents of %s section in %s
ro: avertisment: imposibil de adus la zi(update) conþinutul secþiunii %s în %s

source: Dwarf Error: Can't find .debug_str section.
ro: Eroare Pitic(Dwarf): Nu pot gãsi secþiunea debug_str

source: Dwarf Error: DW_FORM_strp offset (%lu) greater than or equal to .debug_str size (%lu).
ro: Eroare Pitic(Dwarf): DW_FORM_strp offset (%lu) mai mare sau egalã cu mãrimea .debug_str (%lu).

source: Dwarf Error: Can't find .debug_abbrev section.
ro: Eroare Pitic(Dwarf): Nu pot gãsi secþiunea debug_abbrev.

source: Dwarf Error: Abbrev offset (%lu) greater than or equal to .debug_abbrev size (%lu).
ro: Eroare Pitic(Dwarf): Offset abbrev(%lu) mai mare sau egal cu mãrimea .debug_abbrev (%lu).

source: Dwarf Error: Invalid or unhandled FORM value: %u.
ro: Eroare Pitic(Dwarf): Valoare FORM invalidã sau nemanipulabilã: %u.

source: Dwarf Error: mangled line number section (bad file number).
ro: Eroare Pitic(Dwarf): secþiune numãr de linii trunchiatã (numãr fiºier eronat)

source: Dwarf Error: Can't find .debug_line section.
ro: Eroare Pitic(Dwarf): Nu pot gãsi secþiunea debug_line.

source: Dwarf Error: Line offset (%lu) greater than or equal to .debug_line size (%lu).
ro: Eroare Pitic(Dwarf): Offsetul de linie (%lu) mai mare sau egal cu mãrimea .debug_line (%lu)

source: Dwarf Error: mangled line number section.
ro: Eroare Pitic(Dwarf): secþiune trunchiatã numãr de linii

source: Dwarf Error: Could not find abbrev number %u.
ro: Eroare Pitic(Dwarf): Nu am putut gãsi numãrul abbrev: %u.

source: Dwarf Error: found dwarf version '%u', this reader only handles version 2 information.
ro: Eroare Pitic(Dwarf): S-a gãsit dwarf versiunea `%u', acest cititor manipuleazã doar informaþii ale versiunii 2.

source: Dwarf Error: found address size '%u', this reader can not handle sizes greater than '%u'.
ro: Eroare Pitic(Dwarf): s-a gãsit adresa mãrimea `%u', acest cititor nu poate manipula mãrimi mai mari decât `%u'

source: Dwarf Error: Bad abbrev number: %u.
ro: Eroare Pitic(Dwarf): Numãr invalid de abbrev: %u

source: Unknown basic type %d
ro: Tip de bazã necunoscut %d

source: End+1 symbol: %ld
ro: Simbol Sfârºit+1: %ld

source: First symbol: %ld
ro: Primul simbol: %ld

source: End+1 symbol: %-7ld Type: %s
ro: Simbol Sfârºit+1: %-7ld Tip: %s

source: Local symbol: %ld
ro: Simbol local: %ld

source: struct; End+1 symbol: %ld
ro: struct; Simbol Sfârºit+1: %ld

source: union; End+1 symbol: %ld
ro: uniune; Simbol Sfârºit+1: %ld

source: enum; End+1 symbol: %ld
ro: enum; Simbol Sfârºit+1: %ld

source: Type: %s
ro: Tip: %s

source: %s: warning: unresolvable relocation against symbol `%s' from %s section
ro: %s: avertisment: relocare nerezolvabilã pe simbolul `%s; din secþiunea `%s'

source: internal error: out of range error
ro: eroare internã: eroare depãºire de domeniu(out of range)

source: internal error: unsupported relocation error
ro: eroare internã: eroare de relocare nesuportatã

source: internal error: dangerous error
ro: eroare internã: eroare periculoasã

source: internal error: unknown error
ro: eroare internã: eroare necunoscutã

source: %s: invalid string offset %u >= %lu for section `%s'
ro: %s: offset de ºir invalid %u >= %lu pentru secþiunea `%s'

source: %s: invalid SHT_GROUP entry
ro: %s: intrare SHT_GROUP invalidã

source: %s: no group info for section %s
ro: %s nu existã informaþii de grup pentru secþiunea %s

source: Program Header:
ro: Header Program:

source: Dynamic Section:
ro: Secþiune Dinamicã:

source: Version definitions:
ro: Definiþii de versiune:

source: Version References:
ro: Referinþe Versiune:

source: required from %s:
ro: cerute de %s:

source: %s: invalid link %lu for reloc section %s (index %u)
ro: %s: link invalid %lu pentru secþiunea de relocare %s (index %u)

source: %s: Not enough room for program headers (allocated %u, need %u)
ro: %s: Memorie insuficientã pentru headerele programului (alocatã %u, necesarã %u)

source: %s: Not enough room for program headers, try linking with -N
ro: %s: Memorie insuficientã pentru headerele programului, încercaþi linkuirea cu -N

source: Error: First section in segment (%s) starts at 0x%x whereas the segment starts at 0x%x
ro: Eroare: prima secþiune în segment (%s) începe la 0x%x pe când segmentul începe la 0x%x

source: %s: warning: allocated section `%s' not in segment
ro: %s: avertisment: secþiunea alocatã `%s' nu este în segment

source: %s: symbol `%s' required but not present
ro: %s: simbolul `%s' necesar, dar nu este prezent

source: %s: warning: Empty loadable segment detected, is this intentional ?
ro: %s: avertisment: S-a detectat segment încãrcabil vid, este intenþionat ?

source: Unable to find equivalent output section for symbol '%s' from section '%s'
ro: Nnu am putut gãsi secþiunea de output echivalentã pentru simbolul '%s' din secþiunea '%s'

source: %s: unsupported relocation type %s
ro: %s: tip de relocare nesuportat: %s

source: %s: Warning: Arm BLX instruction targets Arm function '%s'.
ro: %s: Avertisment: BLX Arm are ca þintã funcþia Arm `%s'.

source: %s: Warning: Thumb BLX instruction targets thumb function '%s'.
ro: %s: Avertisment: BLX Thumb are ca þintã funcþia thumb `%s'.

source: %s(%s+0x%lx): %s relocation against SEC_MERGE section
ro: %s(%s+0x%lx): %s relocare pe secþiunea SEC_MERGE

source: %s: warning: unresolvable relocation %d against symbol `%s' from %s section
ro: %s: avertisment: relocare nerezolvabilã %d pe simbolul `%s' din secþiunea %s

source: Warning: Clearing the interworking flag of %s because non-interworking code in %s has been linked with it
ro: Avertisment: Se ºterge marcajul(flag) de interlucru(interworking) al %s deoarece împreunã cu el a fost linkuit cod non-interlucru în %s

source: ERROR: %s is compiled for EABI version %d, whereas %s is compiled for version %d
ro: EROARE: %s este compilat pentru EABI versiunea %d, pe când %s este compilat pentru versiunea %d

source: ERROR: %s is compiled for APCS-%d, whereas target %s uses APCS-%d
ro: EROARE: %s este compilat pentru APCS-%d, pe când þinta %s foloseºte APCS-%d

source: ERROR: %s uses VFP instructions, whereas %s does not
ro: EROARE: %s foloseºte instrucþiuni VFP, pe când %s nu le foloseºte

source: ERROR: %s uses FPA instructions, whereas %s does not
ro: EROARE: %s foloseºte instrucþiuni FPA, pe când %s nu le foloseºte

source: ERROR: %s uses Maverick instructions, whereas %s does not
ro: EROARE: %s foloseºte instrucþiuni Maverick, pe când %s nu le foloseºte

source: ERROR: %s uses software FP, whereas %s uses hardware FP
ro: EROARE: %s foloseºte FP software, pe când %s foloseºte FP hardware

source: ERROR: %s uses hardware FP, whereas %s uses software FP
ro: EROARE: %s foloseºte FP hardware, pe când %s foloseºte FP software

source: private flags = %lx:
ro: marcaje(flags) private = %lx:

source: [interworking enabled]
ro: [interlucru(interworking) activat]

source: [VFP float format]
ro: [format float VFP]

source: [Maverick float format]
ro: [format float Maverick]

source: [FPA float format]
ro: [format float FPA]

source: [new ABI]
ro: [ABI nou]

source: [old ABI]
ro: [ABI vechi]

source: [software FP]
ro: [FP software]

source: [Version1 EABI]
ro: [EABI Versiunea1]

source: [sorted symbol table]
ro: [tabelã sortatã de simboluri]

source: [unsorted symbol table]
ro: [tabelã de simboluri nesortatã]

source: [Version2 EABI]
ro: [EABI Versiunea2]

source: [dynamic symbols use segment index]
ro: [simbolurile dinamice folosesc index de segment]

source: [mapping symbols precede others]
ro: [simbolurile de mapare le precedeazã pe celelalte]

source: <EABI version unrecognised>
ro: <versiune necunoscutã EABI>

source: [relocatable executable]
ro: [executabil relocabil]

source: [has entry point]
ro: [are punct de intrare]

source: <Unrecognised flag bits set>
ro: <setare biþi de marcaj(flag) necunoscutã>

source: internal error: dangerous relocation
ro: eroare internã: relocare periculoasã

source: %s: unresolvable relocation %s against symbol `%s' from %s section
ro: %s: relocare nerezolvabilã %s pe simbolul `%s' din secþiunea `%s'

source: %s: No PLT nor GOT for relocation %s against symbol `%s' from %s section
ro: %s:Nu existã nici PLT nici GOR pentru relocarea %s pe simbolul `%s' din secþiunea %s

source: [whose name is lost]
ro: [al cãrui nume s-a pierdut]

source: %s: relocation %s with non-zero addend %d against local symbol from %s section
ro: %s: relocarea %s cu adãugarea diferitã de zero %d pe simbolul local din secþiunea %s

source: %s: relocation %s with non-zero addend %d against symbol `%s' from %s section
ro: %s: relocarea %s cu adãugare non-zero %d pe simbolul `%s' din secþiunea %s

source: %s: relocation %s is not allowed for global symbol: `%s' from %s section
ro: %s: relocarea %s nu este permisã pentru simbolul global `%s' din secþiunea %s

source: %s: relocation %s in section %s with no GOT created
ro: %s: relocarea %s din secþiunea %s fãrã GOT creat

source: %s: Internal inconsistency; no relocation section %s
ro: %s: Inconsistenþã internã, nu existã secþiunea de relocare %s

source: %s, section %s: relocation %s should not be used in a shared object; recompile with -fPIC
ro: %s, secþiunea %s: relocarea %s n-ar trebui folositã într-un shared object; recompilaþi cu -fPIC

source: [symbols have a _ prefix]
ro: [simbolurile au un _prefix]

source: %s: uses _-prefixed symbols, but writing file with non-prefixed symbols
ro: %s: se folosesc simbolurile _-prefixate, dar se scrie fiºierul cu simboluri neprefixate

source: %s: uses non-prefixed symbols, but writing file with _-prefixed symbols
ro: %s: se folosesc simboluri neprefixate, dar se scrie fiºierul cu simboluri _-prefixate

source: %s: compiled with %s and linked with modules that use non-pic relocations
ro: %s: compilat cu %s ºi linkuit cu module care folosesc relocaþii non-pic

source: %s: compiled with %s and linked with modules compiled with %s
ro: %s: compilat cu %s ºi linkuit cu module compilate cu %s

source: %s: uses different unknown e_flags (0x%lx) fields than previous modules (0x%lx)
ro: %s: foloseºte câmpuri marcaje e_flags (0x%lx) diferite de modulele anterioare (0x%lx)

source: private flags = 0x%lx:
ro: marcaje(flags) private = 0x%lx

source: %s: Relocations in generic ELF (EM: %d)
ro: %s: Relocãri în ELF generic (EM: %d)

source: %s: cannot create stub entry %s
ro: %s: nu se poate crea intrarea trunchiatã %s

source: %s(%s+0x%lx): cannot reach %s, recompile with -ffunction-sections
ro: %s(%s+0x%lx): nu se poate gãsi %s, recompilaþi cu -ffunction-sections

source: %s: relocation %s can not be used when making a shared object; recompile with -fPIC
ro: %s: relocarea %s nu poate fi utilizatã când se face un shared object, recompilaþicu -fPIC

source: %s: relocation %s should not be used when making a shared object; recompile with -fPIC
ro: %s: relocarea %s nu ar trebui utilizatã când se face un shared object, recompilaþicu -fPIC

source: Could not find relocation section for %s
ro: Nu se poate gãsi secþiunea de relocare pentru %s

source: %s: duplicate export stub %s
ro: %s: exportare de ciot(stub) duplicatã %s

source: %s(%s+0x%lx): fixing %s
ro: %s(%s+0x%lx): se fixeazã %s

source: %s(%s+0x%lx): cannot handle %s for %s
ro: %s(%s+0x%lx): nu pot manipula %s pentru %s

source: .got section not immediately after .plt section
ro: secþiunea .got nu urmeazã imediat dupã secþiunea .plt

source: %s: invalid relocation type %d
ro: %s: tip de relocare invalid %d

source: %s: bad symbol index: %d
ro: %s:index de simboluri invalid: %d

source: %s: `%s' accessed both as normal and thread local symbol
ro: %s: `%s' accesate ºi ca simboluri locale normale ºi ca simboluri locale pe fire (thread)

source: %s: bad relocation section name `%s'
ro: %s: nume secþiune relocare invalid `%s'

source: %s(%s+0x%lx): unresolvable relocation against symbol `%s'
ro: %s(%s+0x%lx): relocare nerezolvabilã pe simbolul `%s'

source: %s(%s+0x%lx): reloc against `%s': error %d
ro: %s(%s+0x%lx): relocare pe `%s': eroare %d

source: ip2k relaxer: switch table without complete matching relocation information.
ro: ip2k relaxer: schimbare de tabel fãrã potrivirea completã a informaþiei de relocare.

source: ip2k relaxer: switch table header corrupt.
ro: ip2k relaxer: headerul tablelului de schimbare este corupt.

source: ip2k linker: missing page instruction at 0x%08lx (dest = 0x%08lx).
ro: ip2k linker: lipseºte instrucþiunea de paginã la 0x%08lx (dest = 0x%08lx).

source: ip2k linker: redundant page instruction at 0x%08lx (dest = 0x%08lx).
ro: ip2k linker: instrucþiune redundantã de paginã la 0x%08lx (dest = 0x%08lx).

source: unsupported relocation between data/insn address spaces
ro: relocare nesuportatã între datã/spaþiu adresã insn

source: %s: uses different e_flags (0x%lx) fields than previous modules (0x%lx)
ro: %s: foloseºte câmpuri de marcaje e_flags (0x%lx) diferite de modulele anterioare (0x%lx)

source: SDA relocation when _SDA_BASE_ not defined
ro: Relocare SDA când _SDA_BASE_ nu este definit

source: %s: unknown relocation type %d
ro: %s: tip necunoscut de relocare %d

source: %s: The target (%s) of an %s relocation is in the wrong section (%s)
ro: %s: Þinta (%s) unei relocãri %s este în secþiunea nepotrivitã (%s)

source: %s: Instruction set mismatch with previous modules
ro: %s: Setul de instrucþiuni nu se potriveºte cu modulele anterioare

source: private flags = %lx
ro: marcaje (flags) private = %lx

source: : m32r instructions
ro: : instrucþiuni m32r

source: : m32rx instructions
ro: : instrucþiuni m32rx

source: Reference to the far symbol `%s' using a wrong relocation may result in incorrect execution
ro: Referinþa la simbolul depãrtat `%s' folosind o relocare invalidã poate duce la execuþie incorectã

source: banked address [%lx:%04lx] (%lx) is not in the same bank as current banked address [%lx:%04lx] (%lx)
ro: adresa banked [%lx:%04lx] (%lx) nu este în acelaºi bank precum adresa banked curentã [%lx:%04lx] (%lx)

source: reference to a banked address [%lx:%04lx] in the normal address space at %04lx
ro: referinþã la adresa banked [%lx:%04lx] în spaþiul normal de adresã la %04lx

source: %s: linking files compiled for 16-bit integers (-mshort) and others for 32-bit integers
ro: %s: linkuire a fiºierelor compilate pentru întregi(integers) pe 16-biþi (-mshort) ºi a celorlalte pentru întregi(integers) pe 32-biþi
