Repository: freebsd/freebsd-src
Catalog: bfd/po/*.po
Languages: ro

source: %s: linking files compiled for 32-bit double (-fshort-double) and others for 64-bit double
ro: %s: linkuire a fiºierelor compilate pentru double pe 32-biþi (-fshort-double) ºi a celorlalte pentru double pe 64-biþi

source: %s: linking files compiled for HCS12 with others compiled for HC12
ro: %s:linkuire a fiºierelor compilate pentru HCS12 cu celelalte compilate pentru HC12

source: 64-bit double,
ro: double pe 64-biþi,

source: 32-bit double,
ro: double pe 32-biþi,

source: [memory=bank-model]
ro: [memorie=mod-bank]

source: [memory=flat]
ro: [memorie=întinsã(flat)]

source: %s: Relocation %s (%d) is not currently supported.
ro: %s: Relocarea %s (%d) nu este încã suportatã.

source: %s: Unknown relocation type %d
ro: %s: Tip necunoscut de relocare %d

source: 32bits gp relative relocation occurs for an external symbol
ro: relocarea relativã gp 32bits are loc pe un simbol extern

source: Linking mips16 objects into %s format is not supported
ro: Linkuirea obiectelor mips16 în formatul %s nu este suportatã

source: generic linker can't handle %s
ro: linkerul generic nu poate manipula(handle) %s

source: %s: compiled with -mrelocatable and linked with modules compiled normally
ro: %s: compilat cu -mrelocatable ºi linkuit cu module compilate normal

source: %s: compiled normally and linked with modules compiled with -mrelocatable
ro: %s: compilat normal ºi linkuite cu module compilate cu -mrelocatable

source: %s: relocation %s cannot be used when making a shared object
ro: %s: relocarea %s nu poate fi folositã când se creazã un shared object

source: %s(%s+0x%lx): %s reloc against local symbol
ro: relocare %s(%s+0x%lx): %s pe simbol local

source: %s: unknown relocation type %d for symbol %s
ro: %s: tip de relocare %d necunoscut pentru simbolul %s

source: %s(%s+0x%lx): non-zero addend on %s reloc against `%s'
ro: %s(%s+0x%lx): adãugare non-zero în relocarea %s pentru `%s'

source: %s: the target (%s) of a %s relocation is in the wrong output section (%s)
ro: %s: þinta (%s) unei relocãri %s este într-o secþiune invalidã de output (%s)

source: %s: relocation %s is not yet supported for symbol %s.
ro: %s: relocarea %s nu este încã suportatã pentru simbolul %s.

source: %s(%s+0x%lx): unresolvable %s relocation against symbol `%s'
ro: %s(%s+0x%lx): relocare nerezolvabilã %s pe simbolul `%s'

source: %s(%s+0x%lx): %s reloc against `%s': error %d
ro: %s(%s+0x%lx):relocarea %s pe `%s': eroare %d

source: corrupt or empty %s section in %s
ro: secþiune %s coruptã sau vidã în %s

source: unable to read in %s section from %s
ro: nu se poate citi în secþiunea %s din %s

source: corrupt %s section in %s
ro: secþiune coruptã %s în %s

source: warning: unable to set size of %s section in %s
ro: avertisment: nu se poate seta mãrimea secþiunii %s în %s

source: failed to allocate space for new APUinfo section.
ro: nu s-a putut aloca spaþiu pentru secþiunea nouã APUinfo.

source: failed to compute new APUinfo section.
ro: nu s-a putut calcula(compute) secþiunea nouã APUinfo.

source: failed to install new APUinfo section.
ro: nu s-a putut instala secþiunea APUinfo nouã.

source: %s(%s+0x%lx): invalid instruction for TLS relocation %s
ro: %s(%s+0x%lx): instrucþiune invalidã pentur relocarea TLS %s

source: %s: 0x%lx: warning: bad R_SH_USES offset
ro: %s: 0x%lx: avertisment: offset R_SH_USES invalid

source: %s: 0x%lx: warning: R_SH_USES points to unrecognized insn 0x%x
ro: %s: 0x%lx: avertisment: R_SH_USES trimite cãtre insn necunoscut 0x%x

source: %s: 0x%lx: warning: bad R_SH_USES load offset
ro: %s: 0x%lx: avertisment:offset de încãrcare R_SH_USES invalid

source: %s: 0x%lx: warning: could not find expected reloc
ro: %s: 0x%lx: avertismetn: nu s-a putut gãsi relocarea aºteptatã

source: %s: 0x%lx: warning: symbol in unexpected section
ro: %s: 0x%lx: avertisment: simbol în secþiune neaºteptatã

source: %s: 0x%lx: warning: could not find expected COUNT reloc
ro: %s: 0x%lx: avertisment: nu s-a putut gãsi relocarea COUNT aºteptatã

source: %s: 0x%lx: warning: bad count
ro: %s: 0x%lx: avertisment: numãrãtoare(count) invalidã

source: %s: 0x%lx: fatal: reloc overflow while relaxing
ro: %s: 0x%lx: fatal: relocare depãºitã(overflow) în timpul relaxãrii

source: Unexpected STO_SH5_ISA32 on local symbol is not handled
ro: STO_SH5_ISA32 neaºteptat pe simbol local ce nu poate fi manipulat

source: %s: unresolvable relocation against symbol `%s' from %s section
ro: %s: relocare nerezolvabilã pe simbolul '%s' din secþiunea `%s'

source: %s: 0x%lx: fatal: unaligned branch target for relax-support relocation
ro: %s: 0x%lx: fatal: ramurã þintã nealiniatã pentru relocare cu suport de relaxare

source: %s: TLS local exec code cannot be linked into shared objects
ro: %s: codul local executabil TLS nu poate fi linkuit în shared objects

source: %s: compiled as 32-bit object and %s is 64-bit
ro: %s: compilat ca obiect pe 32-biþi ºi %s este pe 64-biþi

source: %s: compiled as 64-bit object and %s is 32-bit
ro: %s: compilat ca obiect pe 64-biþi ºi %s este pe 32-biþi

source: %s: object size does not match that of target %s
ro: %s: mãrimea obiectului nu se potriveºte cu cea a þintei %s

source: %s: encountered datalabel symbol in input
ro: %s: s-a întâlnit un simbol etichetãdate(datalabel) în intrare(input)

source: PTB mismatch: a SHmedia address (bit 0 == 1)
ro: nepotrivire PTB: o adresã SHmedia (bit 0 == 1)

source: PTA mismatch: a SHcompact address (bit 0 == 0)
ro: nepotrivire PTA: o adresã SHcompact (bit 0 == 0)

source: %s: GAS error: unexpected PTB insn with R_SH_PT_16
ro: %s: eroare GASr: PTB insn neaºteptat cu R_SH_PT_16

source: %s: error: unaligned relocation type %d at %08x reloc %08x
ro: %s: eroare: tip de reloare nealiniat %d la %08x relocarea %08x

source: %s: could not write out added .cranges entries
ro: %s: nu am putut scrie intrãrile .cranges adãugate

source: %s: could not write out sorted .cranges entries
ro: %s: nu am putut scrie intrãrile .cranges sortate

source: %s: probably compiled without -fPIC?
ro: %s: probabil compilat fãrã -fPIC?

source: %s: compiled for a 64 bit system and target is 32 bit
ro: %s: compilat pentru un sistem 64 biþi ºi þinta fiind pe 32 biþi

source: %s: linking little endian files with big endian files
ro: %s: linkuire fiºiere little endian files cu fiºiere big endian

source: Variable `%s' cannot occupy in multiple small data regions
ro: Variabila `%s' nu poate ocupa regiuni multiple de date mici

source: Variable `%s' can only be in one of the small, zero, and tiny data regions
ro: Variabila `%s' nu poate sã fie în una din regiunile mici, zero sau micuþe

source: Variable `%s' cannot be in both small and zero data regions simultaneously
ro: Variabila `%s' nu poate fi simultan ºi în regiuni de date mici ºi de date zero

source: Variable `%s' cannot be in both small and tiny data regions simultaneously
ro: Variabila `%s' nu poate fi simultan ºi în regiuni de date mici ºi de date micuþe

source: Variable `%s' cannot be in both zero and tiny data regions simultaneously
ro: Variabila `%s' nu poate fi simultan ºi în regiuni de date zero ºi de date micuþe

source: FAILED to find previous HI16 reloc
ro: EªUARE în gãsirea relocãrii anterioare HI16

source: could not locate special linker symbol __gp
ro: nu am putut localiza simbolul special de linker __gp

source: could not locate special linker symbol __ep
ro: nu am putut localiza simbolul special de linker __ep

source: could not locate special linker symbol __ctbp
ro: nu am putut localiza simbolul special de linker __ctbp

source: %s: Architecture mismatch with previous modules
ro: %s: Arhitectura nu se potriveºte cu modulele anterioare

source: private flags = %lx:
ro: marcaje(flags) private=- %lx:

source: v850 architecture
ro: arhitecturã v850

source: v850e architecture
ro: arhitecturã v850e

source: %s: warning: GOT addend of %ld to `%s' does not match previous GOT addend of %ld
ro: %s: avertisment: adãugarea GOT a %ld în `%s' nu se potriveºte adãugãrii GOT anterioare a %ld

source: %s: warning: PLT addend of %d to `%s' from %s section ignored
ro: %s: avertisment: adãugarea PLT a %d în `%s' din secþiunea %s ignoratã

source: %s: warning: %s relocation against symbol `%s' from %s section
ro: %s: avertisment: relocare %s pentru simbolul `%s' din secþiunea %s

source: %s: warning: %s relocation to 0x%x from %s section
ro: %s: avertisment: relocare %s spre 0x%x din secþiunea %s

source: non-zero addend in @fptr reloc
ro: adãugare non-zero în relocare @fptr

source: GPDISP relocation did not find ldah and lda instructions
ro: relocarea GPDISP nu a gãsit instrucþiuni ldah ºi lda

source: %s: .got subsegment exceeds 64K (size %d)
ro: %s: .subsegmentul got depãseºte 64K (size %d)

source: %s: gp-relative relocation against dynamic symbol %s
ro: %s: relocare relativã-gp pentru simbolul %s

source: %s: pc-relative relocation against dynamic symbol %s
ro: %s: relocare relativã pc pentru simbolul dinamic %s

source: %s: change in gp: BRSGP %s
ro: %s: schimbare în gp: BRSGP %s

source: <unknown>
ro: <necunoscut>

source: %s: !samegp reloc against symbol without .prologue: %s
ro: %s: !samegp reloc apentru simbol fãrã .prologue: %s

source: %s: unhandled dynamic relocation against %s
ro: %s: relocare dinamicã nemanipulabilã pentru %s

source: %s: dtp-relative relocation against dynamic symbol %s
ro: %s: relocare relativã-dtp pentru simbolul dinamic %s

source: %s: tp-relative relocation against dynamic symbol %s
ro: %s: relocare relativã-tp pentru simbolul dinamic %s

source: stub entry for %s cannot load .plt, dp offset = %ld
ro: intrarea trunchiatã pentru %s nu poate încãrca .plt, offset dp = %ld

source: %s: Internal inconsistency error for value for linker-allocated global register: linked: 0x%lx%08lx != relaxed: 0x%lx%08lx
ro: %s: eroare internã de inconsistenþã pentru valoarea registrului global alocat de linker: linkuit: 0x%lx%08lx != relaxat: 0x%lx%08lx

source: %s: base-plus-offset relocation against register symbol: (unknown) in %s
ro: %s:relocare-offset-bazã-plus pentru simbolul registru: (necunoscut) în %s

source: %s: base-plus-offset relocation against register symbol: %s in %s
ro: %s:relocare-offset-bazã-plus pentru simbolul registru: %s în %s

source: %s: register relocation against non-register symbol: (unknown) in %s
ro: %s:relocare registru pentru simbolul non-registru: (necunoscut) în %s

source: %s: register relocation against non-register symbol: %s in %s
ro: %s:relocare registru pentru simbolul non-registru: %s în %s

source: %s: directive LOCAL valid only with a register or absolute value
ro: %s: directiva LOCAL este validã doar cu un registru sau o valoare absolutã

source: %s: LOCAL directive: Register $%ld is not a local register. First global register is $%ld.
ro: %s: directivã LOCAL: Registrulr $%ld nu este un registru local. Primul registru global $%ld.

source: %s: Error: multiple definition of `%s'; start of %s is set in a earlier linked file
ro: %s: Eroare: definiþii multiple ale `%s'; începutul lui %s este setat într-un fiºierlinkuit anterior

source: Register section has contents
ro: Secþiunea registru nu are conþinut

source: Internal inconsistency: remaining %u != max %u. Please report this bug.
ro: Inconsistenþã internã: rãmâne %u ! = max %u Vã rugãm raportaþi acest bug.

source: %s: compiled for a big endian system and target is little endian
ro: %s: compilat pentru un sistem big endiat iar þinta este little endian

source: %s: compiled for a little endian system and target is big endian
ro: %s: compilat pentru un sistem little endiat iar þinta este big endian

source: %s: unexpected reloc type %u in .opd section
ro: %s: tip de relocare neaºteptat %u în secþiune .opd

source: %s: .opd is not a regular array of opd entries
ro: %s: .opd nu este un domeniu(array) de intrãri opd

source: %s: undefined sym `%s' in .opd section
ro: %s: sym nedefinit `%s' în secþiune .opd

source: can't find branch stub `%s'
ro: nu pot gãsi ramura trunchiatã `%s'

source: linkage table error against `%s'
ro: eroare tabel de linkuire pentru `%s'

source: can't build branch stub `%s'
ro: nu se poate construi ramura trunchiatã `%s'

source: .glink and .plt too far apart
ro: .glink ºi .plt prea departe unul de altul

source: stubs don't match calculated size
ro: trunchierile(stubs) sunt în neconcordanþã cu mãrimea calculatã

source: linker stubs in %u groups branch %lu toc adjust %lu long branch %lu long toc adj %lu plt call %lu
ro: trunchieri(stubs) de linker în grupurile %u ramurã %lu ajustare toc %lu ramurã lungã %lu ajust. lungã toc %lu apelare plt %lu

source: %s(%s+0x%lx): automatic multiple TOCs not supported using your crt files; recompile with -mminimal-toc or upgrade gcc
ro: %s(%s+0x%lx): TOCuri multiple nu sunt suportateîn folosirea fiºierelor voastre crt; recompilaþi cu -mminimal-toc sau upgradaþi gcc

source: %s(%s+0x%lx): sibling call optimization to `%s' does not allow automatic multiple TOCs; recompile with -mminimal-toc or -fno-optimize-sibling-calls, or make `%s' extern
ro: %s(%s+0 x%lx): optimizare apelare sibling pentru `%s' nu permite automatTOCuri multiple; recompilaþi cu -mminimal-toc sau -fno-optimize-sibling-calls, sau faceþi(make) `%s' extern

source: %s: relocation %s is not supported for symbol %s.
ro: %s: relocarea %s nu este suportatã pentru simbolul %s.

source: %s: error: relocation %s not a multiple of %d
ro: %s: eroare: relocarea %s nu este multiplu de %d

source: %s: check_relocs: unhandled reloc type %d
ro: %s: check_relocs: tip de relocare nemanipulabil %d

source: %s: Only registers %%g[2367] can be declared using STT_REGISTER
ro: %s: Doar regiºtrii %%g[2367] pot fi declaraþi folosind STT_REGISTER

source: Register %%g%d used incompatibly: %s in %s, previously %s in %s
ro: Registrul %%g%d a folosit incompatibilitãþi: %s în %s, anterior %s în %s

source: Symbol `%s' has differing types: REGISTER in %s, previously %s in %s
ro: Simbolul `%s' are tipuri diferenþiate: REGISTER în %s, anterior %s în %s

source: Symbol `%s' has differing types: %s in %s, previously REGISTER in %s
ro: Simbolul `%s' are tipuri diferenþiate: %s în %s, anterior REGISTER în %s

source: %s: linking UltraSPARC specific with HAL specific code
ro: %s: linkuire cod specific UltraSPARC cu cod specific HAL

source: %s: %s' accessed both as normal and thread local symbol
ro: %s: `%s' accesate ºi ca simboluri locale normale ºi ca simboluri locale pe fire (thread)

source: %s: version count (%ld) does not match symbol count (%ld)
ro: %s: numãrul versiunii(%ld) nu se potriveºte cu numãrul simbolului (%ld)

source: %s(%s): relocation %d has invalid symbol index %ld
ro: %s(%s): relocarea %d are indexul de simbol invalid %ld

source: %s: warning: unexpected redefinition of indirect versioned symbol `%s'
ro: %s: avertisment: redefinire neaºteptatã a simbolului indirect cu versiune(versioned) `%s'

source: %s: undefined versioned symbol name %s
ro: %s: nume de simbol versiune %s nedefinit

source: %s: relocation size mismatch in %s section %s
ro: %s: nepotrivire a mãrimii de relocare în %s secþiunea %s

source: warning: type and size of dynamic symbol `%s' are not defined
ro: avertisment: tipul ºi mãrimea simbolului dinamic `%s' nu sunt definite

source: %s: %s: invalid version %u (max %d)
ro: %s: %s: versiune invalidã %u (max %d)

source: %s: %s: invalid needed version %d
ro: %s: %s: versiune necesarã %d invalidã

source: Warning: alignment %u of symbol `%s' in %s is smaller than %u in %s
ro: Avertisment: alinierea %u al simbolului `%s' din %s este mai micã decât %u în %s

source: Warning: size of symbol `%s' changed from %lu in %s to %lu in %s
ro: Avertisment: mãrimea simbolului `%s' a fost schimbatã din %lu din %s în %lu din %s

source: %s: undefined version: %s
ro: %s:versiune %s nedefinitã

source: %s: .preinit_array section is not allowed in DSO
ro: %s: secþiunea .preinit_array section nu este permisã în DSO

source: Not enough memory to sort relocations
ro: Nu existã memorie suficientã pentru a sorta relocãrile

source: %s: could not find output section %s
ro: %s: nu s-a putut gãsi secþiunea de output %s

source: warning: %s section has zero size
ro: avertisment: secþiunea %s are mãrime zero

source: %s: %s symbol `%s' in %s is referenced by DSO
ro: %s: %s simbolul `%s' în %s este referit de DSO

source: %s: could not find output section %s for input section %s
ro: %s: nu am putut gãsi secþiunea de output %s pentru secþiunea de input %s

source: %s: %s symbol `%s' isn't defined
ro: %s: %s simbolul `%s' nu este definit

source: %T: discarded in section `%s' from %s
ro: %T: abandonat(discarded) în secþiunea `%s' din %s

source: static procedure (no name)
ro: procedurã staticã (fãrã nume)

source: not enough GOT space for local GOT entries
ro: nu existã destul spaþiu GOT pentru intrãrile GOT locale

source: %s: %s+0x%lx: jump to stub routine which is not jal
ro: %s: %s+0x%lx: salt la rutinã ciot(stub) ce nu este jal

source: %s: Malformed reloc detected for section %s
ro: %s: Relocare malformatã detectatã pentru secþiunea %s

source: %s: CALL16 reloc at 0x%lx not against global symbol
ro: %s: relocarea CALL16 la 0x%lx nu este pe simbolul global

source: %s: illegal section name `%s'
ro: %s: nume ilegal de secþiune `%s'

source: %s: endianness incompatible with that of the selected emulation
ro: %s: endianness incompatibilã cu aceea a emulaþiei selectate

source: %s: ABI is incompatible with that of the selected emulation
ro: %s: ABI este incompatibil cu cel al emulaþiei selectate

source: %s: warning: linking PIC files with non-PIC files
ro: %s: avertisment: linkuire de fiºiere PIC cu fiºiere non-PIC

source: %s: linking 32-bit code with 64-bit code
ro: %s: linkuire cod 32-biþi cu cod 64-biþi

source: %s: linking %s module with previous %s modules
ro: %s: linkuire a modulului %s cu modulele%s anterioare

source: %s: ABI mismatch: linking %s module with previous %s modules
ro: %s: nepotrivire ABI: linkuire modul %s cu module %s anterioare

source: [abi unknown]
ro: [abi necunoscut]

source: [no abi set]
ro: [abi nesetat]

source: [unknown ISA]
ro: [ISA necunoscut]

source: [32bitmode]
ro: [mod32biþi]

source: [not 32bitmode]
ro: [non-mod32biþi]

source: Output file requires shared library `%s'
ro: Fiºierul de output necesitã biblioteca globalã(shared) `%s'

source: Output file requires shared library `%s.so.%s'
ro: Fiºierul de output necesitã biblioteca globalã(shared) `%s'.so.`%s'

source: Symbol %s not defined for fixups
ro: Simbolul %s nu este definit pentru acceptare(fixups)

source: Warning: fixup count mismatch
ro: Avertisment: nepotrivire numãrãtori acceptare(fixup)

source: %s: string too long (%d chars, max 65535)
ro: %s: ºir prea lung (%d caractere, max 65535)

source: %s: unrecognized symbol `%s' flags 0x%x
ro: %s: simbol necunoscut `%s' marcaje(flags) 0x%x

source: %s: unimplemented ATI record %u for symbol %u
ro: %s: înregistrare ATI neimplementatã %u pe simbolul %u

source: %s: unexpected ATN type %d in external part
ro: %s: tip ATN neaºteptat %d în parte externã

source: %s: unexpected type after ATN
ro: %s: tip neaºteptat dupã ATN

source: %s:%d: unexpected character `%s' in Intel Hex file
ro: %s:%d: caracter neaºteptat `%s' în fiºier Intel Hex

source: %s:%u: bad checksum in Intel Hex file (expected %u, found %u)
ro: %s:%u: checksum invalid în fiºier Intel Hex (se aºtepta %u, s-a gãsit %u)

source: %s:%u: bad extended address record length in Intel Hex file
ro: %s: %u: mãrime înregistrare a adresei extinse invalidã în fiºier Intel Hex

source: %s:%u: bad extended start address length in Intel Hex file
ro: %s: %u: mãrime adresã de start extinsã invalidã în fiºier Intel Hex

source: %s:%u: bad extended linear address record length in Intel Hex file
ro: %s: %u: mãrime înregistrare a adresei lineare extinse invalidã în fiºier Intel Hex

source: %s:%u: bad extended linear start address length in Intel Hex file
ro: %s: %u: mãrime adresã linearã de start extinsã invalidã în fiºier Intel Hex

source: %s:%u: unrecognized ihex type %u in Intel Hex file
ro: %s: %u: tip ihex necunoscut %u în fiºier Intel Hex

source: %s: internal error in ihex_read_section
ro: %s: eroare internã în ihex_read_section

source: %s: bad section length in ihex_read_section
ro: %s: mãrime secþiune invalidã în ihex_read_section

source: %s: address 0x%s out of range for Intel Hex file
ro: %s: adresa 0x%s este în afara domeniului(range) pentru fiºierul Intel Hex

source: Deprecated %s called at %s line %d in %s
ro: %s învechitã apelatã la %s linia %d în %s

source: Deprecated %s called
ro: %s învechitã apelatã

source: %s: indirect symbol `%s' to `%s' is a loop
ro: %s: simbolul indirect `%s' pentru `%s' este o buclã

source: Attempt to do relocatable link with %s input and %s output
ro: Încercare de a crea un link relocabil cu input %s ºi output %s

source: %s: access beyond end of merged section (%ld + %ld)
ro: %s: acces dincolo de sfârºitul secþiunii concatenate(merged) (%ld + %ld)

source: %s: No core to allocate section name %s
ro: %s:Nu existã nucleu(core) pentru a aloca numele de secþiune %s

source: %s: No core to allocate a symbol %d bytes long
ro: %s: Nu existã nucleu(core) pentru a aloca un simbol lung de %d octeþi

source: %s: invalid mmo file: initialization value for $255 is not `Main'
ro: %s: fiºier mmo invalid: valoare de iniþializare pentru $255 nu este 'Main'

source: %s: unsupported wide character sequence 0x%02X 0x%02X after symbol name starting with `%s'
ro: %s: secvenþã mare(wide) de caractere 0x%02X 0x%02X nesuportatã dupã numele de simbol care începe cu `%s'

source: %s: invalid mmo file: unsupported lopcode `%d'
ro: %s: fiºier mmo invalid: lopcode `%d' nesuportat

source: %s: invalid mmo file: expected YZ = 1 got YZ = %d for lop_quote
ro: %s: fiºier mmo invalid: pentru lop_quote se aºtepta YZ = 1 s-a primit YZ= %d

source: %s: invalid mmo file: expected z = 1 or z = 2, got z = %d for lop_loc
ro: %s: fiºier mmo invalid: pentru lop_loc se aºtepta z =1 sau z = 2 s-a primit z = %d

source: %s: invalid mmo file: expected z = 1 or z = 2, got z = %d for lop_fixo
ro: %s: fiºier mmo invalid: pentru lop_fixo se aºtepta z =1 sau z = 2 s-a primit z = %d

source: %s: invalid mmo file: expected y = 0, got y = %d for lop_fixrx
ro: %s: fiºier mmo invalid: pentru lop_fixrx se aºtepta y =0 s-a primit y = %d

source: %s: invalid mmo file: expected z = 16 or z = 24, got z = %d for lop_fixrx
ro: %s: fiºier mmo invalid: pentru lop_fixrx se aºtepta z =16 sau z = 24 s-a primit z = %d

source: %s: invalid mmo file: leading byte of operand word must be 0 or 1, got %d for lop_fixrx
ro: %s: fiºier mmo invalid: pentru lop_fixrx octetul de înceout al operandului word trebuie sã fie 0 sau 1, s-a primit %d

source: %s: cannot allocate file name for file number %d, %d bytes
ro: %s: nu se poate aloca nume fiºier pentru fiºierul numãrul %d, %d octeþi

source: %s: invalid mmo file: file number %d `%s', was already entered as `%s'
ro: %s: fiºier mmo invalid: fiºierul numãrul %d `%s' a fost deja introdus ca `%s'

source: %s: invalid mmo file: file name for number %d was not specified before use
ro: %s: fiºier mmo invalid: numele de fiºier pentru numãrul %d nu a fost specificat înainte de folosire

source: %s: invalid mmo file: fields y and z of lop_stab non-zero, y: %d, z: %d
ro: %s: fiºier mmo invalid: câmpurile y ºi z ale lop_stab sunt non-zero: y: %d, z: %d

source: %s: invalid mmo file: lop_end not last item in file
ro: %s: fiºier mmo invalid: lop_end nu este ultimul element în fiºier

source: %s: invalid mmo file: YZ of lop_end (%ld) not equal to the number of tetras to the preceding lop_stab (%ld)
ro: %s: fiºier mmo invalid: YZ al lop_end (%ld) nu este egal cu numerele tetras ale lop_stab precedent (%ld)

source: %s: invalid symbol table: duplicate symbol `%s'
ro: %s: tabelã de simboluri invalidã: simbol `%s' duplicat
