Repository: freebsd/freebsd-src
Catalog: bfd/po/*.po
Languages: ro

source: %s: Bad symbol definition: `Main' set to %s rather than the start address %s
ro: %s: Definire invalidã de simbol: `Main' setat la %s în loc de adresa de start %s

source: %s: warning: symbol table too large for mmo, larger than 65535 32-bit words: %d. Only `Main' will be emitted.
ro: %s: avertisment: tabela de simboluri prea mare pentru mmo, mai mare decâd 65535 cuvinte pe 32 de biþi: %d. Doar 'Main' va fi emis.

source: %s: internal error, symbol table changed size from %d to %d words
ro: %s: eroare internã, tabela de simboluri ºi-a schimbat mãrimea din %d în %d cuvinte

source: %s: internal error, internal register section %s had contents
ro: %s: eroare internã, secþiunea de regiºtri internã %s nu are conþinut

source: %s: no initialized registers; section length 0
ro: %s: nu existã regiºtri iniþializaþi; lungime secþiune 0

source: %s: too many initialized registers; section length %ld
ro: %s: prea mulþi regiºtri iniþializaþi; lungime secþiune %ld

source: %s: invalid start address for initialized registers of length %ld: 0x%lx%08lx
ro: %s: adresã de start invalidã pentru regiºtrii iniþializaþi de lungime %ld: 0x%lx%08lx

source: %s: can not represent section `%s' in oasys
ro: %s: nu se poate reprezenta secþiune `%s' în oasys

source: Unhandled OSF/1 core file section type %d
ro: Tip nemanipulabil %d de fiºier nucleu(core) OSF/1

source: %s: `ld -r' not supported with PE MIPS objects
ro: %s: `ld -r' nu este suportat cu obiecte PE MIPS

source: %s: unimplemented %s
ro: %s: %s neimplementat

source: %s: jump too far away
ro: %s: salt prea departe(far away)

source: %s: bad pair/reflo after refhi
ro: %s: pair/reflo invalid dupã refhi

source: %s: Unhandled import type; %x
ro: %s: Tip import nemanipulabil; %x

source: %s: Unrecognised import type; %x
ro: %s: Tip import necunoscut; %x

source: %s: Unrecognised import name type; %x
ro: %s: Tip nume import necunoscut; %x

source: %s: Unrecognised machine type (0x%x) in Import Library Format archive
ro: %s: Tip maºinã necunoscut (0x%x) în arhiva Import Library Format

source: %s: Recognised but unhandled machine type (0x%x) in Import Library Format archive
ro: %s: Tip de maºinã recunoscut dar nemanipulabil (0x%x) în arhiva Import Library Format

source: %s: size field is zero in Import Library Format header
ro: %s: mãrimea câmpului din headerul Import Library Format este zero

source: %s: string not null terminated in ILF object file.
ro: %s: ºirul nenul terminat în fiºier obiect ILF.

source: ppcboot header:
ro: header ppcboot:

source: Entry offset = 0x%.8lx (%ld)
ro: Offset intrare = 0x%.8lx (%ld)

source: Length = 0x%.8lx (%ld)
ro: Lungime = 0x%.8lx (%ld)

source: Flag field = 0x%.2x
ro: Câmp Marcaj(Flag) = 0x%.2x

source: Partition name = "%s"
ro: Nume Partiþie = "%s"

source: Partition[%d] start = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }
ro: Start Partiþie[%d] = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }

source: Partition[%d] end = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }
ro: Sfârºit Partiþie[%d] = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }

source: Partition[%d] sector = 0x%.8lx (%ld)
ro: Sector Partiþie[%d] sector = 0x%.8lx (%ld)

source: Partition[%d] length = 0x%.8lx (%ld)
ro: Mãrime Partiþie[%d] = 0x%.8lx (%ld)

source: som_sizeof_headers unimplemented
ro: som_sizeof_headers neimplementatã

source: %s:%d: Unexpected character `%s' in S-record file
ro: %s:%d: Caracter neaºteptat `%s'în fiºier S-record

source: %s(%s+0x%lx): Stabs entry has invalid string index.
ro: %s(%s+0x%lx): Intrarea bruscã(stab) are index ºir invalid.

source: Unsupported .stab relocation
ro: Relocare .stab nesuportatã

source: bfd_make_section (%s) failed
ro: bfd_make_section (%s) eºuatã

source: bfd_set_section_flags (%s, %x) failed
ro: bfd_set_section_flags (%s, %x) eºuatã

source: Size mismatch section %s=%lx, %s=%lx
ro: Mãrime nepotrivitã secþiune %s=%lx, %s=%lx

source: unknown gsd/egsd subtype %d
ro: subtip %d gsd/egsd necunoscut

source: Object module NOT error-free !
ro: Modul obiect CU erori !

source: Stack overflow (%d) in _bfd_vms_push
ro: Depãºire(overflow) de stivã(%d) în bfd_vms_push

source: Stack underflow in _bfd_vms_pop
ro: Subfolosire(underflow) a stivei _bfd_vms_pop

source: _bfd_vms_output_counted called with zero bytes
ro: _bfd_vms_output_counted apelat cu zero octeþi

source: _bfd_vms_output_counted called with too many bytes
ro: _bfd_vms_output_counted apelat cu prea mulþi octeþi

source: Symbol %s replaced by %s
ro: Simbolul %s înlocuit de %s

source: failed to enter %s
ro: Eºec în introducerea %s

source: No Mem !
ro: Nu mai existã Mem !

source: bad section index in %s
ro: index de secþiune invalid în %s

source: unsupported STA cmd %s
ro: cmd STA %s nesuportatã

source: reserved STA cmd %d
ro: cmd STA %d rezervatã

source: %s: no symbol "%s"
ro: %s: nu existã simbolul "%s"

source: %s: not supported
ro: %s: nesuportat

source: %s: not implemented
ro: %s: neimplementat

source: reserved STO cmd %d
ro: cmd STO %d rezervatã

source: reserved OPR cmd %d
ro: cmd OPR %d rezervatã

source: reserved CTL cmd %d
ro: cmd CTL %d rezervatã

source: stack-from-image not implemented
ro: stack-from-image neimplementatã

source: stack-entry-mask not fully implemented
ro: stack-entry-mask neimplementatã complet

source: PASSMECH not fully implemented
ro: PASSMECH neimplementatã complet

source: stack-local-symbol not fully implemented
ro: stack-local-symbol neimplementatã complet

source: stack-literal not fully implemented
ro: stack-literal neimplementatã complet

source: stack-local-symbol-entry-point-mask not fully implemented
ro: stack-local-symbol-entry-point-mask neimplementatã complet

source: %s: not fully implemented
ro: %s: neimplementatã complet

source: obj code %d not found
ro: codul abj %d nu a fost gãsit

source: SEC_RELOC with no relocs in section %s
ro: SEC_RELOC fãrã relocãri în secþiunea %s

source: Unhandled relocation %s
ro: Relocare nemanipulabilã %s

source: %s: `%s' has line numbers but no enclosing section
ro: %s: `%s' are numere de linii dar nici o secþiune de închidere

source: %s: class %d symbol `%s' has no aux entries
ro: %s: clasa %d simbolul `%s' nu are intrãri aux

source: %s: symbol `%s' has unrecognized csect type %d
ro: %s: simbolul `%s' are tip necunoscut csect %d

source: %s: bad XTY_ER symbol `%s': class %d scnum %d scnlen %d
ro: %s: simbol XTY_ER invalid `%s': clasa %d scnum %d scnlen %d

source: %s: XMC_TC0 symbol `%s' is class %d scnlen %d
ro: %s: simblul XMC_TC0 `%s' este clasa %d scnlen %d

source: %s: csect `%s' not in enclosing section
ro: %s: csect `%s' nu este în secþiunea de închidere

source: %s: misplaced XTY_LD `%s'
ro: %s:XTY_LD `%s' rãtãcit

source: %s: reloc %s:%d not in csect
ro: %s: relocarea %s:%d nu este în csect

source: %s: XCOFF shared object when not producing XCOFF output
ro: %s: XCOFF shared object neproducând output XCOFF

source: %s: dynamic object with no .loader section
ro: %s: obiect dinamic fãrã secþiune .loader

source: %s: no such symbol
ro: %s: nu existã acest simbol

source: error: undefined symbol __rtinit
ro: eroare: simbol __rtinit nedefinit

source: warning: attempt to export undefined symbol `%s'
ro: avertisment: încercare de exportare a simbolului nedefinit `%s'

source: TOC overflow: 0x%lx > 0x10000; try -mminimal-toc when compiling
ro: suprasolicitare(overflow) TOC: 0x%lx > 0x10000; încercaþi -mminimal-toc la compilare

source: %s: loader reloc in unrecognized section `%s'
ro: %s: relocare loader în secþiune necunoscutã `%s'

source: %s: `%s' in loader reloc but not loader sym
ro: %s: `%s' în relocare loader dar nu în loader sym

source: %s: loader reloc in read-only section %s
ro: %s: relocare loader în secþiunea doar-în-citire %s

source: @pltoff reloc against local symbol
ro: relocare @pltoff pe simbol local

source: %s: short data segment overflowed (0x%lx >= 0x400000)
ro: %s: segment de date scurt depãºit(overflowed) (0x%lx >= 0x400000)

source: %s: __gp does not cover short data segment
ro: %s: __gp nu acoperã segmentul de date scurte

source: %s: linking non-pic code in a shared library
ro: %s: linkuire cod non-pic într-o bibliotecã globalã(shared)

source: %s: @gprel relocation against dynamic symbol %s
ro: %s: relocare @gprel pe simbolul dinamic %s

source: %s: linking non-pic code in a position independent executable
ro: %s: linkuire cod non-pic într-un executabil independent de poziþie

source: %s: @internal branch to dynamic symbol %s
ro: %s: ramurã @internal cãtre simbolul dinamic %s

source: %s: speculation fixup to dynamic symbol %s
ro: %s: rezolvare de speculaþie cãtre simbolul dinamic %s

source: %s: @pcrel relocation against dynamic symbol %s
ro: %s: relocare @pcrell pe simbolul dinamic %s

source: unsupported reloc
ro: relocare nesuportatã

source: %s: linking trap-on-NULL-dereference with non-trapping files
ro: %s: linkuire trap-on-NULL-dereference cu fiºiere non-trapping

source: %s: linking big-endian files with little-endian files
ro: %s: linkuire fiºiere big-endiancu fiºiere little-endian

source: %s: linking 64-bit files with 32-bit files
ro: %s: linkuire fiºiere pe 64-biþi cu fiºiere pe 32-biþi

source: %s: linking constant-gp files with non-constant-gp files
ro: %s: linkuire fiºiere constant-gp cu fiºiere non-constant-gp

source: %s: linking auto-pic files with non-auto-pic files
ro: %s: linkuire fiºiere auto-pic cu fiºiere non-auto-pic

source: %s: line number overflow: 0x%lx > 0xffff
ro: %s: depãºire(overflow) numãr linii: 0x%lx > 0xffff

source: %s: reloc overflow 1: 0x%lx > 0xffff
ro: %s: depãºire(overflow) relocare 1: 0x%lx > 0xffff

source: Export Directory [.edata (or where ever we found it)]
ro: Director Exportare [.edata (sau oriunde se gãseºte)]

source: Import Directory [parts of .idata]
ro: Director Importare [ pãrþi ale .idata]

source: Resource Directory [.rsrc]
ro: Director Resursã [.rsrc]

source: Exception Directory [.pdata]
ro: Director Excepþie [.pdata]

source: Security Directory
ro: Director Securitate

source: Base Relocation Directory [.reloc]
ro: Director Relocare de Bazã [.reloc]

source: Debug Directory
ro: Director Debug

source: Description Directory
ro: Director Descriere

source: Special Directory
ro: Director Special

source: Thread Storage Directory [.tls]
ro: Director Depozitare Fire(Thread) [.tls]

source: Load Configuration Directory
ro: Director Încãrcare Configuraþie

source: Bound Import Directory
ro: Director Importare de Graniþã(Bound)

source: Import Address Table Directory
ro: Director Importare Tabelã de Adrese

source: Delay Import Directory
ro: Director Importare Întârziere

source: Reserved
ro: Rezervat

source: There is an import table, but the section containing it could not be found
ro: Existã o tabelã de importare, dar secþiunea care o conþine n-a putut fi gãsitã

source: There is an import table in %s at 0x%lx
ro: Existã o tabelã de importare în %s la 0x%lx

source: Function descriptor located at the start address: %04lx
ro: Descriptorul de funcþie localizat la adresa de start: %04lx

source: code-base %08lx toc (loadable/actual) %08lx/%08lx
ro: code-base %08lx toc (încãrcabil/actual) %08lx/%08lx

source: No reldata section! Function descriptor not decoded.
ro: Nu existã secþiune reldata! Descriptorul de funcþie nu este decodat.

source: The Import Tables (interpreted %s section contents)
ro: Tabelele de Importare (interpretat conþinutul secþiunii %s)

source: vma: Hint Time Forward DLL First Table Stamp Chain Name Thunk
ro: vma: Sugestie Timp Înaintare DLL Primul Tabel Marcaj Lanþ Nume Thunk

source: DLL Name: %s
ro: Nume DLL: %s

source: vma: Hint/Ord Member-Name Bound-To
ro: vma: Sugestie/Ord Membru-Nume Salt-La

source: There is a first thunk, but the section containing it could not be found
ro: Existã un prim thunk, dar secþiunea care îl conþine nu poate fi gãsitã

source: There is an export table, but the section containing it could not be found
ro: Existã o tabelã de export, dar secþiunea ce o conþine nu poate fi gãsitã

source: There is an export table in %s at 0x%lx
ro: Existã o tabelã de exportare în %s la 0x%lx

source: The Export Tables (interpreted %s section contents)
ro: Tabelele de Exportare (interpretare conþinut secþiune %s)

source: Export Flags %lx
ro: Marcaje(Flags) Exportare %lx

source: Time/Date stamp %lx
ro: Marcaj(stamp) Orã/Datã %lx

source: Name
ro: Nume

source: Ordinal Base %ld
ro: Bazã Ordinalã %ld

source: Number in:
ro: Numãr în:

source: Export Address Table %08lx
ro: Tabelã Exportare Adrese %08lx

source: [Name Pointer/Ordinal] Table %08lx
ro: Tabelã [Nume Pointer/Ordinal] %08lx

source: Table Addresses
ro: Adrese Tabelã

source: Export Address Table
ro: Tabelã Exportare de Adrese

source: Name Pointer Table
ro: Nume Pointer Tabelã

source: Ordinal Table
ro: Ordinal Tabelã

source: Export Address Table -- Ordinal Base %ld
ro: Tabelã Exportare de Adrese -- Bazã Ordinalã %ld

source: Forwarder RVA
ro: Trimiþãtor(Forwarder) RVA

source: Export RVA
ro: Exportare RVA

source: [Ordinal/Name Pointer] Table
ro: [Ordinal/Nume Pointer] Tabelã

source: Warning, .pdata section size (%ld) is not a multiple of %d
ro: Avertisment, mãrimea secþiunii .pdata (%ld) nu este multiplu de %d

source: The Function Table (interpreted .pdata section contents)
ro: Tabela de Funcþii (interpretare conþinut secþiune .pdata)

source: vma: Begin Address End Address Unwind Info
ro: vma: Adresã Început Adresã Sfârºit Info Unwind

source: vma: Begin End EH EH PrologEnd Exception Address Address Handler Data Address Mask
ro: vma: Început Sfârºit EH EH PrologSfârºit Excepþii Adresã Adresã Manipulant Date Adresã Mascã

source: Register save millicode
ro: Registrul salveazã millicode

source: Register restore millicode
ro: Registrul reface millicode

source: Glue code sequence
ro: Secvenþã de cod lipitã(glue)

source: PE File Base Relocations (interpreted .reloc section contents)
ro: Relocãri Bazã Fiºier PE (interpretare conþinut secþiune .reloc)

source: Virtual Address: %08lx Chunk size %ld (0x%lx) Number of fixups %ld
ro: Adresã Virtualã: %08lx Mãrime Trunchiere %ld (0x%lx) Numãr acceptãri %ld

source: reloc %4d offset %4x [%4lx] %s
ro: relocarea %4d offset %4x [%4lx] %s

source: Characteristics 0x%x
ro: Caracteristici 0x%x
