freebsd/freebsd-src/sbin/comcontrol/comcontrol.8
.Dd May 15, 1994
.Dt COMCONTROL 8
.Os FreeBSD
.Sh NAME
.Nm comcontrol
.Nd control an sio device.
.Sh SYNOPSIS
.Nm comcontrol
.Ar sio_special_device
.Op options
.Sh DESCRIPTION
.Nm Comcontrol
is used to examine and modify some of the special characterstics
of the specified sio device.
If no arguments other than the device are specified,
it prints the settings of all controllable characteristics.
This usage requires only read access on the device.
Only the superuser can change the settings.
.Pp
The following options are available:
.Bl -tag -width Fl
.It Cm dtrwait Ar number
Set the time to wait after dropping DTR
to the given number.
The units are hundredths of a second.
The default is 300 hundredths, i.e., 3 seconds.
.El
.Pp
The standard way to use
.Nm comcontrol
is to put invocations of it in the
.Ar /etc/rc.local
startup script.
.Sh SEE ALSO
.Xr sio 4
.Xr stty 1 .
.Sh FILES
.Bl -tag -width Pa
.It Pa /dev/ttyd?
dialin devices.
.It Pa /dev/cua0?
dialout devices.
.Sh AUTHOR
Christopher G. Demetriou
.Sh BUGS
.Nm comcontrol
should be named
.Nm siocontrol .
.
.Sh HISTORY
Originally part of cgd's com package patches, version 0.2.1, to 386BSD 0.1.
Once controlled bidirectional capabilities.  Little is left to control now
that these capabilities are standard.
