freebsd/freebsd-src/share/man/man4/man4.i386/ahc.4
.\"
.\" Copyright (c) 1995 
.\" 	Justin T. Gibbs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd April 15, 1995
.Dt AHC 4 i386
.Os FreeBSD
.Sh NAME
.Nm ahc
.Nd
Adaptec VL/EISA/PCI SCSI host adapter driver
.Sh SYNOPSIS
For VL/EISA cards:
.Cd "controller ahc0 at isa? bio irq ? vector ahcintr
.sp
For PCI cards:
.Cd "controller ahc0
.sp
For one or more SCSI busses:
.Cd "controller scbus0
.sp
For one or more disk devices:
.Cd "device sd0
.sp
For one or more tape devices:
.Cd "device st0
.sp
For one or more cdroms:
.Cd "device cd0
.Sh DESCRIPTION
This driver provides access to SCSI devices connected to an Adaptec 
274x, 284x, 294x, or motherboard based aic7770/aic7870 hostadapter.
Features include twin and wide bus support, 2 commands per target in
non-tagged queuing mode, and experimental tagged queuing support enabled
with:
.sp
.Cd "option AHC_TAGENABLE
.sp
Per target configuration performed in the SCSI-Select menu, accesible at boot
in non-EISA models or throught an EISA configuration utility for EISA models,
is honored by this driver with the stipulation that the BIOS is enabled for 
EISA adaptors.  This includes syncronous/asyncronous transfers, disconnection,
and maximum syncronous negotiation rate settings.
.sp
Note that I/O addresses are determined automatically by the probe routines,
but care should be taken when using a 284x (VLB controller) in an EISA 
system.  Ensure that the jumpers setting the I/O area for the 284x match the 
EISA slot into which the card is inserted to prevent conflicts with other
EISA cards.
.Sh BUGS
Some Quantum drives (at least the Empire 2100 and 1080s) will not run on an
aic7870 in syncronous mode at 10MB/s.  It is speculated that the Adaptec
runs slightly above 10MB/s causing the drive much confusion.  Setting a 
maximum syncronous negotiation rate of 8MB/s in the SCSI-Select utility
will allow normal function.
.sp
The SCSI ID of aic7870 based controllers (AHA-294x) is hard coded to 7 by
the driver.  The user configured ID can be obtained by querying the SEEPROM
or NVRAM where these settings are stored, but there is no driver support for
this as of yet.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /sys/i386/scsi/aic7xxx.c
.It Pa /sys/i386/scsi/aic7xxx.h
Bus independent driver source
.It Pa /sys/i386/eisa/aic7770.c
EISA device probe/attach routines
.It Pa /sys/pci/aic7870.c
PCI device probe/attach routines
.It Pa /sys/dev/aic7xxx/aic7xxx.seq
aic7xxx sequencer program
.It Pa /sys/i386/conf/GENERIC
sample generic kernel config file including Adaptec support
.El
.Sh SEE ALSO
.Xr aha 4
.Xr ahb 4
.Xr aic7xxx_asm 1
.Xr cd 4
.Xr scsi 4
.Xr sd 4
.Xr st 4
