freebsd/freebsd-src/share/man/man4/man4.i386/ahc.4
.\"
.\" Copyright (c) 1995 
.\" 	Justin T. Gibbs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd April 15, 1995
.Dt AHC 4 i386
.Os FreeBSD
.Sh NAME
.Nm ahc
.Nd Adaptec VL/EISA/PCI SCSI host adapter driver
.Sh SYNOPSIS
For VL/EISA cards:
.Cd controller ahc0 at isa? bio irq ? vector ahcintr
.Pp
For PCI cards:
.Cd controller ahc0
.Pp
To enable tagged queueing:
.Cd options AHC_TAGENABLE
.Pp
For one or more SCSI busses:
.Cd controller scbus0 at ahc0
.Sh DESCRIPTION
This driver provides access to the
.Tn SCSI
bus connected to an Adaptec 
274x, 284x, 294x, or motherboard-based
.Tn AIC7770
or 
.Tn AIC7870
host adapter.
Features include twin and wide bus support, two commands per target in
non-tagged-queuing mode, and experimental tagged queuing support enabled
with the
.Dq Dv AHC_TAGENABLE
configuration option.
.Pp
Per target configuration performed in the 
.Tn SCSI-Select
menu, accesible at boot
in 
.No non- Ns Tn EISA
models or through an 
.Tn EISA
configuration utility for 
.Tn EISA
models,
is honored by this driver with the stipulation that the 
.Tn BIOS
must be enabled for 
.Tn EISA
adaptors.  This includes synchronous/asynchronous transfers, disconnection,
and maximum synchronous negotiation rate settings.
.Pp
Note that I/O addresses are determined automatically by the probe routines,
but care should be taken when using a 284x
.Pq Tn VESA No local bus controller
in an
.Tn EISA 
system.  Ensure that the jumpers setting the I/O area for the 284x match the 
.Tn EISA
slot into which the card is inserted to prevent conflicts with other
.Tn EISA
cards.
.Sh BUGS
Some Quantum drives (at least the Empire 2100 and 1080s) will not run on an
.Tn AIC7870
in synchronous mode at 10MB/s.  It is speculated that the Adaptec
runs slightly above 10MB/s, causing the drive much confusion.  Setting a 
maximum synchronous negotiation rate of 8MB/s in the 
.Tn SCSI-Select
utility
will allow normal function.
.Pp
The
.Tn SCSI
ID of
.No Tn AIC7870 Ns -based
controllers
.Pq Tn AHA-294x
is hard coded to 7 by the driver.  The user configured ID can be
obtained by querying the adapter, but there is no driver support for
this as of yet.
.Sh SEE ALSO
.Xr aha 4 ,
.Xr ahb 4 ,
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4
.Sh AUTHOR
The
.Nm
driver was written by Justin Gibbs.  The
.Tn AIC7xxx
sequencer-code assembler was
written by John Aycock.
.Sh HISTORY
The
.Nm
driver appeared in
.Tn FreeBSD
2.1.

