freebsd/freebsd-src/share/man/man4/man4.i386/arl.4
.\" Copyright (c) 2004
.\"	Ivan Sharov <ivan.sharov@iname.com>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Ivan Sharov.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Ivan Sharov AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Ivan Sharov OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/man4.i386/arl.4,v 1.6.8.1 2005/09/24 01:59:38 keramida Exp $
.\"
.Dd July 16, 2005
.Dt ARL 4 i386
.Os
.Sh NAME
.Nm arl
.Nd "Aironet Arlan 655 wireless network adapter driver"
.Sh SYNOPSIS
To compile support for the
.Nm
driver into your kernel, place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device arl"
.Ed
.Pp
Alternatively, to load the
.Nm
driver at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_arl_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for Aironet Arlan 655
wireless network adapters.
The Arlan 655 series adapters operate at 354kbps, 512kbps, 1Mbps and 2Mbps.
.Pp
The Aironet Arlan 655 devices support Aironet TMA, Aironet Non-TMA
and PSP operating modes.
.Pp
By default, the
.Nm
driver configures the Aironet Arlan 655 card for TMA operation.
.Pp
To set up Radio Network parameters, use
.Xr arlcontrol 8 .
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr arlcontrol 8 ,
.Xr ifconfig 8
.Sh LIMITATIONS
When using
.Xr ifconfig 8
for setting
.Va SSID
you must use a 4-byte even hexadecimal digit value and it must start with
00 or 02.
.Pp
You can change
.Va channel
for current
.Va country
only through
.Xr ifconfig 8 .
You must use
.Xr arlcontrol 8
for changing
.Va country .
.Pp
Cannot change link-level address.
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was initially written by
.An Ivan Sharov Aq ivan.sharov@iname.com .
.Aq ran@styx.aic.net
wrote the
.Xr arlcontrol 8
utility and added
.Xr ioctl 2
support to the driver.
.An Stanislav Svirid Aq count@riss-telecom.ru
ported this driver to the new ISA architecture, merged some al driver changes,
fixed some bugs and made it a module.
.An Yuri Kurenkov Aq y.kurenkov@init.ru
wrote this manpage.
