freebsd/freebsd-src/share/man/man4/man4.i386/cp.4
.\" Copyright (c) 2003-2004 Roman Kurakin <rik@cronyx.ru>
.\" Copyright (c) 2003-2004 Cronyx Engineering
.\" All rights reserved.
.\"
.\" This software is distributed with NO WARRANTIES, not even the implied
.\" warranties for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\" Authors grant any other persons or organisations a permission to use,
.\" modify and redistribute this software in source and binary forms,
.\" as long as this message is kept with the software, all derivative
.\" works or modified versions.
.\"
.\" Cronyx Id: cp.4,v 1.1.2.5 2004/06/21 17:47:40 rik Exp $
.\" $FreeBSD$
.\"
.Dd October 22, 2021
.Dt CP 4 i386
.Os
.Sh NAME
.Nm cp
.Nd "driver for synchronous Cronyx Tau-PCI WAN adapters"
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device cp"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_cp_load="YES"
.Ed
.Pp
.Sh DESCRIPTION
The
.Nm
driver creates a
.Xr netgraph 4
node for each device found.
The node is usually paired with
.Xr ng_async 4 ,
.Xr ng_cisco 4 ,
.Xr ng_frame_relay 4
or with
.Xr ng_ppp 4
under control of net/mpd5 port.
.Pp
Refer to
.Xr sconfig 8
for information about the
.Nm
adapter configuration.
.Sh HARDWARE
The
.Nm
driver supports the following models of Tau-PCI WAN adapters:
.Pp
.Bl -tag -width 20n -compact
.It Cronyx Tau-PCI
V.35 and RS-232 interfaces
.It Cronyx Tau-PCI/R
RS-530(RS-449) and X.21 interfaces
.It Cronyx Tau-PCI-L
one V.35 and RS-232 interface, low profile
.It Cronyx Tau-PCI-L/R
one RS-530(RS-449) and X.21 interface, low profile
.It Cronyx Tau-PCI-E1
fractional E1 interfaces
.It Cronyx Tau-PCI-G703
unframed E1 interfaces
.It Cronyx Tau-PCI-2E1
fractional E1 and unframed E1 interfaces
.It Cronyx Tau-PCI-4E1
fractional E1 and unframed E1 interfaces
.It Cronyx Tau-PCI-E3
E3 interface
.It Cronyx Tau-PCI-T3
T3 interface
.It Cronyx Tau-PCI-STS1
STS-1 interface
.El
.Sh SEE ALSO
.Xr ce 4 ,
.Xr netgraph 4 ,
.Xr sconfig 8
.Sh HISTORY
The
.Nm
driver was added in
.Fx 5.3
and
.Fx 4.11 .
