freebsd/freebsd-src/share/man/man4/man4.i386/cp.4
.\" Copyright (c) 2003-2004 Roman Kurakin <rik@cronyx.ru>
.\" Copyright (c) 2003-2004 Cronyx Engineering
.\" All rights reserved.
.\"
.\" This software is distributed with NO WARRANTIES, not even the implied
.\" warranties for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\" Authors grant any other persons or organisations a permission to use,
.\" modify and redistribute this software in source and binary forms,
.\" as long as this message is kept with the software, all derivative
.\" works or modified versions.
.\"
.\" Cronyx Id: cp.4,v 1.1.2.3 2004/05/07 15:40:30 rik Exp $
.\" $FreeBSD$
.\"
.Dd May 7, 2004
.Dt CP 4 PCI
.Os
.Sh NAME
.Nm cp
.Nd driver for synchronous Cronyx Tau-PCI WAN adapters
.Sh SYNOPSIS
.Cd "device cp"
.Pp
Additional options:
.Cd "device sppp"
.Cd "options NETGRAPH"
.Cd "options NETGRAPH_CRONYX"
.Pp
.Sh DESCRIPTION
The
.Nm
driver needs either
.Xr sppp 4
or 
.Xr netgraph 4 .
Which one to use is determined by the NETGRAPH_CRONYX option.
If this option is present in your kernel configuration file, the
.Nm
driver will be compiled with
.Xr netgraph 4
support.
Otherwise, it will be compiled with
.Xr sppp 4
support.
.Pp
The
.Nm
driver supports the following models of Tau-PCI WAN adapters:
.Bl -tag -width 20n
.It Cronyx Tau-PCI
V.35 and RS-232 interfaces
.It Cronyx Tau-PCI/R
RS-530(RS-449) and X.21 interfaces
.It Cronyx Tau-PCI-E1
fractional E1 interfaces
.It Cronyx Tau-PCI-G703
unframed E1 interfaces
.It Cronyx Tau-PCI-2E1
fractional E1 and unframed E1 interfaces
.It Cronyx Tau-PCI-4E1
fractional E1 and unframed E1 interfaces
.It Cronyx Tau-PCI-E3
E3 interface
.It Cronyx Tau-PCI-T3
T3 interface
.It Cronyx Tau-PCI-STS1
STS-1 interface
.El
.Pp
Refer to
.Xr sconfig 8
for information about the
.Nm
adapter configuration.
.Sh SEE ALSO
.Xr ctau 4 , 
.Xr cx 4 , 
.Xr sppp 4 , 
.Xr ifconfig 8 , 
.Xr sconfig 8 , 
.Xr spppcontrol 8
.Sh HISTORY
The
.Nm
driver was added in
.Fx 5.3 .
The
.Nm
driver for previous versions of
.Fx
is available from
.Pa http://www.cronyx.ru/ .
