freebsd/freebsd-src/share/man/man4/man4.i386/cx.4
.\" Copyright (c) 2003 Roman Kurakin <rik@cronyx.ru>
.\" Copyright (c) 2003 Cronyx Engineering
.\" All rights reserved.
.\"
.\" This software is distributed with NO WARRANTIES, not even the implied
.\" warranties for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\" Authors grant any other persons or organisations a permission to use,
.\" modify and redistribute this software in source and binary forms,
.\" as long as this message is kept with the software, all derivative
.\" works or modified versions.
.\"
.\" Cronyx Id: cp.4,v 1.1.2.2 2003/09/11 14:56:50 rik Exp $
.\" $FreeBSD$
.\"
.Dd November 27, 2003
.Dt Cronyx-Sigma 4
.Os
.Sh NAME
.Nm cx
.Nd driver for synchronous/asynchronous Cronyx-Sigma WAN adapters
.Sh SYNOPSIS
.Cd "device cx"
.Pp
Additional options:
.Cd "device sppp"
.Cd "options NETGRAPH"
.Cd "options NETGRAPH_CRONYX"
.Pp
In
.Pa /boot/device.hints :
.Cd hint.cx.0.at="isa"
.Cd hint.cx.0.port="0x240"
.Cd hint.cx.0.irq="15"
.Cd hint.cx.0.drq="7"
.Sh DESCRIPTION
The
.Nm
driver needs either
.Xr sppp 4
or 
.Xr netgraph 4 .
Which one to use is determined by NETGRAPH_CRONYX option.
If this option is present in your kernel configuration file, the
.Nm
driver will be compiled with
.Xr netgraph 4
support, else driver will be compiled with
.Xr sppp 4
support.
.Pp
The base i/o port address specified in
.Pa /boot/device.hints
must match the port address set by jumpers on the board.
The DMA i/o channel and interrupt request numbers are configured
by software at adapter initialization.
Legal values are:
.Pp
.Bl -tag -compact -width Port:
.It Port :
0x240, 0x260, 0x280, 0x300, 0x320, 0x380
.It IRQ :
3, 5, 7, 10, 11, 12, 15
.It DMA :
5, 6, 7
.El
.Pp
The
.Nm
driver supports autodetection.
As for all non-PNP hardware using of
autodetection could lead to some potential problems with other devices during
detection of hardware.
It is alway better to specify hardware resources manualy.
.Pp
Refere to
.Xr sconfig 8
for information about the
.Nm
adapter configuration.
.Sh SEE ALSO
.Xr cx 4 , 
.Xr sppp 4 , 
.Xr ifconfig 8 , 
.Xr sconfig 8 , 
.Xr spppcontrol 8
.Sh HISTORY
The
.Nm
driver was updated in
.Fx 5.2 .
In most of previous versions of
.Fx
the
.Nm
driver is out of date.
The
.Nm
driver for previous versions of
.Fx
is available from
.Pa http://www.cronyx.ru/ .
