freebsd/freebsd-src/share/man/man4/man4.i386/fxp.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: fxp.4,v 1.2.2.1 1997/02/28 03:26:51 mpp Exp $
.\"
.Dd January 19, 1997
.Dt FXP 4 i386
.Os FreeBSD
.Sh NAME
.Nm fxp
.Nd
Intel EtherExpress Pro/100B Ethernet device driver
.Sh SYNOPSIS
.Cd "device fxp0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the EtherExpress Pro/100B PCI Fast Ethernet
adapter based on the Intel i82557 Ethernet chip.
.Pp
To change the operating characteristics of the card,
use the following flag combinations with
.Xr ifconfig 8
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It -link0
Enable auto-negotiation
.It \ link0 -link1
Disable auto-negotiation, set 10Mbps operation
.It \ link0 link1
Disable auto-negotiation, set 100Mbps operation
.It \ link0 -link2
Disable auto-negotiation, set half duplex mode
.It \ link0 link2
Disable auto-negotiation, set full duplex mode
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "fxp%d: couldn't map memory"
A fatal initialization error has occurred.
.It "fxp%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "fxp%d: Failed to malloc memory"
There are not enough mbuf's available for allocation.
.It "fxp%d: device timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 2.1 .
.Sh AUTHORS
The
.Nm
device driver was written by David Greenman.
This manual page was written by David E. O'Brien.
