freebsd/freebsd-src/share/man/man4/man4.i386/io.4
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/man4.i386/io.4,v 1.6 1999/08/28 00:20:19 peter Exp $
.\"
.Dd Jan 1, 1996
.Dt IO 4 i386
.Os
.Sh NAME
.Nm io
.Nd I/O privilege file
.Sh DESCRIPTION
The special file
.Pa /dev/io
is a controlled security hole that allows a process to gain I/O
privileges
.Pq which are normally reserved for kernel-internal code .
Any process that holds a file descriptor on
.Pa /dev/io
open will get its
.Em IOPL
bits in the flag register set, thus allowing it to perform direct
I/O operations.  This can be useful in order to write userland
programs that handle some hardware directly.
.Pp
The entire access control is handled by the file access permissions
of
.Pa /dev/io ,
so care should be taken in granting rights for this device.  Note
that even read/only access will grant the full I/O privileges.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/io
.El
.Sh SEE ALSO
.Xr mem 4
.Sh HISTORY
The
.Nm io
file appeared in
.Fx 1.0 .
