freebsd/freebsd-src/share/man/man4/man4.i386/is.4
.\"
.\" Copyright (c) 1994, Wilko Bulte
.\" All rights reserved.
.\"
.Dd September 26, 1994
.Dt IS 4 i386
.Os
.Sh NAME
.Nm is
.Nd
ethernet device driver
.Sh SYNOPSIS
.Cd "device is0 at isa? port 0x280 net irq 10 drq 7 vector isintr"
.Sh DESCRIPTION
The
.Nm is
driver provides support for Isolan AT4141-0 and Isolink 4110 ethernet 
cards. 
.Pp
.Sh DIAGNOSTICS
.Bl -diag
.It "is%d: reset"
The card had to be reset by the driver.
.It "is%d : Couldn't allocate memory for card"
The driver could not obtain dma-able memory.
.It "is%d: memory allocated not quadword aligned"
The dma-able memory obtained is not aligned on an 8 byte boundary.
.It "is%d: card failed to initialise"
The initialisation routine could not correctly setup the card.
.It "is%d: error: out of sync"
The driver is out of sync with the hardware. This should never happen.
.El
.Sh CAVEATS
There are a number of driver diagnostics that are not listed in the DIAGNOSTICS
section. You need intimate card and driver knowledge to understand them. 
.Pp
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifconfig 8 ,
.Xr netintro 4
.Sh AUTHORS
The
.Nm
device driver was written by Paul Richards. This manual page was written 
by Wilko C. Bulte.
