freebsd/freebsd-src/share/man/man4/man4.i386/longrun.4
.\" Copyright (c) 2001 Tamotsu HATTORI <athlete@kta.att.ne.jp>
.\" Copyright (c) 2001 Mitsuru IWASAKI <iwasaki@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.Dd Jun 30, 2001
.Dt LONGRUN 4 i386
.Os
.Sh NAME
.Nm longrun
.Nd Transmeta(TM) Crusoe(TM) LongRun(TM) support
.Sh SYNOPSIS
LongRun support is a collection of power saving modes for the
Transmeta Crusoe chips, similar in scope to Intel's SpeedStep.
The following
.Xr sysctl 8
MIBs control the different CPU modes:
.Bl -tag -width "hw.crusoe.percentage integer no         " -compact
.It Sy "Name                 Type    Changeable Description
.It "hw.crusoe.longrun    integer yes        LongRun mode.
.Bl -tag -width "0: minimum frequency mode" -compact
.It "0: minimum frequency mode
.It "1: power-saving mode
.It "2: performance mode
.It "3: maximum frequency mode
.El
.It "hw.crusoe.frequency  integer no         Current frequency (MHz).
.It "hw.crusoe.voltage    integer no         Current voltage (mV).
.It "hw.crusoe.percentage integer no         Processing performance (%).
.El
.Pp
.Sh EXAMPLES
Print the current status:
.Bd -literal -offset indent
% sysctl hw.crusoe
.Ed
.Pp
To set LongRun mode to performance oriented variable frequency mode
(less power savings):
.Bd -literal -offset indent
# sysctl -w hw.crusoe.longrun=2
.Ed
.Pp
.Sh AUTHORS
.An -nosplit
LongRun support and this manual page were written by
.An Tamotsu HATTORI Aq athlete@kta.att.ne.jp
and
.An Mitsuru IWASAKI Aq iwasaki@FreeBSD.org .
.Sh HISTORY
The Transmeta(TM) Crusoe(TM) LongRun(TM) support first appeared in
.Fx  5.0 .
