freebsd/freebsd-src/share/man/man4/man4.i386/lpa.4
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: lpa.4,v 1.1 1993/08/06 10:34:11 cgd Exp
.\"	$Id: lpa.4,v 1.1 1993/08/28 12:41:20 rgrimes Exp $
.\"
.Dd August 28, 1993
.Dt LPA 4 i386
.Os FreeBSD
.Sh NAME
.Nm lpa
.Nd
Interruptless parallel port driver
.Sh SYNOPSIS
.\" XXX this is awful hackery to get it to work right... -- cgd
.Cd "device lpa0 at isa? port" \&"IO_LPT1\&" tty
.Cd "device lpa1 at isa? port" \&"IO_LPT2\&" tty
.Cd "device lpa2 at isa? port" \&"IO_LPT3\&" tty
.Sh DESCRIPTION
This driver provides access to parallel ports.  It assumes that
the parallel port controller will not cause an interrupt, and
therefore must poll the controller.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/lpa0
first interruptless parallel port driver
.El
.Sh SEE ALSO
.Xr lpt 4
.Sh BUGS
This driver only exists to support broken parallel port implementations.
Systems with properly working parallel ports should use the
.Nm lpt
driver instead, as it is less resource-hungry.
.Pp
This driver could stand a rewrite.
