freebsd/freebsd-src/share/man/man4/man4.i386/ohci.4
.\" Copyright (c) 1999
.\"	Nick Hibma <hibma@skylink.it>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY NICK HIBMA AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL NICK HIBMA OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: xl.4,v 1.3 1998/12/05 09:36:15 rnordier Exp $
.\"
.Dd February 21, 1999
.Dt 0HCI 4 i386
.Os FreeBSD
.Sh NAME
.Nm ohci
.Nd
OHCI USB Host Controller Driver
.Sh SYNOPSIS
.Cd "controller ohci0"
.Sh DESCRIPTION
The
.Nm
driver provides support for OHCI-type PCI based USB controllers. This
includes
.Bl -tag -width xxxxx
.It AcerLabs M5237 (Aladdin-V)
.It OPTi 82C861 (FireLink)
.It NEC uPD 9210
.It CMD Tech 670 (USB0670)
.It CMD Tech 673 (USB0673)
.El

or any other OHCI v1.0 compliant controller.
.Sh SEE ALSO
.Xr uhci 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 3.0 .
.Sh AUTHOR
The
.Nm
driver was written by
.An Lennart Augustsson (augustss@carlstedt.se) for the
.Nx
project.
