freebsd/freebsd-src/share/man/man4/man4.i386/qcam.4
.Dd Feburary 1, 1996
.Dt SD 4
.Os FreeBSD
.Sh NAME
.Nm qcam
.Nd Connectix QuickCam(TM) parallel port camera driver
.Sh SYNOPSIS
.Cd device qcam0 at isa? at "IO_LPT1" conflicts
.Sh DESCRIPTION
The
.Nm qcam
driver provides support for a Connectix
.Tn QuickCam
camera.  It allows one to utilize all known modes, and may support
as many cameras as there are parallel ports available.
.Pp
When the
.Tn parallel\ ports
are probed during boot, the port will be scanned for the presence
of a camera.
.Sh KERNEL CONFIGURATION
The
.Nm
driver can share the same port with the lpt driver, however it is
reccommended that the lpt driver be configured for polled operation
if this sharing is to be done.
.Sh IOCTLS
The following 
.Xr ioctl 2
calls apply to 
.Tn QuickCam
devices.
They are defined in the header file
.Aq Pa qcam.h .
.Pp
.Bl -tag -width QC_GET
.It Dv QC_GET
Read, from the kernel, the current configuration and status
information about camera.
.It Dv QC_SET
Configure the camera for various operating modes.  Image size,
resolution, zoom, and luminosity controls are available.
.Sh NOTES
If the camera is not found at boot time,  the
.Nm
driver will not be available for use.
.Sh FILES
.Bl -tag -width /dev/qcamX -compact
.It Pa /dev/qcam Ns Ar u
raw mode
.Tn QuickCam
camera unit
.Ar u ,
accessed as a read-only character device
.El
.Sh DIAGNOSTICS
None.
.Sh SEE ALSO
.Xr qcamcontrol 8
.br
The QuickCam reverse engineering project, http://www.crynwr.com/qcpc/
.Sh HISTORY
The
.Nm
driver is new to
.Tn FreeBSD .
.Sh AUTHOR
The
.Nm
driver was written by Paul Traina borrowing heavily
from code written by Thomas Davis, Scott Laird, Paul Chinn, and additional
work done by Russel Nelson.
.Sh TRADEMARK
QuickCam is a registered trademark of Connectix Inc.
