freebsd/freebsd-src/share/man/man4/man4.i386/scd.4
.\"
.\" Copyright (c) 1995 Jordan K. Hubbard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd January 1, 1995
.Dt SCD 4 i386
.Os FreeBSD 2.0
.Sh NAME
.Nm scd
.Nd Sony CDU31/33 CD-ROM driver
.Sh SYNOPSIS
.sp
.Cd "device scd0 at isa? port 0x230 bio"
.sp
.Sh DESCRIPTION
The
.Nm scd
driver provides a data interface to the Sony CDU31 and CDU33A CD-ROM
drives.  The drive must be hooked to a Sony proprietary interface
card or a compatible clone.
.Sh FILES
.Bl -tag -width /dev/[r]scd0a -compact
.It Pa /dev/[r]scd0a
accesses BSD partition on the disc.
Normally, there is only
one file system on a CDROM disc.
.It Pa /dev/[r]scd0c
accesses the raw device.
.Sh SEE ALSO
.Pa /sys/i386/isa/scd.c
.Sh AUTHORS
The driver was written by Mikael Hybsch with code contributed
by Holger Veit and Brian Moore.
.Sh HISTORY
The
.Nm scd
driver first appeared in FreeBSD 950210-SNAP.
