freebsd/freebsd-src/share/man/man4/man4.i386/vga.4
.\"
.\" Copyright (c) 1999
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd February 9, 1999
.Dt VGA 4 i386
.Os FreeBSD
.Sh NAME
.Nm vga
.Nd
generic video card interface
.Sh SYNOPSIS
.Cd "options" \&"VESA\&"
.Cd "options" \&"VESA_DEBUG=N\&"
.Cd "options" \&"VGA_ALT_SEQACCESS\&"
.Cd "options" \&"VGA_NO_FONT_LOADING\&"
.Cd "options" \&"VGA_NO_MODE_CHANGE\&"
.Cd "options" \&"VGA_SLOW_IOACCESS\&"
.Cd "options" \&"VM86\&"
.Cd "device vga0 at isa? port ? conflicts"
.Sh DESCRIPTION
The
.Nm
driver is a generic video card driver which provides access to
video cards.  This driver is required for the console driver
.Xr syscons 4 .
The console driver will call the
.Nm
driver to manipulate video hardware (changing video modes, loading font, etc).
.Pp
The keyword
.Em conflicts
is required, as the video card may use I/O ports in the same range
as other drivers.
.Pp
The
.Nm
driver supports the standard video cards: MDA, CGA, EGA and VGA. In
addition, the driver can utilize VESA BIOS extensions if the video card
supports them. VESA support can either be statically included in the kernel
or can be loaded as a separate module.
.Pp
In order to statically link the support to the kernel, the
.Em VESA
option (see below) and the
.Em VM86
option must be defined in the kernel configuration file.
.Pp
The
.Nm vesa
module can be dynamically loaded into the kernel using 
.Xr kldload 8 .
This requires the
.Em VM86
option to be defined in the kernel configuration file.
.Sh DRIVER CONFIGURATION
.Ss Kernel Configuration Options
The following kernel configuration options 
.Pq see Xr config 8 
can be used to control the
.Nm
driver.
These options provide compatibility with certain VGA cards.
.Bl -tag -width MOUSE
.It Em VGA_ALT_SEQACCESS
You may want to try this option if the mouse pointer is not drawn correctly 
or the font does not seem to be loaded properly on the VGA card. 
However, it may cause flicker on some systems.
.It Em VGA_SLOW_IOACCESS
Older VGA cards may require this option for proper operation.
It makes the driver perform byte-wide I/O to VGA registers and
slow down a little.
.El
.Pp
The following options add optional features to the driver.
.Bl -tag -width MOUSE
.It Em VESA
Add VESA BIOS support to the driver.
If the VGA card has the VESA BIOS extension 1.2 or later, 
this option will utilize the VESA BIOS service to switch to high
resolution modes.
This option requires the 
.Em VM86
option.
.It Em VESA_DEBUG=N
Set the VESA support debug level to
.Fa N .
The default value is zero, which suppresses all debugging output.
.El
.Pp
The following options will remove some features from the
.Nm
driver and save kernel memory.
.Bl -tag -width MOUSE
.It Em VGA_NO_FONT_LOADING
The
.Nm
driver can load software font to EGA and VGA cards.
This option removes this feature.
.It Em VGA_NO_MODE_CHANGE
This option prevents the driver from changing video modes.
.El
.\".Sh FILES
.Sh EXAMPLE
Your kernel configuration should normally have:
.Pp
.Dl "device vga0 at isa? port ? conflicts"
.Pp
The following lines should be included in the kernel configuration file
in order to enable the VESA BIOS Extension support.
.Pp
.Dl "options" \&"VM86\&"
.Dl "options" \&"VESA\&"
.Dl "device vga0 at isa? port ? conflicts"
.Pp
If you do not want VESA support included in the kernel, but
want to use occasionally, add the following lines to the kernel configuration
file:
.Pp
.Dl "options" \&"VM86\&"
.Dl "device vga0 at isa? port ? conflicts"
.Pp
Then load the
.Nm vesa
module as desired:
.Pp
.Dl kldload vesa
.Pp
.\".Sh DIAGNOSTICS
.\".Sh CAVEATS
.\".Sh BUGS
.Sh SEE ALSO
.Xr syscons 4 ,
.Xr config 8 ,
.Xr kldload 8 ,
.Xr kldunload 8 .
.Sh STANDARD
.Rs
.%T "VESA BIOS Extension (VBE)"
.%A Video Electronics Standards Association
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 3.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Søren Schmidt Aq sos@FreeBSD.org
and 
.An Kazutaka Yokota Aq yokota@FreeBSD.org .
This manual page was written by
.An Kazutaka Yokota .
