freebsd/freebsd-src/share/man/man4/man4.i386/vga.4
.\"
.\" Copyright (c) 1999
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: $
.\"
.Dd February 6, 1999
.Dt VGA 4 i386
.Os FreeBSD
.Sh NAME
.Nm vga
.Nd
generic video card interface
.Sh SYNOPSIS
.Cd "options" \&"VESA\&"
.Cd "options" \&"VESA_DEBUG=N\&"
.Cd "options" \&"VGA_ALT_SEQACCESS\&"
.Cd "options" \&"VGA_NO_FONT_LOADING\&"
.Cd "options" \&"VGA_NO_MODE_CHANGE\&"
.Cd "options" \&"VGA_SLOW_IOACCESS\&"
.Cd "options" \&"VM86\&"
.Cd "device vga0 at isa? port ? conflicts"
.Sh DESCRIPTION
The
.Nm
driver is a generic video card driver which provides access to
video cards.  This driver is required for the console driver
.Xr syscons 4 .
The console driver will call the
.Nm
driver to manipulate video hardware (changing video modes, loading font, etc).
.Pp
The
.Nm
driver supports the standard video cards: MDA, CGA, EGA and VGA.
In addition, the driver can utilize the VESA BIOS extension,
if the video card has one.
VESA support can either be statically included in the kernel or
available as a separate module.
.Pp
In order to statically link the support to the kernel, define the
.Em VESA
option (see below) and the
.Em VM86
option in the kernel configuration file.
.Pp
The
.Nm vesa
module can be loaded to the kernel, without static VESA support, by
.Xr kldload 8 .
The
.Em VM86
option is required in the kernel configuration file in this case too.
.Sh DRIVER CONFIGURATION
.Ss Kernel Configuration Options
The following kernel configuration options control the
.Nm
driver.
They may be set in the kernel configuration file 
.Pq see Xr config 8 .
.Pp
The following options are to provide compatibility with certain VGA
cards.
.Bl -tag -width MOUSE
.It Em VGA_ALT_SEQACCESS
You may want to try this option if the mouse pointer is not drawn correctly 
or font does not seem to be loaded properly on the VGA card. 
However, it may cause flicker on some systems.
.It Em VGA_SLOW_IOACCESS
Older VGA cards may require this option for proper operation.
It makes the driver perform byte-wide I/O to VGA registers and
slow down a little.
.El
.Pp
The following options add optional features to the driver.
.Bl -tag -width MOUSE
.It Em VESA
Add VESA BIOS support to the driver.
If the VGA card has the VESA BIOS extension 1.2 or later, 
this option will utilize the VESA BIOS service to switch to high
resolution modes.
This option requires the 
.Em VM86
option.
.It Em VESA_DEBUG=N
Set the VESA support debug level to N.
The default value is zero (all debugging output is suppressed).
.El
.Pp
The following options will remove some features from the
.Nm
driver and save kernel memory.
.Bl -tag -width MOUSE
.It Em VGA_NO_FONT_LOADING
The
.Nm
driver can load software font to EGA and VGA cards.
This option removes this feature.
.It Em VGA_NO_MODE_CHANGE
This option disallows the driver to change video modes.
.El
.\".Sh FILES
.Sh EXAMPLE
Your kernel configuration should normally have:
.Pp
.Dl "device vga0 at isa? port ? conflicts"
.Pp
The following lines should be included in the kernel configuration file
in order to enable the VESA BIOS Extension support.
.Pp
.Dl "options" \&"VM86\&"
.Dl "options" \&"VESA\&"
.Dl "device vga0 at isa? port ? conflicts"
.Pp
If you do not want the VESA support always included in the kernel, but
want to use occasionally, add the following lines to the kernel configuration
file.
.Pp
.Dl "options" \&"VM86\&"
.Dl "device vga0 at isa? port ? conflicts"
.Pp
And load the
.Nm vesa
module, when desired, as follows.
.Pp
.Dl kldload vesa
.Pp
.\".Sh DIAGNOSTICS
.\".Sh CAVEATS
.\".Sh BUGS
.Sh SEE ALSO
.Xr kldload 8 ,
.Xr kldunload 8 .
.Sh STANDARD
.Rs
.%T "VESA BIOS Extension (VBE)"
.%A Video Electronics Standards Association
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 3.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Søren Schmidt Aq sos@FreeBSD.org
and 
.An Kazutaka Yokota Aq yokota@FreeBSD.org .
This manual page was written by
.An Kazutaka Yokota .
