freebsd/freebsd-src/share/man/man4/man4.i386/wd.4
.\"
.\" Copyright (c) 1994 Wilko Bulte
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd August 31, 1994
.Dt WD 4 i386
.Os FreeBSD
.Sh NAME
.Nm wd
.Nd
Generic WD100x diskcontroller driver
.Sh SYNOPSIS
.sp
.Cd "controller	wdc0 at isa? port" \&"IO_WD1\&" bio irq 14 vector wdintr
.Cd "disk wd0 at wdc0 drive 0
.Cd "disk wd1 at wdc0 drive 1
.sp
.Sh DESCRIPTION
This driver provides access to disks connected to controllers that emulate
the Western Digital WD100x series. This range of controllers includes WD1003
type ST412 controllers, WD1007 ESDI controllers and also the generic IDE 
controllers found on most motherboards.
.sp
Your controller documentation is usually quick to point out any WD100x 
compatibility.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/wd*
disk block device nodes 
.It Pa /dev/rwd*
disk character device nodes
.It Pa /sys/i386/conf/GENERICAH
sample generic kernel config file for (a.o.) wd based systems
.It Pa /sys/i386/isa/wd.c
driver source
.El
.Sh SEE ALSO
.Xr bad144 8
.Sh NOTES
This controller/disk combo has no provisions for automatic bad block handling.
You need to run bad144(8) to check for bad blocks.
