freebsd/freebsd-src/bin/getfacl/getfacl.1
.\"-
.\" Copyright (c) 2000 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"       $FreeBSD$
.\"
.Dd March 30, 2000
.Dt GETFACL 1
.Os
.Sh NAME
.Nm getfacl
.Nd Get ACL Information
.Sh SYNOPSIS
.Nm getfacl
.Op Fl d
.Op Ar file ...
.Sh DESCRIPTION
The
.Nm
utility writes discretionary access control information associated with
the specified file(s) to standard output.
If the
.Xr getconf 8
utility indicates that
.Va {_POSIX_ACL_EXTENDED}
is not in effect for a
.Ar file
then the standard discretionary access permissions are interpreted as
an ACL containing only the required ACL entries.
.Pp
The following option is available:
.Bl -tag -width indent
.It Fl d
The operation applies to the default ACL of a directory instead of the
access ACL.
An error shall be generated if a default ACL cannot be associated with
.Op Ar file .
.El
.Pp
The following operand is available:
.Bl -tag -width indent
.It Ar file
A pathname of a file whose ACL shall be retrieved.
If
.Op Ar file
is not specified, or a
.Op Ar file
is specified as "-", then
.Nm
shall read a list of pathnames, each terminated by one <newline> character,
from the standard input.
.El
.Pp
.Sh EXAMPLES
.Pp
.Dl getfacl /
.Pp
Retrieve ACL for the directory "/".
.Pp
.Dl getfacl -d /
.Pp
Retrieve the default ACL for the directory "/", if any.
.Sh SEE ALSO
.Xr setfacl 1 ,
.Xr acl 3 ,
.Xr getextattr 8 ,
.Xr setextattr 8 ,
.Xr acl 9 ,
.Xr extattr 9
.Sh STANDARDS
The
.Nm
utility is expected to be IEEE Std 1003.2c compliant.
.Sh HISTORY
Extended Attribute and Access Control List support was developed as part
of the TrustedBSD Project and introduced in
.Fx 5.0
.Sh AUTHORS
Robert N M Watson
