freebsd/freebsd-src/usr.sbin/cdplay/cdplay.1
.Dd January 8, 1995
.Dt CDPLAY 1
.Os FreeBSD
.Sh NAME
.Nm cdplay
.Nd Audio CD player
.Sh SYNOPSIS
.Nm cdplay
.Op Ar device
.Op Ar cmd
.Sh DESCRIPTION
.Nm cdplay
is a program to control an audio CD player.  The
.Ar device
is a name such as cd0 or mcd0 and the optional
.Ar cmd
is one of the commands (and any arguments) from the
.Nm
command set.  The \fBhelp\fR command will give a complete listing.
.Pp
If the device not specified, the environment variable 
.Ev CDPLAY
will be used to find the cd device.
.Pp
Currently supported commands are as follows:
.Bl -tag -width Cm
.It Cm play first_track last_track
Play from track 
.Nm first_track
to track 
.Nm last_track. 
The first track has number 1
.Xr play 1
.It Cm stop
Stop playing. Do not stop the disc.
.It Cm resume
Resume playing. Used after the 
.Nm pause
 command.
.It Cm stop
Stop the disc.
.It Cm eject
Eject the disc.
.It Cm setvol left_channel right_channel
Set the volume of left channel to 
.Nm left_channel
and the volume of right channel to 
.Nm right_channel. 
Allowed values are in the range 0-255. 
.It Cm getvol
Print the current values of the volume for left and right channels.
.It Cm msfplay start_m start_s start_f end_m end_s end_f
Play from the absolute address
(MSF) defined by 
.Nm start_m
in minutes, 
.Nm start_s,
in seconds and 
.Nm start_f
(frame number) to the absolute address defined by
.Nm end_m
in minutes, 
.Nm end_s,
in seconds and 
.Nm end_f
(frame number). Minutes are in the range 0-99. Seconds are in the range 0-59.
Frame numbers are in the range 0-74
.It Cm  status
Print the status of the CD player. The first number has the following meaning: 
.sp
.Nm 17
Audio play operation in progress
.br           
.Nm 18
Audio play operation paused 
.br           
.Nm 19
Audio play operation successfully completed
.br           
.Nm 20
Audio play operation stopped due to error
.br           
.Nm 21
No current audio status to return 
.sp
The other numbers are the current MSF address (minute, second, frame)
.It Cm tochdr
Print the first and last track numbers and length.
.It Cm tocentry
Print the table of contents (TOC) of the disc on the form
.br 
.Nm track-number minute second frame 
where 
.NM minute, second
and 
.Nm frame
represent the absolute address of the track.
.br
The track numbered 255 gives the absolute address of the end of the disc.
.It Cm  quit
Quit the program
.Sh FILES
.Bl -tag -width /dev/rmcd0c -compact
.It Pa /dev/rcd0c
.It Pa /dev/rmcd0c
.El
.Sh AUTHOR
Jean-Marc Zucconi
.Sh HISTORY
The
.Nm cdplay
command appeared in FreeBSD 2.0
