freebsd/freebsd-src/usr.bin/pnfsdsfile/pnfsdsfile.1
.\" Copyright (c) 2017 Rick Macklem
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd April 1, 2017
.Dt PNFSDSFILE 1
.Os
.Sh NAME
.Nm pnfsdsfile
.Nd display
a pNFS data storage file location
.Sh SYNOPSIS
.Nm
.Ar metadata_file
.Sh DESCRIPTION
The
.Nm
command displays the location of a data storage file for a pNFS service.
A pNFS service maintains a data storage file for each regular file on
the MetaData Server (MDS) on one of the Data Storage (DS) servers.
This command can be used on the MDS to find out where that data storage
file is.
It must be used on the MDS and the
.Ar metadata_file
must be a file on the exported local file system and not an NFSv4.1 mount.
.El
.Sh SEE ALSO
.Xr nfsv4 4 ,
.Xr nfsd 8
.Sh HISTORY
The
.Nm
command appeared in FreeBSD12.
