freebsd/freebsd-src/sbin/ffsinfo/ffsinfo.8
.\" Copyright (c) 2000 Christoph Herrmann, Thomas-Henning von Kamptz
.\" Copyright (c) 1980, 1989, 1993 The Regents of the University of California.
.\" All rights reserved.
.\" 
.\" This code is derived from software contributed to Berkeley by
.\" Christoph Herrmann and Thomas-Henning von Kamptz, Munich and Frankfurt.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors, as well as Christoph
.\"      Herrmann and Thomas-Henning von Kamptz.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $TSHeader: src/sbin/ffsinfo/ffsinfo.8,v 1.3 2000/12/12 19:30:55 tomsoft Exp $
.\" $FreeBSD$
.\"
.Dd September 8, 2000
.Dt FSINFO 8
.Os BSD 4.4
.Sh NAME
.Nm ffsinfo
.Nd dump all meta information of an existing ufs file system
.Sh SYNOPSIS
.Nm ffsinfo
.Op Fl L
.Op Fl g Ar cylinder group
.Op Fl i Ar inode
.Op Fl l Ar level
.Op Fl o Ar outfile
.Ar special | file
.Sh DESCRIPTION
.Nm Ffsinfo
extends the 
.Xr dumpfs 8
program.
.Pp
The output is generated into the file
.Pa outfile .
Also expect the output file to be rather large.
Up to 2 percent of the size of the specified filesystem is not uncommon.
.Pp
The following options are available:
.\".Pp
.Bl -tag -width indent
.It Fl L
Specifying this option skips the tests of the disklabel.
This is done automatically, if the specified filename to dump is a plain file.
.It Fl g Ar cylinder group
This restricts the dump to infomation about this cylinder group only.
Here 0 means the first cylinder group and -1 the last one.
.It Fl i Ar inode
This restrictes the dump to infomation about this particular inode only.
Here the minimum acceptable inode is 2.
If this option is omitted but a cylinder group is defined then only inodes
within that cylinder group are dumped.
.It Fl l Ar level
The level of detail which will be dumped.
This value defaults to 255 and is the bitwise and of the following table:
.Bd -literal -offset left
0x001 - initial superblock
0x002 - superblock copys in each cylindergroup
0x004 - cylinder group summary in initial cylinder group
0x008 - cylinder group information
0x010 - inode allocation bitmap
0x020 - fragment allocation bitmap
0x040 - cluster maps and summary
0x080 - rotational layout tables
0x100 - inode information
0x200 - indirect block dump
.Ed
.It Fl o Ar outfile
This allows to change the output filename where the dump is written to.
The current default is
.Pa /var/tmp/ffsinfo .
.El
.Sh EXAMPLES
.Pp
.Dl ffsinfo -l 1023 /dev/vinum/testvol
.Pp
will dump
.Pa /dev/vinum/testvol
with all available information.
.Sh BUGS
Currently
.Nm 
can only dump unmounted file systems.
Do not try dumping a mounted file system, your system may panic and you will
not be able to use the file system any longer.
.Pp
Also snapshots are handled like plain files.
They should get a their own level to provide for independent control of the
amount of what gets dumped.
It probably also makes sense to some extend to dump the snapshot as a
filesystem.
.Sh SEE ALSO
.Xr vinum 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr newfs 8 ,
.Xr tunefs 8 ,
.Xr growfs 8 ,
.Xr dumpfs 8
.\".Rs
.\".Re
.Sh AUTHORS
.An Christoph Herrmann Aq chm@FreeBSD.ORG
.An Thomas-Henning von Kamptz Aq tomsoft@FreeBSD.ORG
.An The GROWFS team Aq growfs@Tomsoft.COM
.Sh HISTORY
The
.Nm
command appeared first in
.Bx Free 
5.0
