freebsd/freebsd-src/lib/libpam/modules/pam_wheel/pam_wheel.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 8, 2001
.Dt PAM_WHEEL 8
.Os
.Sh NAME
.Nm pam_wheel
.Nd Wheel PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_wheel
.Op Ar options
.Sh DESCRIPTION
The Wheel authentication service module for PAM,
.Nm
provides functionality for only one PAM category:
authentication.
In terms of the 
.Ar module-type
parameter, this is the
.Dv auth
feature.
It also provides a null function for session management.
.Ss Wheel Authentication Module
The Wheel authentication component
.Pq Fn pam_sm_authenticate ,
permit authentication to members of a group,
which defaults to
.Dv wheel.
.Em ie,
if
.Xr getuid 2
returns 0.
.Pp
The following options may be passed to the authentication module:
.Bl -tag -xwidth ".Cm use_first_pass"
.It Cm debug
.Xr syslog 3
debugging information at
.Dv LOG_DEBUG
level.
.It Cm use_uid
check for wheel membership against 
the current uid
.Pq given by Fn getuid .
.It Cm trust
return
.Dv PAM_SUCCESS
instead of
.Dv PAM_IGNORE
if the user is a member of the group (default is
.Dv wheel ).
.It Cm deny
invert the operation
if is a member of the 
.Pq default Dv wheel )
group.
.Pq return failure instead of success.
mainly of use with the ``group=foo'' option.
.It Cm group=foo
checking for membership of group ``foo''
instead of the default group
.Dv wheel.
.El
.Sh SEE ALSO
.Xr group 5 ,
.Xr pam.conf 5 ,
.Xr pam 8
