freebsd/freebsd-src/lib/libpam/modules/pam_wheel/pam_wheel.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 8, 2001
.Dt PAM_WHEEL 8
.Os
.Sh NAME
.Nm pam_wheel
.Nd Wheel PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_wheel
.Op Ar options
.Sh DESCRIPTION
The Wheel authentication service module for PAM,
.Nm
provides functionality for only one PAM category:
authentication.
In terms of the
.Ar module-type
parameter, this is the
.Dq Li auth
feature.
It also provides a null function for session management.
.Ss Wheel Authentication Module
The Wheel authentication component
.Pq Fn pam_sm_authenticate ,
permit authentication to members of a group,
which defaults to
.Dq Li wheel .
.Pp
The following options may be passed to the authentication module:
.Bl -tag -width ".Cm exempt_if_empty"
.It Cm debug
.Xr syslog 3
debugging information at
.Dv LOG_DEBUG
level.
.It Cm no_warn
suppress warning messages to the user.
These messages include
reasons why the user's
authentication attempt was declined.
.It Cm auth_as_self
check for
.Dq Li wheel
membership against
the current login name
(given by
.Xr getlogin 2 ) .
.It Cm trust
return
.Dv PAM_SUCCESS
instead of
.Dv PAM_IGNORE
if the user is a member of the group (default is
.Dq Li wheel ) .
.It Cm deny
invert the operation
if the user is a member of the
(default
.Dq Li wheel )
group.
Returns failure instead of success.
Mainly of use with the
.Cm group Ns = Ns Ar foo
option.
.It Cm group Ns = Ns Ar foo
checking for membership of group
.Ar foo
instead of the default group
.Dq Li wheel .
.It Cm noroot_ok
return
.Dv PAM_SUCCESS
instead of
.Dv PAM_IGNORE
if the user is authenticating
to a user
that is not the superuser.
.It Cm exempt_if_empty
return
.Dv PAM_IGNORE
if the specified group (default group of
.Dq Li wheel )
is empty, providing traditional BSD
.Xr su 8
semantics permitting any user to su if the wheel group is empty.
.El
.Sh SEE ALSO
.Xr getlogin 2 ,
.Xr syslog 3 ,
.Xr group 5 ,
.Xr pam.conf 5 ,
.Xr pam 8
