freebsd/freebsd-src/usr.sbin/rtadvctl/rtadvctl.8
.\" Copyright (C) 2011 Hiroki Sato <hrs@FreeBSD.org>.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS
.\" IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" PROJECT OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
.\" EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 14, 2011
.Dt RTADVCTL 8
.Os
.Sh NAME
.Nm rtadvctl
.Nd control program for
.Xr rtadvd 8 daemon
.Sh SYNOPSIS
.Nm
.Op Fl v
.Ar subcommand
.Op Ar interface ...
.Sh DESCRIPTION
.Nm
is a utility that communicates
.Xr rtadvd 8
daemon and displays information on Router Advertisement messages being
sent on each interfaces.
.Pp
This utility provides several options and subcommands.
The options are as follows:
.Bl -tag -width indent
.\"
.It Fl v
Increase verbose level.  When specified once, the
.Nm
utility shows additional information on prefixes, RDNSS, and DNSSL
options.
When twice, it shows information on inactive interfaces and
some statistics.
.El
.Pp
The subcommands are as follows:
.Bl -tag -width indent
.\"
.It reload
Specifies reloading the configuration file.
.It shutdown
Makes
.Xr rtadvd 8
daemon shut down immediately.
.It show Op interfaces...
Displays information on Router Advertisement messages being sent
on each interfaces.
.Sh SEE ALSO
.Xr rtadv 8 ,
.Xr rtadvd.conf 5
.Sh HISTORY
The
.Nm
command first appeared in
.Fx 9.0 .
.Sh BUGS
The
.Xr rtadvd 8
daemon stops responding to
.Nm
for a while just after reloading the configuration file by the reload
subcommand.
This is because in the current implementation it cannot communicate
with
.Nm
during sending some additional RAs for graceful transition from one
configuration to another.
It will take at most nine seconds for each interface.
