freebsd/freebsd-src/usr.sbin/named.reload/named.reload.8
.\"-
.\" Copyright (c) 2004 Dag-Erling Coïdan Smørgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer
.\"    in this position and unchanged.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.sbin/named.reload/named.reload.8,v 1.7.2.1 2004/09/26 03:10:19 des Exp $
.\"
.Dd September 21, 2004
.Dt NAMED.RELOAD 8
.Os
.Sh NAME
.Nm named.reconfig ,
.Nm named.reload
.Nd reload name server configuration
.Sh SYNOPSIS
.Nm named.reconfig
.Op Fl V
.Op Fl c config-file
.Op Fl k key-file
.Op Fl s server
.Op Fl p port
.Op Fl y keyid
.Nm named.reload
.Op Fl V
.Op Fl c config-file
.Op Fl k key-file
.Op Fl s server
.Op Fl p port
.Op Fl y keyid
.Sh DESCRIPTION
The
.Nm named.reconfig
command signals the name server to reload its configuration files and
load any new zones.
.Pp
The
.Nm named.reload
command signals the name server to reload its configuration files and
all zones.
.Pp
Both these commands take the same command-line arguments as
.Xr rndc 8 ,
except for the command argument, which is implied by the name.
.Sh SEE ALSO
.Xr named.conf 5 ,
.Xr rndc.conf 5 ,
.Xr named 8 ,
.Xr rndc 8
