freebsd/freebsd-src/usr.sbin/slstat/slstat.8
.\" Copyright (c) 1986 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)slstat.8	6.8 (Berkeley) 6/20/91
.\"
.TH SLSTAT 1 "June 20, 1991"
.UC 4
.SH NAME
slstat \- report serial line IP statistics
.SH SYNOPSIS
.nf
.ft B
slstat  [ \-i interval ] [ \-v ] [ \-r ] [ unit ] [ system ] [ core ]
.ft R
.fi
.SH DESCRIPTION
.I Slstat
reports certain kernel statistics kept about serial line internet
protocol traffic.
.PP
The options are as follows:
.TP
\-i
Repeat the display indefinitely every
.I interval
seconds.
If no
.I interval
is specified, the default is 5 seconds.
.TP
\-v
Verbose display of extra fields of information.
.TP
\-r
Display all values in rate per second that ammount per interval.
.TP
unit
is a single digit specifying the slip interface. The default unit is
.I 0
for interface
.I sl0.
.TP
system
Extract the name list from the specified system instead of the default, /386bsd.
.TP
core
Extract values associated with the name list from the specified
core instead of the default, /dev/kmem.
.PP
By default,
.I vmstat
displays the following information:
.PP
.TP
in
bytes received
.TP
out
bytes sent
.TP
pack
packets received or sent
.TP
comp
compressed packets received or sent
.TP
uncomp
uncompressed packets received or sent
.TP
unknwn
inbound packets of unknown type
.TP
toss
inbound packets tossed because of error
.TP
other
all other inbound or outbound ip packets
.TP
err
input or output errors
.TP
search
searches for connection state
.TP
miss
times we could not find a connectoin state
.TP
coll
collisions with end of clists.
If you get many collisions (more than one or two
a day) you probably do not have enough clists
and you should increase "nclist" in param.c.
.SH EXAMPLES
The command ``slstat -i 5'' will print what the system is doing every five
seconds.
.SH FILES
.ta \w'/dev/kmem  'u
/386bsd	default kernel namelist
.br
/dev/kmem	default memory file
.SH SEE ALSO
.IR fstat (1),
.IR netstat (1),
.IR nfsstat (1),
.IR ps (1),
.IR systat (1),
.IR iostat (8),
.IR pstat (8)
.sp
The sections starting with ``Interpreting system activity'' in
.IR "Installing and Operating 4.3BSD" .
.SH BUGS

