freebsd/freebsd-src/sbin/atm/fore_dnld/fore_dnld.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) $Id: fore_dnld.1,v 1.4 1997/05/09 17:29:37 mks Exp $
.\"
.\"
.de EX		\"Begin example
.ne 5
.if n .sp 1
.if t .sp .5
.nf
.in +.5i
..
.de EE
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.TH FORE_DNLD 8 "1996-12-03" "HARP"
.SH NAME
fore_dnld \- Download FORE Systems' microcode into host ATM adapter
.SH SYNOPSIS
.B fore_dnld
[-i intf]
[-d path]
[-f objfile]
.sp
.fi
.SH DESCRIPTION
.I fore_dnld
downloads FORE Systems' microcode into the host ATM adapter(s).
.fi
.SH OPTIONS
.TP
.B \-i intf
Specify which ATM interface to download microcode to.
Default is to load microcode into all FORE Systems host adapters.
.TP
.B -d path
Specify the path to prepend to the "objfile" name.
Default is to use current directory.
.TP
.B -f objfile
Specify the microcode binary file. Defaults are:
"sba200.obj" for SBA-200 adapters,
"sba200e.obj" for SBA-200E adapters, and
"pca200e.bin" for PCA-200E adapters. 
.fi
.SH NOTES
.PP
Microcode as distributed by FORE Systems is not ready for downloading
directly into SBA host ATM adapters. Instead, the supplied microcode needs
to be processed with the "objcopy" command to create an image suitable
for downloading. Arguments to "objcopy" are "-S -l -Fcoff". Microcode as
distibuted by FORE Systems for the PCA host ATM adapter does not need
to be processed.
.SH "SEE ALSO"
.PP
~fore/etc/objcopy - command to process FORE Systems supplied microcode.
.PP
~fore/etc/sba200*.ucode* - microcode as supplied by FORE Systems for SBA
adapters.
.PP
~fore/i386/pca200e.bin - microcode as supplied by FORE Systems for PCA
adapters.
.PP
~harp/doc/Install - HARP installation instructions.
.fi
.SH BUGS
.PP
None known.
.fi
.SH COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.
.fi
.SH AUTHORS
John Cavanaugh, Minnesota Supercomputer Center, Inc.
.br
Mike Spengler, Minnesota Supercomputer Center, Inc.
.br
Joe Thomas, Minnesota Supercomputer Center, Inc.
.fi
.SH ACKNOWLEDGMENTS
This software was developed under the sponsorship of the
Defense Advanced Research Projects Agency (DARPA) under
contract numbers F19628-92-C-0072 and F19628-95-C-0215.
