freebsd/freebsd-src/sbin/geom/class/raid5/graid5.8
.\" Copyright (c) 2006 Arne Woerner <arne_woerner@yahoo.com>
.\" testing + tuning-tricks: veronica@fluffles.net
.\" testing: lev@FreeBSD.org
.\" derived from gstripe/gmirror (Pawel Jakub Dawidek <pjd@FreeBSD.org>)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: graid5.8,v 1.18 2008/05/22 02:10:47 aw Exp $
.\"
.Dd Dec 11, 2006
.Dt GRAID5 8
.Os
.Sh NAME
.Nm graid5
.Nd "control utility for raid5 devices"
.Sh SYNOPSIS
.Nm
.Cm destroy
.Op Fl fvy
.Ar name ...
.Nm
.Cm label
.Op Fl hnSv
.Op Fl s Ar stripesize
.Ar name
.Ar prov prov ...
.Nm
.Cm configure
.Op Fl hnRS
.Ar name
.Nm
.Cm stop
.Op Fl fv
.Ar name ...
.Nm
.Cm insert
.Ar name prov
.Nm
.Cm remove
.Ar name prov
.Nm
.Cm clear
.Op Fl v
.Ar prov ...
.Nm
.Cm dump
.Ar prov ...
.Nm
.Cm list
.Nm
.Cm status
.Nm
.Cm load
.Nm
.Cm unload
.Sh DESCRIPTION
The
.Nm
utility is used for setting up a RAID-5 on two or more disks.
The RAID5'ed device can be configured using two different methods:
.Dq manual
or
.Dq automatic .
When using the
.Dq manual
method, no metadata are stored on the devices, so the RAID5
device has to be configured by hand every time it is needed.
The
.Dq automatic
method uses on-disk metadata to detect devices.
Once devices are labeled, they will be automatically detected and
configured.
.Pp
The first argument to
.Nm
indicates an action to be performed:
.Bl -tag -width ".Cm destroy"
.It Cm label
Set up a RAID5 device from the given devices with the specified
.Ar name .
This is the
.Dq automatic
method, where metadata are stored in every device's last sector.
The kernel module
.Pa geom_raid5.ko
will be loaded if it is not loaded already.
.Pp
Additional options include:
.Bl -tag -width ".Fl s Ar stripesize"
.It Fl h
Hardcode providers' names in metadata.
.It Fl c
CowOp mode: Complete-Only-Write-Operation --
dont write if not in status COMPLETE.
.It Fl S
SafeOp mode: read the whole stripe for every read and verify parity.
.It Fl n
never-hot-mode: A 2 disk graid5 device doesnt need the hot marker,
if it is used as swap space. Furthermore this flags is useful, if
a rebuild would be harmful even if a write request was pending.
.It Fl s Ar stripesize
Specify stripesize.
Recommendation: MAXPHYS (currently 128KiB) == stripesize.
The
.Ar stripesize
must be a power of 2 and
a multiple of the largest sector size of all the providers.
.El
.It Cm configure
Configure an existing graid5 device:
.Pp
Options are:
.Bl -tag -width "Fl h"
.It Fl h
Trigger: hardcoded option.
.It Fl a
Reset error flag of all disks.
.It Fl c
CowOp mode: Complete-Only-Write-Operation --
dont write if not in status COMPLETE.
.It Fl n
Trigger: never-hot-mode option.
.It Fl S
Trigger: SafeOp-mode option.
.It Fl R
Trigger: start/stop re-sync.
.El
.It Cm stop
Turn off an existing RAID5 device by its
.Ar name .
This command does not touch on-disk metadata!
.Pp
Options are:
.Bl -tag -width "Fl y"
.It Fl f
Force destroy even if still busy.
.It Fl y
Do not do the Yo-Yo effect.
.El
.It Cm destroy
Same as
.Cm stop .
.It Cm clear
Clear metadata on the given devices.
.It Cm dump
Dump metadata stored on the given devices.
.It Cm list
See
.Xr geom 8 .
.It Cm status
See
.Xr geom 8 .
.It Cm load
See
.Xr geom 8 .
.It Cm unload
See
.Xr geom 8 .
.El
.Pp
Additional options:
.Bl -tag -width ".Fl f
.It Fl f
Force the removal of the specified striped device.
.It Fl v
Be more verbose.
.El
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 8
variables can be used to control the behavior of the
.Nm RAID5
GEOM class.
The default value is shown next to each variable.
.Bl -tag -width indent
.It Va kern.geom.raid5.debug : No 0
Debug level of the
.Nm RAID5
GEOM class.
This can be set to a number between 0 and 3 inclusive.
If set to 0 minimal debug information is printed, and if set to 3 the
maximum amount of debug information is printed.
.It Va kern.geom.raid5.mhm : No 0 (read-only)
Number of malloc hamster cache misses.
.It Va kern.geom.raid5.mhh : No 0 (read-only)
Number of malloc hamster cache hits.
.It Va kern.geom.raid5.maxmem : No 8000000 (tunable)
This variable can be set any time to any 32bit signed integer value.
It is cropped apropriately (0..128MB) and interpreted as bytes.
.It Va kern.geom.raid5.wqf : No 0 (read-only)
This value shows the number of write requests that were issued early due to
a conflicting read request.
.It Va kern.geom.raid5.wqp : No 0 (read-only)
This value shows the maximum number of pending write requests so far.
.It Va kern.geom.raid5.blked1 : No 0 (read-only)
This value shows the number of new write requests that could not be combined
because the corresponding area already has an issued but incomplete
write request.
.It Va kern.geom.raid5.blked2 : No 0 (read-only)
This value shows number of due write (2-phase) requests, that were blocked by
another such request due to parity area conflict.
.It Va kern.geom.raid5.dsk_ok : No 50 (read-only)
This value shows the healthiness of the underlying devices.
50 is perfect. 40 or lower triggers a soft-device-remove.
0 causes an error announced to the upper layer.
.It Va kern.geom.raid5.veri_nice : No 100 (tunable)
This value (milli seconds) enforces a delay after a user-land read request
for internal verify requests, which are certainly quite hindering for
user-land requests, because they read all disks and in some cases even
write a disk.
.It Va kern.geom.raid5.veri_w : No 0 (read-only)
This value shows the number of parity-failures (during rebuild)
.It Va kern.geom.raid5.veri : No 0 (read-only)
This value shows the number of parity checks (during rebuild).
.It Va kern.geom.raid5.wreq2_cnt : No 0 (read-only)
Number of 2-phase writes (1. phase: read data&parity (or "other" data in case
of three disks); 2. phase: write data&parity).
.It Va kern.geom.raid5.wreq1_cnt : No 0 (read-only)
Number of 1-phase writes (sufficiently long chunks can be written in one
phase).
.It Va kern.geom.raid5.wreq_cnt : No 0 (read-only)
Write requests started by upper layer.
.It Va kern.geom.raid5.rreq_cnt : No 0 (read-only)
Read requests started by upper layer.
.It Va kern.geom.raid5.maxwql : No 0 (tunable)
This variable gives a hint for the maximum length of the write queue.
Write requests are queued until they are long enough or old enough or
until there are too many of them.
.It Va kern.geom.raid5.wdt : No 10 (tunable)
This variable determines the maximum age of a write request before it
is issued.
.It Va kern.geom.raid5.tooc : No 3 (tunable)
This variable determines the time-out-on-create. The provider is not
created before all consumers are present or the timeout is over.
.El
.Sh EXIT STATUS
Exit status is 0 on success, and 1 if the command fails.
.Sh EXAMPLES
The following example shows how to set up a RAID5 device from four disks with a
128KB stripe size for automatic configuration,
create a file system on it,
and mount it:
.Bd -literal -offset indent
graid5 label -v -s 131072 data /dev/da0 /dev/da1 /dev/da2 /dev/da3
newfs /dev/raid5/data
mount /dev/raid5/data /mnt
[...]
umount /mnt
graid5 stop data
graid5 unload
.Ed
.Sh COMPATIBILITY
The
.Nm
interleave is in number of bytes,
unlike
.Xr ccdconfig 8
and
.Xr atacontrol 8
which use the number of sectors.
A
.Xr ccdconfig 8
.Ar ileave
of
.Ql 128
is 64 KB (128 512B sectors).
The same stripe interleave would be specified as
.Ql 65536
for
.Nm .
.Sh SEE ALSO
.Xr geom 4 ,
.Xr loader.conf 5 ,
.Xr atacontrol 8 ,
.Xr ccdconfig 8 ,
.Xr geom 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr sysctl 8 ,
.Xr umount 8 ,
.Xr vinum 8
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.3 .
.Sh AUTHORS
.An Arne W?rner Aq arne_woerner@yahoo.com
.An testing & tuning: Aq veronica@fluffles.net
