freebsd/freebsd-src/libexec/save-entropy/save-entropy.8
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2023 Fernando Apesteguia <fernando.apesteguia@gmail.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 18, 2023
.Dt SAVE-ENTROPY 8
.Os
.Sh NAME
.Nm save-entropy
.Nd Save bits of entropy to feed /dev/random at startup
.Sh SYNOPSIS
.Nm save-entropy
.Sh DESCRIPTION
The
.Nm
command is used to save entropy data from
.Pa /dev/random
to files in a specified output location.
The files saved are used at startup to provide additional entropy for
.Pa /dev/random .
The output file will be different in every invocation until the maximum number
of different files is reached.
(See
.Em entropy_save_num
for details).
By default this script is invoked via
.Xr cron 8
every eleven minutes approximately.
.Pp
This command does nothing if executed inside a
.Xr jail 8 .
.Pp
Three variables in
.Pa /etc/rc.conf
regulate the behavior of the script:
.Bl -tag -width Ds
.It Va entropy_dir
Specify the directory for saved entropy files.
Defaults to
.Pa /var/db/entropy .
If set to "NO" it disables caching entropy via
.Xr cron 8 .
This setting is shared with
.Pa /etc/rc.d/random .
.It Va entropy_save_sz
Size of the entropy cache files.
Defaults to 4096.
.It Va entropy_save_num
Number of entropy cache files to save.
Defaults to 8.
.El
.Sh FILES
.Bl -tag -width Ds
.It Pa /etc/rc.conf
.El
.Sh EXIT STATUS
.Ex -std
Errors will be recorded in the system log.
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr random 4 ,
.Xr rc.conf 5 ,
.Xr cron 8
.Sh HISTORY
The
.Nm
command first appeared in
.Fx 5.0 .
.Sh AUTHORS
The
.Nm
command was originally written by
.An Doug Barton <dougb@FreeBSD.org> .
This manual page was written by
.An Fernando Apesteguia <fernape@FreeBSD.org> .
