freebsd/freebsd-src/usr.bin/uucp/uusnap/uusnap.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)uusnap.8	8.1 (Berkeley) 6/6/93
.\"
.Dd June 6, 1993
.Dt UUSNAP 8
.Os BSD 4.2
.Sh NAME
.Nm uusnap
.Nd show snapshot of the
.Tn UUCP
system
.Sh SYNOPSIS
.Nm uusnap
.Sh DESCRIPTION
.Nm Uusnap
displays in tabular format a synopsis of the current
.Tn UUCP
situation.  The format of each line is as follows:
.Bd -literal -offset indent -compact

site   N Cmds   N Data   N Xqts   Message

.Ed
Where "site" is the name of the site with work, "N" is a count of
each of the three possible types of work (command, data, or remote execute),
and "Message" is the current status message for that
site as found in the
.Tn STST
file.
.Pp
Included in "Message" may be the time left before
.Tn UUCP
can re-try the
call, and the count of the number of times that
.Tn UUCP
has tried
(unsuccessfully) to reach the site.
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr uuq 1 ,
.Xr uucico 8
.Rs
.%T "UUCP Implementation Guide"
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
