freebsd/freebsd-src/usr.sbin/xntpd/doc/ntptrace.8
.\"
.\"	$Id$
.\"
.Dd December 21, 1993
.Dt NTPTRACE 8
.Os
.Sh NAME
.Nm ntptrace
.Nd "trace a chain of NTP hosts back to their master time source"
.Sh SYNOPSIS
.Nm ntptrace
.Op Fl vdn
.Op Fl r Ar retries
.Op Fl t Ar timeout
.Op Ar server
.Sh DESCRIPTION
.Nm Ntptrace
determines where a given Network Time Protocol (NTP) server gets
its time from, and follows the chain of NTP servers back to their
master time source.
If given no arguments, it starts with
.Dq localhost .
.Pp
Here is an example of the output from
.Nm Ns :
.Bd -literal
% ntptrace
localhost: stratum 4, offset 0.0019529, synch distance 0.144135
server2.bozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
h.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'
.Ed
.Pp
On each line, the fields are (left to right): the host name, the
host's stratum,
the time offset between that host and the local host
(as measured by
.Nm Ns ;
this is why it is not always zero for
.Dq localhost ) ,
the host's
.Dq synchronization distance ,
and (only for stratum-1 servers) the reference clock ID.  All times
are given in seconds.  (Synchronization distance is a measure of the
goodness of the clock's time.)
.Sh OPTIONS
The following options are available:
.Bl -tag -width indent
.It Fl d
Turn on some debugging output.
.It Fl n
Turn off the printing of host names; instead, host IP addresses
are given.  This may be necessary if a nameserver is down.
.It Fl r Ar retries
Set the number of retransmission attempts for each host; the default is 5.
.It Fl t Ar timeout
Set the retransmission timeout (in seconds); the default is 2.
.It Fl v
Print verbose information about the NTP servers.
.El
.Sh SEE ALSO
.Xr xntpd 8 ,
.Xr xntpdc 8
.Sh BUGS
This program makes no attempt to improve accuracy by doing multiple
samples.
