freebsd/freebsd-src/usr.sbin/i4b/isdnphone/isdnphone.8
.\"
.\" Copyright (c) 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: isdnphone.8,v 1.4 1999/12/13 22:11:55 hm Exp $
.\"
.\" $FreeBSD: src/usr.sbin/i4b/isdnphone/isdnphone.8,v 1.5.2.1 2001/08/01 17:45:06 obrien Exp $
.\"
.\"	last edit-date: [Mon Dec 13 23:05:19 1999]
.\"
.\"
.Dd March 24, 1999
.Dt ISDNPHONE 8
.Os
.Sh NAME
.Nm isdnphone
.Nd telephone dialing and more for isdn4bsd
.Sh SYNOPSIS
.Nm
.Op Fl h
.Op Fl n Ar number
.Op Fl u Ar unit
.Sh DESCRIPTION
.Nm
is part of the isdn4bsd package and is used to handle dialing and hangup
for the telephone control interfaces /dev/i4bteld<n>.
.Pp
Options are provided to dial out or hang up using commandline parameters
(for use in scripts) or, if none of those options are specified, bring up
a curses-based fullscreen interface.
.Pp
The following options are available:
.Bl -tag -width Ds
.It Fl h
hang up a possibly open telefone connection on the selected interface.
.It Fl n
dial the specified number on the selected interface.
.It Fl u
Set the unit number to specify the interface used.
.El
.Sh FILES
/dev/i4bteld<n>
.Sh EXAMPLES
The command:
.Bd -literal -offset indent
isdnphone -n 1234
.Ed
.Pp
dials calls the number 1234 to establish a call on /dev/i4btel0
.Sh AUTHORS
The
.Nm
utility and this manpage were written by
.An Hellmuth Michaelis Aq hm@kts.org .
