freebsd/freebsd-src/sbin/sysctl/sysctl.8
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	From: @(#)sysctl.8	8.1 (Berkeley) 6/6/93
.\" $FreeBSD$
.\"
.Dd March 10, 2002
.Dt SYSCTL 8
.Os
.Sh NAME
.Nm sysctl
.Nd get or set kernel state
.Sh SYNOPSIS
.Nm
.Op Fl beNnox
.Ar name Ns Op = Ns Ar value
.Ar ...
.Nm
.Op Fl bdeNnox
.Fl a
.Sh DESCRIPTION
The
.Nm
utility retrieves kernel state and allows processes with appropriate
privilege to set kernel state.
The state to be retrieved or set is described using a
.Dq Management Information Base
.Pq Dq MIB
style name, described as a dotted set of
components.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl A
Equivalent to
.Fl o a
(for compatibility).
.It Fl a
List all the currently available non-opaque values.
This option is ignored if one or more variable names are specified on
the command line.
.It Fl b
Force the value of the variable(s) to be output in raw, binary format.
No names are printed and no terminating newlines are output.
This is mostly useful with a single variable.
.It Fl d
Print the description of the variable instead of its value.
.It Fl e
Separate the name and the value of the variable(s) with
.Ql = .
This is useful for producing output which can be fed back to the
.Nm
utility.
This option is ignored if either
.Fl N
or
.Fl n
is specified, or a variable is being set.
.It Fl N
Show only variable names, not their values.
This is particularly useful with shells that offer programmable
completion.
To enable completion of variable names in
.Nm zsh ,
use the following code:
.Bd -literal -offset indent
listsysctls () { set -A reply $(sysctl -AN ${1%.*}) }
compctl -K listsysctls sysctl
.Ed
.It Fl n
Show only variable values, not their names.
This option is useful for setting shell variables.
For instance, to save the pagesize in variable
.Va psize ,
use:
.Pp
.Dl "set psize=`sysctl -n hw.pagesize`"
.It Fl o
Show opaque variables (which are normally suppressed).
The format and length are printed, as well as a hex dump of the first
sixteen bytes of the value.
.It Fl X
Equivalent to
.Fl x a
(for compatibility).
.It Fl x
As
.Fl o ,
but prints a hex dump of the entire value instead of just the first
few bytes.
.El
.Pp
The information available from
.Nm
consists of integers, strings, devices
.Pq Vt dev_t ,
and opaque types.
.Nm Sysctl
only knows about a couple of opaque types, and will resort to hexdumps
for the rest.
The opaque information is much more useful if retrieved by special
purpose programs such as
.Nm ps , systat ,
and
.Nm netstat .
.Pp
The string and integer information is summarized below.
For a detailed description of these variable see
.Xr sysctl 3 .
.Pp
The changeable column indicates whether a process with appropriate
privilege can change the value.
String, integer, and devices values can be set using
.Nm .
For device values,
.Ar value
can be specified as a character device special file name.
Special values
.Ar off
and
.Ar none
denote
.Dq no device .
.Bl -column security.bsd.unprivileged_read_msgbuf integerxxx
.It Sy "Name	Type	Changeable
.It "kern.ostype	string	no
.It "kern.osrelease	string	no
.It "kern.osrevision	integer	no
.It "kern.version	string	no
.It "kern.maxvnodes	integer	yes
.It "kern.maxproc	integer	no
.It "kern.maxprocperuid	integer	yes
.It "kern.maxfiles	integer	yes
.It "kern.maxfilesperproc	integer	yes
.It "kern.argmax	integer	no
.It "kern.securelevel	integer	raise only
.It "kern.hostname	string	yes
.It "kern.hostid	integer	yes
.It "kern.clockrate	struct	no
.It "kern.posix1version	integer	no
.It "kern.ngroups	integer	no
.It "kern.job_control	integer	no
.It "kern.saved_ids	integer	no
.It "kern.boottime	struct	no
.It "kern.domainname	string	yes
.It "kern.filedelay	integer	yes
.It "kern.dirdelay	integer	yes
.It "kern.metadelay	integer	yes
.It "kern.osreldate	string	no
.It "kern.bootfile	string	yes
.It "kern.corefile	string	yes
.It "kern.dumpdev	dev_t	yes
.It "kern.logsigexit	integer	yes
.It "security.bsd.suser_enabled	integer	yes
.It "security.bsd.see_other_uids	integer	yes
.It "security.bsd.unprivileged_proc_debug	integer	yes
.It "security.bsd.unprivileged_read_msgbuf	integer	yes
.It "vm.loadavg	struct	no
.It "hw.machine	string	no
.It "hw.model	string	no
.It "hw.ncpu	integer	no
.It "hw.byteorder	integer	no
.It "hw.physmem	integer	no
.It "hw.usermem	integer	no
.It "hw.pagesize	integer	no
.It "hw.floatingpoint	integer	no
.It "hw.machine_arch	string	no
.It "machdep.console_device	dev_t	no
.It "machdep.adjkerntz	integer	yes
.It "machdep.disable_rtc_set	integer	yes
.It "user.cs_path	string	no
.It "user.bc_base_max	integer	no
.It "user.bc_dim_max	integer	no
.It "user.bc_scale_max	integer	no
.It "user.bc_string_max	integer	no
.It "user.coll_weights_max	integer	no
.It "user.expr_nest_max	integer	no
.It "user.line_max	integer	no
.It "user.re_dup_max	integer	no
.It "user.posix2_version	integer	no
.It "user.posix2_c_bind	integer	no
.It "user.posix2_c_dev	integer	no
.It "user.posix2_char_term	integer	no
.It "user.posix2_fort_dev	integer	no
.It "user.posix2_fort_run	integer	no
.It "user.posix2_localedef	integer	no
.It "user.posix2_sw_dev	integer	no
.It "user.posix2_upe	integer	no
.It "user.stream_max	integer	no
.It "user.tzname_max	integer	no
.El
.Sh EXAMPLES
For example, to retrieve the maximum number of processes allowed
in the system, one would use the following request:
.Pp
.Dl "sysctl kern.maxproc"
.Pp
To set the maximum number of processes allowed
per uid to 1000, one would use the following request:
.Pp
.Dl "sysctl kern.maxprocperuid=1000"
.Pp
The device used for crash dumps can be specified using:
.Pp
.Dl "sysctl kern.dumpdev=/dev/somedev"
.Pp
which is equivalent to
.Pp
.Dl "dumpon /dev/somedev"
.Pp
Information about the system clock rate may be obtained with:
.Pp
.Dl "sysctl kern.clockrate"
.Pp
Information about the load average history may be obtained with:
.Pp
.Dl "sysctl vm.loadavg"
.Pp
More variables than these exist, and the best and likely only place
to search for their deeper meaning is undoubtedly the source where
they are defined.
.Sh FILES
.Bl -tag -width ".Aq Pa netinet/icmp_var.h" -compact
.It Aq Pa sys/sysctl.h
definitions for top level identifiers, second level kernel and hardware
identifiers, and user level identifiers
.It Aq Pa sys/socket.h
definitions for second level network identifiers
.It Aq Pa sys/gmon.h
definitions for third level profiling identifiers
.It Aq Pa vm/vm_param.h
definitions for second level virtual memory identifiers
.It Aq Pa netinet/in.h
definitions for third level Internet identifiers and
fourth level IP identifiers
.It Aq Pa netinet/icmp_var.h
definitions for fourth level ICMP identifiers
.It Aq Pa netinet/udp_var.h
definitions for fourth level UDP identifiers
.El
.Sh COMPATIBILITY
The
.Fl w
option has been deprecated and is silently ignored.
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr sysctl.conf 5
.Sh BUGS
.Nm Sysctl
presently exploits an undocumented interface to the kernel
sysctl facility to traverse the sysctl tree and to retrieve format
and name information.
This correct interface is being thought about for the time being.
.Sh HISTORY
.Nm Sysctl
first appeared in
.Bx 4.4 .
.Pp
In
.Fx 2.2 ,
.Nm
was significantly remodeled.
