freebsd/freebsd-src/share/examples/mdoc/example.4
.\"
.\" Copyright (c) [year] [your name]
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd June 19, 2026
.Dt EXAMPLE 4 amd64
.Os
.Sh NAME
.Nm example
.Nd example device driver manual page
.Sh SYNOPSIS
.Cd device example
.Cd options EXAMPLE_DEBUG
.Pp
In
.Xr device.hints 5 :
.Cd here.is.a.example.device.hint Ns Ao Ns = Ns Ar optional_value Ac
.Pp
In
.Xr rc.conf 5 :
.Cd kld_list="kernel_module_name"
.Pp
In
.Xr loader.conf 5 :
.Cd here.is.a.example.tunable Ns Ao Ns = Ns Ar optional_value Ac
.Pp
In
.Xr loader.conf 5
or
.Xr sysctl.conf 5 :
.Cd here.is.a.example.sysctl Ns Ao Ns = Ns Ar optional_value Ac
.Sh DEPRECATION NOTICE
This driver is scheduled for removal prior to the release of
.Fx 17.0 .
.Sh DESCRIPTION
This is an example device driver manual page for the
.Nm
driver.
It is intended that this example can be used as a template
when writing a new manual page.
.Pp
If the kernel is compiled with the
.Dv EXAMPLE_DEBUG
option, then additional debugging messages will be displayed.
.Pp
The
.Nm
driver supports the following ioctls:
.Bl -tag -width "EIOCNULL"
.It Dv EIOCEX
Example ioctl.
.It Dv EIOCNULL
Example ioctl.
.El
.Sh HARDWARE
The
.Nm
driver supports the following example hardware:
.Pp
.Bl -bullet -compact
.It
Example device 4201
.It
Example device 4202
.El
.Sh FILES
.Bl -tag -width "/dev/null" -compact
.It Pa /dev/null
Example of a file in the
.Sx FILES
section.
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "example%d: example diagnostic message."
An example of a diagnostic message.
.It "example%d: another example diagnostic message."
Self explanatory.
.El
.Sh SEE ALSO
.Xr example 1 ,
.Xr example 3 ,
.Xr mdoc 7 ,
.Xr example 9
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 2.2 .
.Pp
Some other common
.Sx HISTORY
section examples are:
.Pp
The
.Nm
manual page example first appeared in
.Bx 4.4 .
.Pp
The
.Nm
manual page example first appeared in
.At v6 .
.Sh AUTHORS
This manual page was written by
.An Mike Pritchard Aq Mt mpp@FreeBSD.org
and
.An Alexander Ziaee Aq Mt ziaee@FreeBSD.org .
.Sh BUGS
The actual code for this device driver is vaporware.
