freebsd/freebsd-src/sbin/mount_reiserfs/mount_reiserfs.8
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" Copyright (c) 1999 Semen Ustimenko
.\" Copyright (c) 2005 Jean-Sébastien Pédron
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/sbin/mount_reiserfs/mount_reiserfs.8,v 1.2.24.1 2010/02/10 00:26:20 kensmith Exp $
.\"
.Dd February 3, 2005
.Dt MOUNT_REISERFS 8
.Os
.Sh NAME
.Nm mount_reiserfs
.Nd "mount a ReiserFS file system"
.Sh SYNOPSIS
.Nm
.Ar special
.Ar node
.Sh DESCRIPTION
The
.Nm
utility attaches the ReiserFS file system residing on the device
.Ar special
to the global file system namespace at the location
indicated by
.Ar node .
.Pp
This command is normally executed by
.Xr mount 8
at boot time, but can be used by any user to mount a
ReiserFS file system on any directory that they own (provided,
of course, that they have appropriate access to the device that
contains the file system).
.Sh EXAMPLES
To mount a ReiserFS volume located in
.Pa /dev/ad1s1 :
.Pp
.Dl "mount_reiserfs /dev/ad1s1 /mnt"
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh CAVEATS
This utility is primarily used for read access to a ReiserFS volume.
Writing to a volume is currently unsupported.
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 6.0 .
.Sh AUTHORS
.An -nosplit
The ReiserFS kernel implementation was written by
.An Hans Reiser
.Pq Pa http://www.namesys.com/ ,
and ported to
.Fx
by
.An Jean-S\['e]bastien P\['e]dron Aq dumbbell@FreeBSD.org .
.Pp
The
.Nm
utility and manual were written by
.An Jean-S\['e]bastien P\['e]dron Aq dumbbell@FreeBSD.org .
