freebsd/freebsd-src/usr.sbin/vidcontrol/vidcontrol.1
.\" t
.\"
.\" vidcontrol - a utility for manipulating the syscons video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\"	$Id: vidcontrol.1,v 1.14.2.1 1999/04/08 13:53:31 ghelmer Exp $
.\"
.Dd May 22, 1994
.Dt VIDCONTROL 1
.Os
.Sh NAME
.Nm vidcontrol
.Nd a utility for manipulating the syscons video driver.
.Sh SYNOPSIS
.Nm
.Op Fl r Ar fg Ar bg
.Op Fl b Ar color
.Op Fl c Ar appearance
.Op Fl d
.Op Fl i Ar adapter|mode
.Op Fl l Ar scrmap
.Op Fl L
.Op Fl m Ar on|off
.Op Fl f Ar size Ar file
.Op Fl s Ar number
.Op Fl t Ar N|off
.Op Fl x
.Op mode
.Op fgcol Op bgcol
.Op show
.Sh DESCRIPTION
The
.Nm
command is used to set various options for the syscons video driver,
such as video mode, colors, cursors, scrnmaps, font and screensaver timeout.
.Pp
The following command line options are supported:
.Bl -tag -width indent
.It mode
Select a new video mode. The modes currently recognized are:
.Ar 40x25 ,
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x30 ,
.Ar VGA_80x50 ,
.Ar VGA_80x60 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x30 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60 .
.\"The graphic mode
.\".Ar VGA_320x200
.\"and
The raster text mode
.Ar VESA_800x600
can also be chosen.
See
.Sx Video Mode Support
below.
.It fgcol Op bgcol
Change colors when displaying text. Specify the foreground color
(e.g. "vidcontrol white"), or both a foreground & background color
(e.g. "vidcontrol yellow blue").
.It show
See the supported colors on a given platform.
.It Fl r Ar foreground Ar background
Change reverse mode colors to
.Ar foreground 
and 
.Ar background .
.It Fl b Ar color
Set border color to 
.Ar color 
(only supported on VGA hardware).
.It Fl c Ar normal|blink|destructive
Change the cursor appearance. The cursor is either an inverting block 
(normal) that eventually can "blink". Or it can be like the old hardware cursor
(destructive). The latter is actually a simulation.
.It Fl d
Print out current screen output map.
.It Fl l Ar scrmap
Install screen output map file from
.Ar scrmap
.It Fl L
Install default screen output map.
.It Fl i Ar adapter
Shows info about the current videoadapter.
.It Fl i Ar mode
Shows the possible videomodes with the current video hardware.
.It Fl m Ar on|off
Switch the mousepointer
.Ar on
or
.Ar off .
Used together with the moused
daemon for textmode cut & paste functionality.
.It Fl f Ar size Ar file
Load font
.Ar file
for
.Ar size
(currently, only 8x8, 8x14 or 8x16).
The font file can be either uuencoded or in raw binary format.
.It Fl s Ar number
Set the current vty to
.Ar number .
.It Fl t Ar N|off
Set the screensaver timeout to
.Ar N
seconds, or turns it
.Ar off .
.It Fl x
Use hexadecimal digits for output.
.El
.Ss Video Mode Support
Note that not all modes listed above may be supported by the video
hardware.
You can verify which mode is supported by the video hardware, using the
.Fl i Ar mode
option.
.Pp
The VESA BIOS support must be linked to the kernel
or loaded as a KLD module if you wish to use VESA video modes
or 132 column modes
.Pq see Xr vga 4 .
.Pp
Video modes other than 25 and 30 line modes may require specific size of font.
Use
.Fl f
option above to load a font file to the kernel.
If the required size of font has not been loaded to the kernel,
.Nm
will fail if the user attempts to set a new video mode.
.Pp
.TS
c s
c c
l c.
Video modes and font size
Modes	Font size
25 line modes	8x16 (VGA), 8x14 (EGA)
30 line modes	8x16
43 line modes	8x8
50 line modes	8x8
60 line modes	8x8
.TE
.Pp
It is better to always load all three sizes (8x8, 8x14 and 8x16)
of the same font.
.Pp
You may set
.Ar font8x8 ,
.Ar font8x14 
and
.Ar font8x16
variables in
.Pa /etc/rc.conf.local
to the desired font files so that they will be automatically loaded
when the system starts up.
.Sh FILES
.Bl -tag -width /usr/share/syscons/scrnmaps -compact
.It Pa /usr/share/syscons/fonts
.It Pa /usr/share/syscons/scrnmaps
.El
.Sh SEE ALSO
.Xr kbdcontrol 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr moused 8
.Sh AUTHORS
.An Søren Schmidt Aq sos@FreeBSD.org
