freebsd/freebsd-src/usr.sbin/vidcontrol/vidcontrol.1
.\"
.\" vidcontrol - a utility for manipulating the syscons video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\" $FreeBSD$
.\"
.Dd June 30, 1999
.Dt VIDCONTROL 1
.Os
.Sh NAME
.Nm vidcontrol
.Nd a utility for manipulating the syscons console driver.
.Sh SYNOPSIS
.Nm
.Op Fl b Ar color
.Op Fl c Ar appearance
.Op Fl d
.Op Fl f Oo Ar size Oc Ar \ file
.Op Fl g Ar geometry
.Op Fl i Cm adapter | mode
.Op Fl l Ar screen_map
.Op Fl L
.Op Fl M Ar char
.Op Fl m Cm on | off
.Op Fl r Ar foreground Ar background
.Op Fl s Ar number
.Op Fl t Ar N | Cm off
.Op Fl x
.Op Ar mode
.Op Ar foreground Op Ar background
.Op Cm show
.Sh DESCRIPTION
The
.Nm
command is used to set various options for the 
.Xr syscons 4
console driver,
such as video mode, colors, cursor shape, screen output map, font and screen
saver timeout.
.Pp
The following command line options are supported:
.Bl -tag -width indent
.It Ar mode
Select a new video mode.
The modes currently recognized are:
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x30 ,
.Ar VGA_80x50 ,
.Ar VGA_80x60 ,
.Ar VGA_90x25 ,
.Ar VGA_90x30 ,
.Ar VGA_90x43 ,
.Ar VGA_90x50 ,
.Ar VGA_90x60 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60 .
.\"The graphic mode
.\".Ar VGA_320x200
.\"and
The raster text mode
.Ar VESA_800x600
can also be chosen.
See
.Sx Video Mode Support
below.
.It Ar foreground Op Ar background
Change colors when displaying text.
Specify the foreground color
(e.g.
.Dq vidcontrol white ) ,
or both a foreground and background colors
(e.g.
.Dq vidcontrol yellow blue ) .
Use the
.Cm show
command below to see available colors.
.It Cm show
See the supported colors on a given platform.
.It Fl r Ar foreground background
Change reverse mode colors to
.Ar foreground 
and 
.Ar background .
.It Fl b Ar color
Set border color to 
.Ar color .
This option may not be always supported by the video driver.
.It Fl c Cm normal | blink | destructive
Change the cursor appearance.
The cursor is either an inverting block 
.Pq Cm normal
that eventually can 
.Cm blink .
Or it can be like the old hardware cursor
.Pq Cm destructive .
The latter is actually a simulation.
.It Fl d
Print out current output screen map.
.It Fl l Ar screen_map
Install screen output map file from
.Ar screen_map .
See also
.Xr syscons 4 .
.It Fl L
Install default screen output map.
.It Fl i Cm adapter
Shows info about the current video adapter.
.It Fl i Cm mode
Shows the possible video modes with the current video hardware.
.It Fl M Ar char
Sets the base character used to render the mouse pointer to
.Ar char .
.It Fl m Cm on | off
Switch the mouse pointer
.Cm on
or
.Cm off .
Used together with the 
.Xr moused 8
daemon for text mode cut & paste functionality.
.It Fl f [ Ar size ] Ar file
Load font
.Ar file
for
.Ar size
(currently, only
.Cm 8x8 ,
.Cm 8x14
or
.Cm 8x16 ) .
The font file can be either uuencoded or in raw binary format.
You can also use the menu-driven
.Xr vidfont 1
command to load the font of your choice.
.Pp
.Ar Size
may be omitted, in this case
.Nm
will try to guess it from the size of font file.
.Pp
Note that older video cards, such as MDA and CGA, do not support 
software font.
See also
.Sx Video Mode Support
and
.Sx EXAMPLES
below and the man page for
.Xr syscons 4 .
.It Fl g Ar geometry
Set the
.Ar geometry
of the text mode for the modes with selectable
geometry.  Currently only raster modes, such as
.Ar VESA_800x600 ,
support this option.
See also
.Sx Video Mode Support
and
.Sx EXAMPLES
below.
.It Fl s Ar number
Set the current vty to
.Ar number .
.It Fl t Ar N | Cm off
Set the screensaver timeout to
.Ar N
seconds, or turns it
.Cm off .
.It Fl x
Use hexadecimal digits for output.
.El
.Ss Video Mode Support
Note that not all modes listed above may be supported by the video
hardware.
You can verify which mode is supported by the video hardware, using the
.Fl i Cm mode
option.
.Pp
The VESA BIOS support must be linked to the kernel
or loaded as a KLD module if you wish to use VESA video modes
or 132 column modes
.Pq see Xr vga 4 .
.Pp
You need to compile your kernel with the
.Ar VGA_WIDTH90
option if you wish to use VGA 90 column modes
.Pq see Xr vga 4 .
.Pp
Video modes other than 25 and 30 line modes may require specific size of font.
Use
.Fl f
option above to load a font file to the kernel.
If the required size of font has not been loaded to the kernel,
.Nm
will fail if the user attempts to set a new video mode.
.Pp
.Bl -column "25 line modes" "8x16 (VGA), 8x14 (EGA)" -compact
.Sy Modes Ta Sy Font size
.Li 25 line modes Ta 8x16 (VGA), 8x14 (EGA)
.Li 30 line modes Ta 8x16
.Li 43 line modes Ta 8x8
.Li 50 line modes Ta 8x8
.Li 60 line modes Ta 8x8
.El
.Pp
It is better to always load all three sizes (8x8, 8x14 and 8x16)
of the same font.
.Pp
You may set variables in 
.Pa /etc/rc.conf
or
.Pa /etc/rc.conf.local
so that desired font files will be automatically loaded
when the system starts up.
See below.
.Pp
If you want to use the raster text mode
.Ar VESA_800x600 ,
you need to recomile your kernel with the
.Em SC_PIXEL_MODE
option.  See
.Xr syscons 4
for more details on this kernel option.
.Sh VIDEO OUTPUT CONFIGURATION
.Ss Boot Time Configuration
You may set the following variables in
.Pa /etc/rc.conf
or
.Pa /etc/rc.conf.local
in order to configure the video output at boot time.
.Pp
.Bl -tag -width foo_bar_var -compact 
.It Ar blanktime
Sets the timeout value for the 
.Fl t
option.
.It Ar font8x16 , font8x14 , font8x8
Specifies font files for the
.Fl f
option.
.It Ar scrnmap
Specifies a screen output map file for the
.Fl l
option.
.El 
.Pp 
See 
.Xr rc.conf 5
for more details. 
.Ss Driver Configuration
The video card driver may let you change default configuration
options, such as the default font, so that you do not need to set up
the options at boot time.
See video card driver manuals,
.Pq e.g. Xr vga 4
for details.
.Sh FILES
.Bl -tag -width /usr/share/syscons/scrnmaps/foo-bar -compact
.It Pa /usr/share/syscons/fonts/*
font files.
.It Pa /usr/share/syscons/scrnmaps/*
screen output map files.
.El
.Sh EXAMPLES
If you want to load
.Pa /usr/share/syscons/fonts/iso-8x16.fnt
to the kernel, run
.Nm
as:
.Pp
.Dl vidcontrol -f 8x16 /usr/share/syscons/fonts/iso-8x16.fnt
.Pp
So long as the font file is in
.Pa /usr/share/syscons/fonts ,
you may abbreviate the file name as
.Pa iso-8x16 :
.Pp
.Dl vidcontrol -f 8x16 iso-8x16
.Pp
Furthermore, you can also omit font size
.Dq 8x16 :
.Pp
.Dl vidcontrol -f iso-8x16
.Pp
Likewise, you can also abbreviate the screen output map file name for
the
.Fl l
option if the file is found in
.Pa /usr/share/syscons/scrnmaps .
.Pp
.Dl vidcontrol -l iso-8859-1_to_cp437
.Pp
The above command will load
.Pa /usr/share/syscons/scrnmaps/iso-8859-1_to_cp437.scm .
.Pp
The following command will set-up a 100x37 raster text mode (useful for
some LCD models):
.Pp
.Dl vidcontrol -g 100x37 VESA_800x600
.Sh SEE ALSO
.Xr kbdcontrol 1 ,
.Xr vidfont 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr kldload 8 ,
.Xr moused 8
.Sh AUTHORS
.An S\(/oren Schmidt Aq sos@FreeBSD.org
