freebsd/freebsd-src/usr.sbin/pkgbasify/pkgbasify.8
.\"-
.\" Copyright (c) 2026 Dag-Erling Smørgrav
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 28, 2026
.Dt PKGBASIFY 8
.Os
.Sh NAME
.Nm pkgbasify ,
.Nm depkgbasify
.Nd convert a system to and from pkgbase
.Sh SYNOPSIS
.Nm pkgbasify
.Op Fl hnqtv
.Op Fl a | Fl y
.Op Fl b Ar basedir
.Op Fl j Ar jail
.Op Fl r Ar repo
.Nm depkgbasify
.Op Fl hnqv
.Op Fl a | Fl y
.Op Fl b Ar basedir
.Op Fl j Ar jail
.Sh DESCRIPTION
The
.Nm pkgbasify
utility converts a system installed from distribution sets to packaged
base by registering, without actually installing, a set of packages
that corresponds to what is already installed.
See
.Sx Converting to Packaged Base
below.
.Pp
The
.Nm depkgbasify
utility converts a packaged base system back to distribution sets by
unregistering all base packages.
See
.Sx Converting from Packaged Base
below.
.Pp
In both cases, the user is urged to take a backup or snapshot of the
system and perform a dry run before the actual conversion.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl a
Automatic mode.
Do not prompt the user, but skip certain optional steps.
Mutually exclusive with
.Fl y .
.It Fl b Ar basedir
Operate on a system mounted at
.Ar basedir .
.It Fl h
Print a usage message and exit.
.It Fl j Ar jail
Operate on the specified jail.
.It Fl n
Dry run.
Examine the system and download the necessary files but do not
register or unregister anything.
.It Fl q
Quiet mode.
.It Fl r Ar repo
.Po
.Nm pkgbasify
only
.Pc
Use the specified packaged base repository instead of the default.
.It Fl t
.Po
.Nm pkgbasify
only
.Pc
Trim.
Not yet implemented.
.It Fl v
Verbose mode.
.It Fl y
Assume the answer to every prompt is
.Dq yes .
Mutually exclusive with
.Fl a .
.El
.Ss Converting to Packaged Base
The
.Nm pkgbasify
utility begins by inspecting the system to identify which distribution
sets are installed.
It then downloads and registers the sets of base packages that
correspond to those distribution sets.
If not running in automatic mode, it then performs a forced upgrade
and enables the
.Dv BACKUP_LIBRARIES
options in the
.Xr pkg 8
configuration.
.Pp
It is important to note that after the conversion, files that should
have been present on the system but weren't will still be recorded in
the package database.
This is why a non-automatic
.Nm pkgbasify
offers to perform a forced upgrade: to reset the system to a state
where the files on disk match the recorded inventory.
However, since
.Nm pkgbasify
does not make a backup of the system before converting it, this forced
upgrade is irreversible, which is also why it is skipped in automatic
mode.
.Ss Converting from Packaged Base
The
.Nm depkgbasify
utility begins by identifying the repository from which the base
system was installed.
It then attempts to identify which package sets are partially or
completely installed.
If not running in automatic mode, it will then offer to complete any
partially installed sets, remove the source tree (if installed from
packages), and perform a last upgrade before the conversion.
Finally, it unregisters all remaining base packages without removing
any of the files.
.Ss Round-trip Conversion
When run in automatic mode, neither
.Nm pkgbasify
nor
.Nm depkgbasify
will make any changes to the system that the other cannot undo.
Thus, starting with a system installed from distribution sets and
running
.Ql pkgbasify -a
followed by
.Ql depkgbasify -a
should have a net effect of no changes to the system except for the
package cache.
Conversely, starting with a freshly updated packaged base system and
running
.Ql depkgbasify -a
followed by
.Ql pkgbasify -a
should also have a net zero effect.
.Sh ENVIRONMENT
.Bl -tag -width indent
.It Ev BASEDIR
base directory as if passed to the
.Fl b
option.
.It Ev BASEREPO
repository as if passed to the
.Fl r
option.
.It Ev JAIL
jail id or name as if passed to the
.Fl j
option.
.El
.Sh EXIT STATUS
.Ex -std pkgbasify depkgbasify
.Sh SEE ALSO
.Xr build 7 ,
.Xr pkg 7 ,
.Xr pkgbase 7 ,
.Xr freebsd-update 8 ,
.Xr pkg 8
.Sh HISTORY
The
.Nm pkgbasify
and
.Nm depkgbasify
utilities first appeared in
.Fx 15.2 .
.Sh AUTHORS
The
.Nm pkgbasify
and
.Nm depkgbasify
utilities and this manual page were written by
.An Dag-Erling Sm\(/orgrav Aq Mt des@FreeBSD.org .
.Sh CAVEATS
The
.Nm pkgbasify
utility is intended for use on systems installed from distribution
sets.
It will also work on systems installed from source, but if the system
has been customized through the use of build options, the conversion
will round it back up, so to speak, to the smallest set of
distribution sets which include everything present on the system.
Conversely,
.Nm pkgbasify
will not notice or register elements of the system which are disabled
by default but have been locally enabled, built and installed, unless
installing from a repository that has been built with the same build
options.
.Pp
When converting a system installed from source to packaged base, the
recommended procedure is to build a set of packages from the same
source tree and using the same build options, then configure a
repository pointing to those packages, and perform the conversion
using that repository before switching to another and doing a forced
upgrade.
.Pp
The
.Nm depkgbasify
utility merely unregisters the base packages.
It does not revert the binaries to a state that could have been
produced by an official installation image or
.Xr freebsd-update 8 .
However, if the system was using base packages from the official
.Fx
packaged base repository prior to the conversion, the contents should
match what
.Xr freebsd-update 8
expects.
