freebsd/freebsd-src/lib/libpam/modules/pam_xdg/pam_xdg.8
.\" * SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2024 Beckhoff Automation GmbH & Co. KG
.\"
.\" * Redistribution and use in source and binary forms, with or without
.\" * modification, are permitted provided that the following conditions
.\" * are met:
.\" * 1. Redistributions of source code must retain the above copyright
.\" *    notice, this list of conditions and the following disclaimer.
.\" * 2. Redistributions in binary form must reproduce the above copyright
.\" *    notice, this list of conditions and the following disclaimer in the
.\" *    documentation and/or other materials provided with the distribution.
.\" *
.\" * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" * SUCH DAMAGE.
.Dd August 22, 2024
.Dt PAM_XDG 8
.Os
.Sh NAME
.Nm pam_xdg
.Nd XDG PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_xdg
.Op Ar arguments
.Sh DESCRIPTION
The xdg service module for PAM sets up the runtime directory according
to the XDG specifications.
.Pp
By default the directory is created under
.Pa /var/run/xdg/<username> .
.Pp
The following option may be passed to the authentication module:
.Bl -tag -width ".Cm runtime_dir_prefix"
.It Cm runtime_dir_prefix Ns = Ns Ar directory
Use an alternate base directory
.El
.Sh SEE ALSO
.Xr pam 3 ,
.Xr pam.conf 5
.Sh AUTHORS
The
.Nm
module and this manual page were written by
.An Emmanuel Vadot Aq Mt manu@FreeBSD.org .
