freebsd/freebsd-src/usr.bin/objformat/objformat.1
.\"
.\" Copyright (c) 1998 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 25, 1998
.Os
.Dt OBJFORMAT 1
.Sh NAME
.Nm objformat
.Nd reports default binary format
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
This program os obsolete and is now just a compatability stub.
It reports the object file format as
.Ar elf .
.Sh HISTORY
The
.Nm
command appeared in
.Fx 3.0 .
.Pp
The
.Nm
program was deprecated in
.Fx 4.0
and reduced to a compatability stub in
.Fx 5.0 .
It will be completely removed before the next release.
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was written by
.An Peter Wemm Aq peter@netplex.com.au .
This manual page was written by
.An David O'Brien Aq obrien@NUXI.com .
