freebsd/freebsd-src/share/man/man4/aac.4
.\" Copyright (c) 2000 Scott Long
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.Dd September 24, 2000
.Dt AAC 4
.Os
.Sh NAME
.Nm aac
.Nd Adaptec AdvancedRAID Controller driver
.Sh SYNOPSIS
.Cd options AAC_COMPAT_LINUX
.Cd options AAC_DEBUG=N
.Cd device pci
.Cd device aac
.Sh DESCRIPTION
The 
.Nm
driver provides support for the Adaptec AAC family SCSI Ultra2 and Ultra160
RAID controllers.  
These controllers support RAID 0, 1, 5, 10, and volume sets.
They have four channels in the add-in version
or 1-2 channels in the motherboard integrated version,
and are most often found relabelled by Dell or Hewlett-Packard.
Supported controllers include:
.Bl -bullet
.It
AAC-364
.It
AAC-3642
.It
HP NetRAID 4M
.It
Dell PERC 2/Si
.It
Dell PERC 2/QC
.It
Dell PERC 3/Si
.It
Dell PERC 3/Di
.Pp
.El
Access to RAID containers is available via the
.Pa /dev/aacd?
device nodes.
Individual drives cannot be accessed 
unless they are part of a container or volume set,
and non-fixed disks cannot be accessed.  
Containers can be configured by using
either the on-board BIOS utility of the card, 
or a Linux-based management application.
.Pp
The
.Pa /dev/aac?
device nodes provides access to the management interface of the controller.  
One node exists per installed card.
Compiling the driver with the
.Dv AAC_COMPAT_LINUX
option enables the Linux-compatible 
.Xr ioctl 2
interface for the management device.  
The 
.Xr ioctl 2 
command set is heavily tailored to existing linux applications.  
Native
.Xr ioctl 2 
support is not present at this time.
.Sh FILES
.Bl -tag -width /boot/kernel/aac.ko -compact
.It Pa /dev/aac?
aac management interface
.It Pa /dev/aacd?
disk/container interface
.It Pa /boot/kernel/aac.ko
aac loadable module
.El
.Sh DIAGNOSTICS
Compiling with
.Dv AAC_DEBUG
set to a number between 0 and 3 
will enable increasingly verbose debug messages.
.Pp
The adapter can send status and alert messages asynchronously 
to the driver.  These messages are printed on the system console,
and are also queued for retrieval by a management application.
.Sh SEE ALSO
.Xr kld 4 ,
.Xr linux 4,
.Xr kldload 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 5.0
and is
.Ud
.Pp
.Sh AUTHORS
.An Mike Smith
.Aq msmith@freebsd.org
.An Scott Long
.Aq scottl@freebsd.org
.Sh BUGS
This driver has not been tested on Alpha, though it should work.
.Pp
The controller is not actually paused on suspend/resume.  
.Pp
Adapter-initiated messages are not returned back to the controller, 
possibly causing a resource leak on the controller.
.Pp
Unloading and reloading the driver as a kernel loadable module
without rebooting the system is strongly discouraged.
.Pp
Only the Linux-compatible 
.Xr ioctl 2 
interface is implemented at this time.
This is not a bug, but native
.Xr ioctl 2
support is desirable.
