freebsd/freebsd-src/share/man/man4/acpi_thermal.4
.\"
.\" Copyright (c) 2003 Takanori Watanabe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd December 27, 2003
.Dt ACPI_THERMAL 4
.Os
.Sh NAME
.Nm acpi_thermal
.Nd ACPI Thermal Management support subsystem
.Sh SYNOPSIS
.Cd "device acpi"
.Sh DESCRIPTION
The
.Nm
driver provides ACPI thermal handling feature as part of the
ACPI module.
This module has the
.Xr sysctl 8
interface and the
.Xr devd 8
notification interface.
Sysctls export ACPI objects as is.
The
.Nm
driver also activates active cooling system in accordance with appropriate
ACPI object.
.Sh SYSCTLS
.Bl -tag -width indent
.It Va hw.acpi.thermal.tz%d.active
Current active system running state.
.It Va hw.acpi.thermal.tz%d.thermal_flags
Current thermal zone status.
These are bit-masked values.
.It Va hw.acpi.thermal.tz%d.temperature
Current temperature.
.It Va hw.acpi.thermal.tz%d._PSV
Temperature to start passive cooling by throttling down CPU, etc.
.It Va hw.acpi.thermal.tz%d._HOT
Temperature to start critical suspend to disk.
.It Va hw.acpi.thermal.tz%d._CRT
Temperature to start critical shutdown.
.It Va hw.acpi.thermal.tz%d._ACx
Active cooling start values.
The earlier value means the strengest
active cooling temperature.
.El
.Pp
All temperatures are represented in tenths of Kelvins.
For example, 300.0K is represented by the integer 3000.
To convert to Centigrades,
the formula is
.Li "(x - 2731.5) / 10" .
.Sh NOTIFIES
Notifies are passed as strings beginning with
.Qq Li "!system=ACPI subsystem=Thermal" ,
the thermal zone instance is distingushed by
the ACPI object path in the
.Qq Li type=
argument.
The notify value is passed in the
.Qq Li notify=
argument.
.Pp
.Bl -tag -width indent -compact
.It Li 0x80
Temperature change.
.It Li 0x81
Trip point change.
.It Li 0x82
Device Lists change.
.El
.Sh SEE ALSO
.Xr acpi 4
.Rs
.%A "Compaq Computer Corporation"
.%A "Intel Corporation"
.%A "Microsoft Corporation"
.%A "Phoenix Technologies Ltd."
.%A "Toshiba Corporation"
.%D August 25, 2003
.%T "Advanced Configuration and Power Interface Specification"
.%O http://acpi.info/spec.htm
.Re
.Sh AUTHORS
.An -nosplit
.An Michael Smith
.Pp
This manual page was written by
.An Takanori Watanabe .
