freebsd/freebsd-src/share/man/man4/acpi_asus.4
.\"-
.\" Copyright (c) 2008 Rui Paulo <rpaulo@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd August 19, 2008
.Dt ACPI_ASUS 4
.Os
.Sh NAME
.Nm acpi_asus
.Nd ASUSTeK extras device driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device acpi_asus"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
acpi_asus_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver adds support for controlling extra features of some ASUSTeK
laptops, namely hotkeys, LEDs, LCD brightness, wireless LAN state, among
others.
.Pp
The current supported models are:
.Pp
.Bl -bullet -offset indent -compact
.It
xxN
.It
A1x
.It
A2x
.It
A3N
.It
A4D
.It
A6V
.It
D1x
.It
G2K
.It
L2D
.It
L3C
.It
L3D
.It
L3H
.It
L4R
.It
L5x
.It
L8L
.It
M1A
.It
M2E
.It
M6N
.It
M6R
.It
S2X
.It
V6V
.It
W5A
.It
Eee PC
.It
Samsumg P30/P35
.El
.Pp
All configuration is done via
.Xr sysctl 8
under the device tree, i.e.,
.Va dev.acpi_asus .
.Pp
The driver sends hotkey notifications via
.Xr devd 8 .
You should configure your
.Pa /etc/devd.conf
to suit your needs.
For an example, see the Eee PC entries already present in the system
supplied
.Pa devd.conf .
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr devd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Xr acpi_asus 4
driver was written by
.An Philip Paeps Aq philip@FreeBSD.org .
This manual page was written by
.An Rui Paulo Aq rpaulo@FreeBSD.org .
