freebsd/freebsd-src/share/man/man4/ahb.4
.\"
.\" Copyright (c) 1994 Wilko Bulte
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd August 31, 1994
.Dt AHB 4 i386
.Os FreeBSD
.Sh NAME
.Nm ahb
.Nd
Adaptec EISA SCSI host adapter driver
.Sh SYNOPSIS
.Cd "controller ahb0 at isa? bio irq 11 vector ahbintr
.Cd "controller scbus0
.sp
For each disk:
.Cd "device sd0
.sp
For each tape device:
.Cd "device st0
.sp
For one or more cdroms:
.Cd "device cd0
.Sh DESCRIPTION
This driver provides access to SCSI devices connected to an Adaptec 
174x hostadapter in either Standard or Enhanced Mode. If the controller
is set to Standard mode (by the ECU), the driver will automatically 
switch the card to Enhanced mode during the device probe.
.sp
Please note that the above implies that when you are configuring a system
with both aha and ahb drivers, the ahb driver should be listed first in the
kernel config file. This ensures that the ahb driver will find the Adaptec 174x
boards before the aha driver probes for Adaptec 154x boards.
.sp
Note that no I/O addresses are configured in the kernel config file. The
174x uses EISA slot specific I/O which is configured automatically.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /sys/i386/isa/ahb.c
driver source
.It Pa /sys/i386/conf/GENERICAH
sample generic kernel config file for Adaptec based systems
.El
.Sh SEE ALSO
.Xr aha 4
.Xr cd 4
.Xr scsi 4
.Xr sd 4
.Xr st 4
.Sh NOTE
The ahb driver does not support the newer Adaptec 274x boards. This
is because Adaptec refuses to supply programming information without
a non-disclosure agreement.
