freebsd/freebsd-src/share/man/man4/amr.4
.\"
.\" Copyright (c) 2000 Jeroen Ruigrok van der Werven
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/amr.4,v 1.3 2000/01/24 19:34:47 asmodai Exp $
.\"
.Dd Jan 23, 2000
.Dt AMR 4
.Os
.Sh NAME
.Nm amr
.Nd AMI MegaRAID SCSI driver
.Sh SYNOPSIS
.Cd device pci
.Cd device amr
.Sh DESCRIPTION
The
.Nm
driver provides support for the American Megatrend MegaRAID Express
and Enterprise SCSI RAID controllers.
.Pp
This driver will also work for certain models of the Dell PERC RAID
controller series and possible other AMI relicensed RAID controllers.
.Sh SEE ALSO
.Xr da 4 ,
.Xr intro 4 ,
.Xr scsi 4
.Sh AUTHORS
The amr driver was written by
.An Mike Smith
.Aq msmith@freebsd.org .
.Pp
This manual page was written by
.An Jeroen Ruigrok van der Werven
.Aq asmodai@freebsd.org .
