freebsd/freebsd-src/share/man/man4/amr.4
.\"
.\" Copyright (c) 2000 Jeroen Ruigrok van der Werven
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/amr.4,v 1.3.2.3 2000/06/08 13:31:20 asmodai Exp $
.\"
.Dd Jan 23, 2000
.Dt AMR 4
.Os
.Sh NAME
.Nm amr
.Nd AMI MegaRAID PCI-SCSI RAID driver
.Sh SYNOPSIS
.Cd device pci
.Cd device amr
.Sh DESCRIPTION
The
.Nm
driver provides support for American Megatrends MegaRAID Express,
Elite and Enterprise family SCSI RAID controllers,
including models relabelled and sold by Hewlett Packard and Dell.
Supported controllers include:
.Bl -bullet
.It
MegaRAID 418
.It
MegaRAID Enterprise 1200 (428)
.It
MegaRAID Enterprise 1300
.It
MegaRAID Enterprise 1400
.It
MegaRAID Enterprise 1500
.It
MegaRAID Elite 1500
.It
MegaRAID Express 300
.It
Dell PERC
.It
Dell PERC 2/SC
.It
Dell PERC 2/DC
.It
HP NetRAID (all models are believed to work)
.El
.Pp
Compatible AMI controllers not listed should work,
but have not been tested.
.Sh DIAGNOSTICS
Driver initialisation/shutdown phase:
.Bl -diag
.It amr%d: memory window not available
.It amr%d: I/O window not available
.El
.Pp
The PCI BIOS did not allocate resources necessary for the correct operation of
the controller.
The driver cannot attach to this controller.
.Bl -diag
.It amr%d: busmaster bit not set, enabling
.El
.Pp
The PCI BIOS did not enable busmaster DMA,
which is required for the correct operation of the controller.
The driver has enabled this bit and initialisation will proceed.
.Bl -diag
.It amr%d: can't allocate register window
.It amr%d: can't allocate parent DMA tag
.It amr%d: can't allocate scatter/gather DMA tag
.It amr%d: can't allocate s/g table
.It amr%d: can't allocate mailbox tag
.It amr%d: can't allocate mailbox memory
.It amr%d: can't allocate interrupt
.It amr%d: can't set up interrupt
.It amr%d: can't allocate buffer DMA tag
.El
.Pp
A resource allocation error occurred while initialising the driver;
initialisation has failed and the driver will not attach to this controller.
.Bl -diag
.It amr%d: can't obtain configuration data from controller
.El
.Pp
The driver was unable to obtain vital configuration data from the controller.
Initialisation has failed and the driver will not attach to this controller.
.Bl -diag
.It amr%d: controller supports 40ld but CONFIG_PRODINFO failed
.It amr%d: 40LD firmware unsupported; send controller to msmith@freebsd.org
.El
.Pp
This controller provides a firmware interface that is currently unsupported.
Please contact the AUTHOR to determine status of support for this controller.
.Bl -diag
.It amr%d: can't scan controller for drives
.El
.Pp
The scan for logical drives managed by the controller failed.
No drives will be attached.
.Bl -diag
.It amr%d: device_add_child failed
.It amr%d: bus_generic_attach returned %d
.El
.Pp
Creation of the logical drive instances failed;
attachment of one or more logical drives may have been aborted.
.Bl -diag
.It amrd%d: still open, can't shutdown
.El
.Pp
The logical drive indicated is still open,
and the driver cannot shut down.
.Bl -diag
.It amr%d: flushing cache...
.El
.Pp
The controller cache is being flushed prior to shutdown or detach.
.Pp
Operational diagnostics:
.Bl -diag
.It amr%d: I/O beyond end of unit (%u,%d > %u)
.El
.Pp
A partitioning error or disk corruption has caused an I/O request
beyond the end of the logical drive.
This may also occur if FlexRAID Virtual Sizing is enabled and
an I/O operation is attempted on a portion of the virtual drive
beyond the actual capacity available.
.Bl -diag
.It amr%d: I/O error - %x
.El
.Pp
An I/O error has occurred.
.Bl -diag
.It amr%d: controller wedged (not taking commands)
.El
.Pp
The controller is not responding to commands.
.Sh AUTHORS
The amr driver was written by
.An Mike Smith
.Aq msmith@FreeBSD.org .
.Pp
This manual page was written by
.An Mike Smith
.Aq msmith@FreeBSD.org
and
.An Jeroen Ruigrok van der Werven
.Aq asmodai@FreeBSD.org .
