freebsd/freebsd-src/share/man/man4/arcmsr.4
.\" Copyright (c) 2005 Scott Long
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 31, 2005
.Dt ARCMSR 4
.Os
.Sh NAME
.Nm arcmsr
.Nd Areca SATA II RAID Controller driver
.Sh SYNOPSIS
.Cd "device arcmsr"
.Cd "device pci"
.Cd "device scbus"
.Cd "device da"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Areca ARC-11xx and ARC-12xx series of SATA II
RAID controllers.
These controllers feature RAID-0, 1, 3, 5, 6, and 10 and
JBOD acceleration for up to 16 SATA drives.
Raid level and stripe level
migration, online capacity expansion, hot insertion/removal, automatic failover
and rebuild, and SMART are also supported.
Access to the arrays is provided
via the SCSI CAM
.Pa /dev/da?
device nodes.
A management interface is also present via the
.Pa /dev/arcmsr?
device node.  Management tools for i386 and amd64 are available from Areca.
.Sh HARDWARE
The following card are supported at this time:
.Pp
.Bl -bullet -compact
.It
ARC-1110
.It
ARC-1120
.It
ARC-1130
.It
ARC-1160
.It
ARC-1130-ML
.It
ARC-1160-ML
.It
ARC-1210
.It
ARC-1220
.It
ARC-1230
.It
ARC-1260
.It
ARC-1230-ML
.It
ARC-1260-ML
.El
.Sh FILES
.Bl -tag -width ".Pa /boot/kernel/arcmsr.ko" -compact
.It Pa /dev/da?
Array block device
.It Pa /dev/arcmsr?
Management interface
.It Pa /boot/kernel/arcmsr.ko
Loadable module
.El
.Sh SEE ALSO
.Xr da 4 ,
.Xr scbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 5.4 .
.Sh AUTHORS
The driver was written by
.An Erich Chen Aq erich@areca.com.tw .
.Sh BUGS
The driver has been tested on i386 and amd64.
It likely requires additional
work to function on big-endian architectures.
