freebsd/freebsd-src/share/man/man4/arswitch.4
.\"-
.\" Copyright (c) 2021 Felix Johnson <felix.the.red@gmail.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 19, 2021
.Dt ARSWITCH 4
.Os
.Sh NAME
.Nm arswitch
.Nd driver for Atheros Fast Ethernet switch
.Sh SYNOPSIS
.Cd "device mdio"
.Cd "device etherswitch"
.Cd "device arswitch"
.Sh DESCRIPTION
The
.Nm
device driver provides a management interface to multiple Atheros
fast ethernet switch chips:
.Bl -tag -compact -width "AR7240"
.It AR7240
Wireless Network Processor SOC with five Fast Ethernet PHYs
.It AR8216
Fast Ethernet Switch
.It AR8226
.It AR8316
Six-port Gigabit Ethernet Switch
.It AR8327
Seven-port Gigabit Ethernet Switch
.It AR9340
Wireless networking SoC
.El
.Pp
The driver uses an
.Xr mdio 4
or
.Xr miibus 4
interface to configure the ethernet interface.
.Pp
This driver supports port based vlan, and
IEEE 802.1Q (QinQ).
These options can be configured with the
.Xr etherswitchcfg 8
command.
.Nm
supports
.Dv addtag ,
.Dv striptag ,
and
.Dv doubletag .
.Dv addtag
and
.Dv striptag
are mutually exclusive.
.Pp
Setting the switch MAC address is not supported.
.Sh SEE ALSO
.Xr etherswitch 4 ,
.Xr etherswitchcfg 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 12.0 .
.Sh AUTHORS
The
.Nm
manual was written by
.An Felix Johnson .
