freebsd/freebsd-src/share/man/man4/arswitch.4
.\"-
.\" Copyright (c) 2021 Felix Johnson <felix.the.red@gmail.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 11, 2025
.Dt ARSWITCH 4
.Os
.Sh NAME
.Nm arswitch
.Nd Atheros AR8000 series Ethernet switch driver
.Sh SYNOPSIS
.Cd "device mdio"
.Cd "device etherswitch"
.Cd "device arswitch"
.Sh DESCRIPTION
The
.Nm
driver provides a management interface to Atheros AR8000 series Ethernet
switch controllers.
The driver uses an
.Xr mdio 4
or
.Xr miibus 4
interface to configure the ethernet interface.
.Pp
This driver supports port based vlan, and
IEEE 802.1Q (QinQ).
These options can be configured with the
.Xr etherswitchcfg 8
command.
.Nm
supports
.Dv addtag ,
.Dv striptag ,
and
.Dv doubletag .
.Dv addtag
and
.Dv striptag
are mutually exclusive.
.Pp
Setting the switch MAC address is not supported.
.Sh HARDWARE
The
.Nm
driver supports the following Ethernet switch controllers:
.Pp
.Bl -bullet -compact
.It
Atheros AR8327 Seven-port Gigabit Ethernet Switch
.It
Atheros AR8316 Six-port Gigabit Ethernet Switch
.It
Atheros AR8236 Six-port Fast Ethernet Switch
.It
Atheros AR8226 Six-port Fast Ethernet Switch
.It
Atheros AR8216 Six-port Fast Ethernet Switch
.El
.Sh SEE ALSO
.Xr etherswitch 4 ,
.Xr etherswitchcfg 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 12.0 .
.Sh AUTHORS
The
.Nm
manual was written by
.An Felix Johnson .
