freebsd/freebsd-src/share/man/man4/ath_hal.4
.\"-
.\" Copyright (c) 2002, 2003 Sam Leffler, Errno Consulting
.\" All rights reserved.
.\""
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer,
.\"    without modification.
.\" 2. Redistributions in binary form must reproduce at minimum a disclaimer
.\"    similar to the "NO WARRANTY" disclaimer below ("Disclaimer") and any
.\"    redistribution must be conditioned upon including a substantially
.\"    similar Disclaimer requirement for further binary redistribution.
.\" 3. Neither the names of the above-listed copyright holders nor the names
.\"    of any contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" NO WARRANTY
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF NONINFRINGEMENT, MERCHANTIBILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
.\" THE COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR SPECIAL, EXEMPLARY,
.\" OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGES.
.\"
.\" $FreeBSD$
.\"/
.Dd June 23, 2003
.Dt ATH_HAL 4
.Os
.Sh NAME
.Nm ath_hal
.Nd "Atheros Hardware Access Layer (HAL)"
.Sh SYNOPSIS
.Cd "device ath_hal"
.Sh DESCRIPTION
The
.Nm
module provides hardware support for wireless network adapters based on
the Atheros AR5210, AR5211, and AR5212 chips.
This module is required by the
.Xr ath 4
driver.
.Pp
Devices supported by the
.Nm
module come in either Cardbus or mini-PCI packages.
The following cards are among those supported by the
.Nm
module:
.Pp
.Bl -column -compact "Samsung SWL-5200N" "AR5212" "Cardbus" "a/b/g"
.Em "Card	Chip	Bus	Standard"
Aztech WL830PC	AR5212	CardBus	b/g
D-Link DWL-A650	AR5210	CardBus	a
D-Link DWL-AB650	AR5211	CardBus	a/b
D-Link DWL-A520	AR5210	PCI	a
D-Link DWL-AG520	AR5212	PCI	a/b/g
D-Link DWL-AG650	AR5212	CardBus	a/b/g
D-Link DWL-G520B	AR5212	PCI	b/g
D-Link DWL-G650B	AR5212	CardBus	b/g
Elecom LD-WL54AG	AR5212	Cardbus	a/b/g
Elecom LD-WL54	AR5211	Cardbus	a
Fujitsu E5454	AR5212	Cardbus	a/b/g
Fujitsu FMV-JW481	AR5212	Cardbus	a/b/g
Fujitsu E5454	AR5212	Cardbus	a/b/g
HP NC4000	AR5212	PCI	a/b/g
I/O Data WN-AB	AR5212	CardBus	a/b
I/O Data WN-AG	AR5212	CardBus	a/b/g
I/O Data WN-A54	AR5212	CardBus	a
Linksys WMP55AG	AR5212	PCI	a/b/g
Linksys WPC51AB	AR5211	CardBus	a/b
Linksys WPC55AG	AR5212	CardBus	a/b/g
NEC PA-WL/54AG	AR5212	CardBus	a/b/g
Netgear WAG311	AR5212	PCI	a/b/g
Netgear WAB501	AR5211	CardBus	a/b
Netgear WAG511	AR5212	CardBus	a/b/g
Netgear WG311	AR5212	PCI	b/g
Netgear WG511T	AR5212	PCI	b/g
Orinoco 8480	AR5212	CardBus	a/b/g
Orinoco 8470WD	AR5212	CardBus	a/b/g
Proxim Skyline 4030	AR5210	CardBus	a
Proxim Skyline 4032	AR5210	PCI	a
Samsung SWL-5200N	AR5212	CardBus	a/b/g
SMC SMC2735W	AR5210	CardBus	a
Sony PCWA-C700	AR5212	Cardbus	a/b
Sony PCWA-C300S	AR5212	Cardbus	b/g
Sony PCWA-C500	AR5210	Cardbus	a
3Com 3CRPAG175	AR5212	CardBus	a/b/g
.El
.Pp
An up to date list can be found at
.Pa http://customerproducts.atheros.com/customerproducts .
.Sh SEE ALSO
.Xr ath 4
.Re
.Sh HISTORY
The
.Nm
module first appeared in
.Fx 5.2 .
.Sh CAVEATS
The
.Nm
module is constructed from a binary component and
operating system-dependent source code.
Redistribution and use in source and binary forms, without
modification, are permitted provided that the conditions
set forth in
.Pa sys/contrib/dev/ath/COPYRIGHT
are observed.
.Sh BUGS
See
.Xr ath 4
for known bugs.
