freebsd/freebsd-src/share/man/man4/enic.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright 2008-2017 Cisco Systems, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY AUTHOR AND CONTRIBUTORS `AS IS' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 17, 2026
.Dt ENIC 4
.Os
.Sh NAME
.Nm enic
.Nd Cisco VIC Ethernet driver
.Sh SYNOPSIS
.Cd device iflib
.Cd device enic
.Pp
In
.Xr loader.conf 5 :
.Cd if_enic_load="YES"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Cisco Virtual Interface Card.
Support is limited to basic network connectivity.
Media is controlled by the NIC itself since there can be multiple
virtual PCI NIC devices exposed to the PCI bus.
.Sh HARDWARE
The
.Nm
driver supports all known Cisco VIC Ethernet cards.
.Sh CONFIGURATION
The
.Nm
network interface is configured using
.Xr ifconfig 8
and the
.Xr sysctl 8
tree at
.Va dev.enic.%d .
All configurable entries are also tunables, and can be put directly into the
.Xr loader.conf 5
for persistent configuration.
.Sh SEE ALSO
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 14.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Cisco UCS team
based on the DPDK driver.
