freebsd/freebsd-src/share/man/man4/epair.4
.\"-
.\" Copyright (c) 2008 The FreeBSD Foundation
.\"
.\" This software was developed by CK Software GmbH under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\" notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\" notice, this list of conditions and the following disclaimer in the
.\" documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 4, 2025
.Dt EPAIR 4
.Os
.Sh NAME
.Nm epair
.Nd A pair of virtual back-to-back connected Ethernet interfaces
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device epair"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_epair_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
is a pair of Ethernet-like software interfaces,
which are connected back-to-back with a virtual cross-over cable.
.Pp
Each
.Nm
interface pair is created at runtime using interface cloning.
This is most easily done with the
.Xr ifconfig 8
.Cm create
command or using the
.Va cloned_interfaces
variable in
.Xr rc.conf 5 .
While for cloning you only give either
.Pa epair
or
.Pa epair<n>
the
.Nm
pair will be named like
.Pa epair<n>[ab] .
This means the names of the first
.Nm
interfaces will be
.Pa epair0a
and
.Pa epair0b .
.Pp
Like any other Ethernet interface, an
.Nm
needs to have a network address.
If the tunable
.Va net.link.epair.ether_gen_addr Ns
=0, each
.Nm
will be assigned a random locally administered address,
that is only guaranteed to be unique within one network stack.
The tunable
.Va net.link.epair.ether_gen_addr Ns
=1 will generate a stable MAC address with
.Fx
OUI using
.Xr ether_gen_addr 9 .
This tunable defaults to 1 in
.Fx 15.0 and might be removed in
.Fx 16.0 .
To change the default addresses one may use the SIOCSIFADDR
.Xr ioctl 2 or
.Xr ifconfig 8 utility.
.Pp
The basic intent is to provide connectivity between two virtual
network stack instances.
When connected to an
.Xr if_bridge 4 ,
one end of the interface pair can also be part of another (virtual) LAN.
As with any other Ethernet interface,
.Nm epair
can have a
.Xr vlan 4
configured on top of it.
.Pp
The
.Nm
has RXCSUM and RXCSUM6 enabled because it may receive a packet where the
checksum has already been validated by a physical interface.
The
.Nm
supports TXCSUM and TXCSUM6 for TCP and UDP, but only by forwarding the order
to compute the checksum.
Thus, when using an
.Nm
interface, a TCP or UDP sender can offload checksum computation
to a physical interface.
Note that, in case the packet does not leave the host, the checksum is
unnecessary and will be ignored if offloaded.
Such packets contain an incorrect checksum, since it is not computed yet.
TXCSUM and TXCSUM6 are synchronized between the
.Nm
interface pair (i.e., enabling/disabling the capability on one end
enables/disables it on the other end).
In case one end is in a bridge and the bridge disabled TXCSUM or TXCSUM6,
this avoids a sender to send packets with checksum offloading into the
bridge by using the other end.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr altq 4 ,
.Xr bpf 4 ,
.Xr if_bridge 4 ,
.Xr vlan 4 ,
.Xr loader.conf 5 ,
.Xr rc.conf 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
interface first appeared in
.Fx 8.0 .
.Sh AUTHORS
The
.Nm
interface was written by
.An Bjoern A. Zeeb, CK Software GmbH,
under sponsorship from the FreeBSD Foundation.
