freebsd/freebsd-src/share/man/man4/esp.4
.\"
.\" Copyright (c) 2004 Tom Rhodes
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd June 21, 2004
.Dt ESP 4
.Os
.Sh NAME
.Nm esp
.Nd Qlogic FEPS and FAS366 SCSI driver
.Sh SYNOPSIS
.Cd device scbus
.Cd device esp
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Qlogic
FAS216 and FAS408
.Tn SCSI
controller chips found in a wide variety of systems and peripheral boards.
This includes the
.Tn Qlogic
.Tn SCSI
cards found in most
.Tn Sun
.Tn Ultra 1e
and
.Tn Ultra 2
machines.
.Pp
For
.Tn Qlogic
.Tn PCI
.Tn SCSI
host adapters, the
.Xr isp 4
driver should be used in place of the
.Nm
driver.
.Sh IMPLEMENTATION NOTES
During the boot sequence, the
.Nm
driver
searches the linked list for LUN info by LUN ID.
At this point the driver will attach on that instance,
and then attempt to attach every sub-device.
.Pp
There are at least 4 variations of the
configuration 3 register.
A second config register must be loaded to inquire the chip revision,
otherwise the
.Fn ncr53c9x_reset
function will not set the defaults correctly.
.Pp
The drive attach routine attempts to set the appropriate
bit to put the chip into Fast
.Tn SCSI
mode so that it does not
have to be figured out each time.
This will then be stored in the
.Tn NCR
registers for later use.
.Pp
The
.Nm
driver makes use of the
.Tn LSI
64854
.Tn DMA
engine which contains three independent
channels designed to interface with
an NCR539X
.Tn SCSI
controller;
an AM7990 Ethernet controller;
and certain types of parallel port hardware.
As such this driver may eventually replace the
.Xr amd 4
driver for network hardware.
.Pp
.Sh ERRORS
The following driver specific error messages
may be reported:
.Bl -tag -width Er
.It Bq Er EINVAL
May be returned if the driver cannot detach or reset
the state and/or bus.
.It Bq Er ENOMEM
Might be returned if the driver cannot allocate
parent
.Tn DMA
tag, or if the device is out of memory.
.It Bq Er ENXIO
May be returned if the driver cannot map
.Tn DMA
registers.
This error may also be returned if the driver is
unable to map the
.Tn SCSI
core registers.
.El
.Sh SEE ALSO
.Xr amd 4 ,
.Xr isp 4 ,
.Xr scbus 4 ,
.Xr camcontrol 8
.Pp
.Pa http://www.qlc.com/
.br
.Pa http://www.sun.com/
.Sh HISTORY
The
.Nm
driver was written for
.Nx
by
.An Eric S. Hvozda.
The
.Nm
driver was then ported to
.Fx 5.3
by
.An Scott Long Aq scottl@FreeBSD.org .
.Sh AUTHORS
This manual page was written by
.An Tom Rhodes Aq trhodes@FreeBSD.org
instead of porting the original from
.Nx .
.Sh BUGS
The
.Nm
driver includes the sbus front-end but lacks the
.Tn PCI
front-end.
Thus it can only support the
.Tn FEPS/FAS366
.Tn SCSI
found in
.Tn Sun
.Tn Ultra 1e
and
.Tn Ultra 2
machines at this time.
.Pp
This driver should eventually replace the
.Xr amd 4
driver, but that requires porting the
.Tn PCI
front-end mentioned above.
