freebsd/freebsd-src/share/man/man4/fwe.4
.\" Copyright (c) 2002 Hidetoshi Shimokawa
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\" 
.\" $FreeBSD$
.\"
.\"
.Dd November 8, 2002
.Dt FWE 4
.Os
.Sh NAME
.Nm fwe
.Nd Ethernet Emulation Driver for FireWire
.Sh SYNOPSIS
.Cd "device fwe"
.Cd "device firewire"
.Cd "device fwohci"
.Sh DESCRIPTION
The
.Nm
driver provides non-standard ethernet emulation over FireWire(IEEE1394).
.Pp
.Nm firewire
and 
.Nm fwohci
must be configured in the kernel as well.
.Pp
This driver exploits asynchronous stream over IEEE1394 to carry Ethernet
frames. The stream channel can be specified by
.Nm sysctl(8)
(hw.firewire.fwe.stream_ch).
.Pp
This driver supports polling(4) as well if it's compiled with
DEVICE_POLLING option.
.Sh HISTORY
The fwe device driver first appeared in FreeBSD 5.0.
.Sh BUGS
This driver emulates ethernet very adhoc way and it doesn't reserve a stream channel using an isochronous manager.
Note this driver uses very different protocol from RFC2734(IPv4 over IEEE 1394).
.Sh SEE ALSO
.Xr arp 4 ,
.Xr firewire 4 ,
.Xr fwohci 4 ,
.Xr netintro 4 ,
.Xr ng_ether 4 ,
.Xr polling 4 ,
.Xr ifconfig 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Hidetoshi Shimokawa .
.Pp
This manual page was written by
.An Hidetoshi Shimokawa .
