freebsd/freebsd-src/share/man/man4/hfa.4
.\"
.\" Copyright (c) 2004 Tom Rhodes
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd August 06, 2004
.Dt HFA 4
.Os
.Sh NAME
.Nm hfa
.Nd FORE Systems 200-Series ATM adapter driver
.Sh SYNOPSIS
.Cd device hfa
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn FORE
Systems
.Tn ATM
series 200 adapters.
This driver will support up to eight devices in a system
at any given time.
The
.Nm
driver follows the
.Tn AALI
or
.Tn FORE
.Tn ATM
Adaptation Layer Interface and as such
will adhere to its specifications.
The supported
.Tn AALs
include:
.Bl -bullet
.It
FORE AAL 0:
The cell service;
.It
FORE AAL 4:
Version three and four of AAL;
.It
FORE AAL 5:
Version five of AAL.
.El
.Pp
The
.Nm
driver supports traffic shaping for cards with firmware
revisions of 4.X.X, see
.Xr fore_dnld 8 .
The following sysctls are recognized by the driver and
may be used to enable or disable traffic shaping:
.Bl -tag -width indent
.It Va hw.atm.hfaN.shape=0
Disable shaping on card number N.
.It Va hw.atm.hfaN.shape=1
Set one VCI to be traffic shaped on device N.
This will shape the first CBR VCI which is opened.
.It Va hw.atm.hfaN.shape=2
Attempt to shape all VCIs on device N.
.El
.Pp
The firmware should be loaded before using this
driver, this can be an easy task if the
.Xr fore_dnld 8
utility is used.
If the
.Pa /etc/rc.d/atm1
file has been properly configured then the firmware
update should be automatic.
.Sh HARDWARE
The following devices are currently supported:
.Pp
.Bl -bullet
.It
FORE Systems PCA-200E ATM
.It
FORE Systems 200S
.It
FORE Systems 200
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "fore_cmd_drain: %s%d: GET_PROM failed"
The driver failed to drain the PROM buffer.
.It "fore initialization failed: intf=%s%d"
Initialization of the card has failed.
.It "fore initialization timed out: intf=%s%d"
Initialization of the card has timed out.
.It "hfa: version mismatch: fore=%d.%d kernel=%d.%d"
A version mismatch error has occurred.
.El
.Sh SEE ALSO
.Xr harp 4 ,
.Xr ng_atm 4 ,
.Xr watchdog 4 ,
.Xr atm 8 ,
.Xr fore_dnld 8
.Sh HISTORY
The
.Nm
driver
first appeared in
.Fx 3.0 .
This manual page first appeared in
.Fx 5.3 .
.Sh AUTHORS
This manual page was written by
.An Tom Rhodes Aq trhodes@FreeBSD.org .
