freebsd/freebsd-src/share/man/man4/hgame.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2020 Vladimir Kondratyev <wulf@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 30, 2025
.Dt HGAME 4
.Os
.Sh NAME
.Nm hgame
.Nd generic HID gamepad, joystick, and controller evdev driver
.Sh SYNOPSIS
.Cd device hgame
.Cd device hid
.Cd device hidbus
.Cd device hidmap
.Cd device evdev
.Pp
In
.Xr sysctl.conf 5 :
.Cd dev.hgame.X.debug
.Pp
In
.Xr loader.conf 5 :
.Cd hw.hid.hgame.debug
.Cd hgame_load
.Sh DESCRIPTION
The
.Nm
driver supports generic game controllers
that attach to the HID transport backend,
and presents them to applications over the
.Sy evdev
interface.
.Pp
If the appropriate hardware is detected,
the driver will be loaded automatically by
.Xr devmatch 8 .
To load the driver manually at boot time, set the
.Va hgame_load
variable to
.Ar YES
at the
.Xr loader 8
prompt, or add it to
.Xr loader.conf 5 .
.Pp
To give user applications access to the game controllers,
allow user access to the
.Pa /dev/input/event*
nodes with inclusion of user in the
.Em games
group.
.Sh HARDWARE
The
.Nm
driver supports HID gamepads, joysticks, and controllers such as:
.Pp
.Bl -bullet -compact
.It
8bitdo USB Wireless Adapter 2
.El
.Sh SYSCTL VARIABLES
The following variable is available as both
.Xr sysctl 8
variable and
.Xr loader 8
tunable:
.Bl -tag -width indent
.It Va dev.hgame.X.debug
Debug output level,
where 0 is debugging disabled and
larger values increase debug message verbosity.
Default is 0.
.El
.Pp
Its default value is set with
.Xr loader 8
tunable:
.Bl -tag -width indent
.It Va hw.hid.hgame.debug
.El
.Sh FILES
.Bl -tag -width "/dev/input/event*" -compact
.It Pa /dev/input/event*
input event device
.Pq Sy evdev
node
.El
.Sh SEE ALSO
.Xr iichid 4 ,
.Xr ps4dshock 4 ,
.Xr usbhid 4 ,
.Xr xb360gp 4 ,
.Xr devfs.rules 5
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 13.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Val Packett Aq Mt val@packett.cool .
.Pp
This manual page was written by
.An Vladimir Kondratyev Aq Mt wulf@FreeBSD.org .
