freebsd/freebsd-src/share/man/man4/hme.4
.\"	$NetBSD: hme.4,v 1.4 2003/02/14 15:20:18 grant Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Klaus Klein.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 21, 2003
.Dt HME 4
.Os
.Sh NAME
.Nm hme
.Nd Sun Microelectronics STP2002-STQ Ethernet interfaces device driver
.Sh SYNOPSIS
.Cd "device miibus"
.Cd "device hme"
.Sh DESCRIPTION
The
.Nm
driver supports Sun Microelectronics STP2002-STQ Fast Ethernet interfaces.
.Sh HARDWARE
The
.Nm
driver supports the on-board Ethernet interfaces of many
Sun
.Tn UltraSPARC
workstation and server models.
.Pp
Cards supported by the
.Nm
driver include:
.Pp
.Bl -bullet -compact
.It
Sun PCI SunSwift Adapter
.Pq Dq SUNW,hme
.It
Sun SBus SunSwift Adapter
.Dq ( hme
and
.Dq SUNW,hme )
.It
Sun PCI Sun100BaseT Adapter 2.0
.Pq Dq SUNW,hme
.It
Sun SBus Sun100BaseT 2.0
.Pq Dq SUNW,hme
.It
Sun PCI Quad FastEthernet Controller
.Pq Dq SUNW,qfe
.It
Sun SBus Quad FastEthernet Controller
.Pq Dq SUNW,qfe
.El
.Sh SEE ALSO
.Xr gem 4 ,
.Xr intro 4 ,
.Xr miibus 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Rs
.%T "STP2002QFP Fast Ethernet, Parallel Port, SCSI (FEPS) User's Guide"
.%D April 1996
.%A Sun Microelectronics
.%O http://www.sun.com/oem/products/manuals/STP2002QFP-UG.pdf
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.5 .
The first
.Fx
version to include it was
.Fx 5.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Paul Kranenburg
.Aq pk@NetBSD.org .
