freebsd/freebsd-src/share/man/man4/intpm.4
.\" Copyright (c) 1999 Takanori Watanabe
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id$
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd January 8, 1997
.Dt INTPM 4 i386
.\" Note: Only specify the operating system when the command
.\" is FreeBSD specific, otherwise use the .Os macro with no
.\" arguments.
.Os FreeBSD 3.0
.Sh NAME
.Nm intpm
.Nd Intel PIIX4 Power management controller driver.
.Sh SYNOPSIS
.Cd controller intpm0

.Sh DESCRIPTION
This driver provides access to 
.Tn Intel PIIX4 PCI Controller function 3 ,
Power management controller. Currently, only smbus controller 
function is implemented. But it also have bus idle monitoring function. It
will display mapped I/O address for bus monitoring function when attaching.

.Sh SEE ALSO
.Xr smbus 4 ,
.Xr smb 4
.Sh HISTORY
The
.Nm
manual page example first appeared in
.Fx 3.0 .
.Sh AUTHORS
This
manual page was written by
.An Takanori Watanabe Aq takawata@shidahara1.planet.sci.kobe-u.ac.jp .
.Sh BUGS
This device requires IRQ 9 exclusively. To use this, you should enable 
ACPI function in BIOS configuration, or PnP mechanism assigns conflicted 
IRQ for PnP ISA card. And don't use IRQ 9 for Non-PnP ISA cards.
