freebsd/freebsd-src/share/man/man4/kame.4
.\" Copyright (C) 1995, 1996, 1997, 1998 and 1999 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $Id: kame.4,v 1.4 1999/10/07 04:01:15 itojun Exp $
.\"     $FreeBSD$
.\"
.Dd April 13, 1999
.Dt KAME 4
.Os
.\"
.Sh NAME
.Nm KAME
.Nd introduction and roadmap to KAME IPv6 software package
.\"
.Sh DESCRIPTION
.Nm KAME
software package is a result of joint work of several IPv6 researchers
in Japan, to provide reference implementation of IPv6 to
Berkeley Software Distribution
.Pq BSD
derived system such as BSD/OS,
FreeBSD, NetBSD and OpenBSD
.Pq in alphabetical order .
.Pp
.\" Package consists of set of patches and additions to kernel,
.\" modification to application, daemons, header files and libraries.
KAME kit consists of IPv6/IPsec-ready kernel, application, daemons,
header files and libraries.
.\"
.Sh HIGHLIGHTS
Following are some of highlights of this implementation.
.\"
.Ss Kernel
IPv6 and IPsec protocol stacks are implemented and available.
See below for conformance to standards and/or internet drafts.
.\"
.Ss Plug and Play and protocol stack/interface configuration
.Xr ndp 8 ,
.Xr prefix 8 ,
.Xr rrenumd 8 ,
.Xr rtadvd 8 ,
.Xr rtsol 8 ,
.Xr rtsold 8 .
.\"
.Ss Routing
.Xr bgpd 8 ,
.Xr hroute6d 8 ,
.Xr rip6admin 8 ,
.Xr rip6query 8 ,
.Xr route6d 8 .
.\"
.Ss Multicast (includes routing and utilities)
.Xr mcastread 1 ,
.Xr mcastsend 1 ,
.Xr mchat 1 ,
.Xr ifmcstat 8 ,
.Xr mld6query 8 ,
.Xr pim6dd 8 ,
.Xr pim6sd 8 ,
.Xr pim6stat 8 .
.\"
.Ss Transition Tools
Two IPv4 to IPv6 transition tools are available.
TCP relay translator, FAITH
.Po
.Xr faithd 8
.Pc .
and SIIT IPv6-to-v4 header translator implementation
.Po
.Xr ptrconfig 8
.Pc . 
.\"
.Ss IPsec and tunnelling
.Xr gifconfig 8 ,
.Xr ipsec 4 ,
.\" (dtcp and racoon doesn't exist yet.)
.\" .Xr dtcpc 8 ,
.\" .Xr dtcps 8 ,
.\" .Xr racoon 8 ,
.Xr setkey 8 .
.Pp
Dozen of existing tools are modified for IPsec support, like
.Xr ping 8 .
.\"
.Ss Utilities/Diagnosis
.Xr cksum6 1 ,
.Xr v6test 1 ,
.Xr icmp6dump 8 ,
.Xr ping6 8 ,
.Xr traceroute6 8 ,
.Xr v6p 8 .
.Pp
Dozen of existing utilities are modified for IPv6/IPsec support, like
.Xr ftp 1
and/or
.Xr telnet 1 .
.\"
.Ss Application Daemons
.Xr inetd 8
modified for IPv4/v6 support, or
IPv6-only
.Xr inet6d 8
is supplied.
.Pp
Dozen of existing daemons are modified for IPv6/IPsec support, like
.Xr ftpd 8
and/or
.Xr telnetd 8 .
.\"
.Ss Miscellaneous
SuMiRe IPv4 NAT
.Po
.Xr pma 8
.Pc
is available in addition to OS-supplied IPv4 NAT.
.\"
.Sh DOCUMENTATION
Although some of documentations have not modified yet, program itself
may be heavily modified.
Following lists are not complete, but give you some idea what kind of
new software modules are available, or, modifications are made.
Please refer to each manual page for detail.
Manpages are installed into
.Pa /usr/local/v6/man
so you may want to add the pathname to
.Dv MANPATH .
.\"
.Ss Installation and basic usage documentations
Please read following files in directory
.Pa /usr/local/v6/share/doc/kame
to get basic idea and installation methods on 
.Nm KAME :
.Pa README ,
.Pa RELNOTES ,
.Pa USAGE 
and
.Pa IMPLEMENTATION .
Also check latest status of project at web page:
.Pa http://www.kame.net/ .
.Po
Hope you can see a
.Dq Dancing Turtle
.Dv :-)
.Pc
.\"
.Ss APIs introduced or modified
.Xr if_indextoname 3 ,
.Xr getipnodebyname 3 ,
.Xr gethostbyname 3 ,
.Xr rresvport_af 3 ,
.Xr hosts_ctl 3 ,
.Xr ipsec_get_policylen 3 ,
.Xr getnameinfo 3 ,
.Xr freeaddrinfo 3 ,
.Xr getaddrinfo 3 ,
.Xr pcap 3 ,
.Xr getipnodebyaddr 3 ,
.Xr resolver 3 ,
.Xr ipsec_strerror 3 ,
.Xr gai_strerror 3 ,
.Xr hosts_access 3 ,
.Xr request_set 3 ,
.Xr request_init 3 ,
.Xr freehostent 3 ,
.Xr if_nameindex 3 ,
.Xr if_freenameindex 3 ,
.Xr if_nametoindex 3 ,
.Xr ipsec_dump_policy 3 ,
.Xr ipsec_set_policy 3
.\"
.Ss Added/modified/renamed features and tools
Please consult the manpages referred above.
.\"
.Sh REFERENCES
To understand
.Nm KAME
protocol stack conformance, please refer
.Pa /usr/local/v6/share/doc/kame/IMPLEMENTATION .
.Pp
Bug reporting form, user mailing list, frequently asked questions list,
latest packages, related software, and more information can be found at
.Pa http://www.kame.net/ .
.\"
.Ss "Related project"
TAHI project who is providing verification technology for IPv6, is
heavily related with KAME project.
You can get current verification
status of KAME software at following THAI project web page:
.Pa http://www.tahi.org/
.\"
.Sh HISTORY
The
.Nm 
project started in April 1999.
