freebsd/freebsd-src/share/man/man4/kame.4
.\" Copyright (C) 1995, 1996, 1997, 1998 and 1999 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $Id: kame.4,v 1.4 1999/10/07 04:01:15 itojun Exp $
.\"     $FreeBSD$
.\"
.Dd April 13, 1999
.Dt KAME 4
.Os
.Sh NAME
.Nm KAME
.Nd introduction and roadmap to KAME IPv6 software package
.Sh DESCRIPTION
.Nm
software package is a result of joint work of several IPv6 researchers
in Japan, to provide reference implementation of IPv6 to
Berkeley Software Distribution
.Pq Bx
derived system such as
.Bsx ,
.Fx ,
.Nx
and
.Ox
(in alphabetical order).
.Pp
.\" Package consists of set of patches and additions to kernel,
.\" modification to application, daemons, header files and libraries.
KAME kit consists of IPv6/IPsec-ready kernel, application, daemons,
header files and libraries.
.Sh HIGHLIGHTS
Following are some of highlights of this implementation.
.Pp
Note: features not yet integrated into
.Fx
are marked with the
.Pq -
sign.
.\"
.Ss Kernel
IPv6 and IPsec protocol stacks are implemented and available.
See below for conformance to standards and/or internet drafts.
.\"
.Ss Plug and Play and protocol stack/interface configuration
.Xr ndp 8 ,
.Xr rrenumd 8 ,
.Xr rtadvd 8 ,
.Xr rtsol 8 ,
.Xr rtsold 8 .
.\"
.Ss Routing
.Xr rip6query 8 ,
.Xr route6d 8 .
.\"
.Ss Multicast (includes routing and utilities)
.Xr mchat 1
.Pq - ,
.Xr ifmcstat 8 ,
.Xr pim6dd 8 Pq Pa ports/net/pim6dd ,
.Xr pim6sd 8 Pq Pa ports/net/pim6sd ,
.Xr pim6stat 8 .
.\"
.Ss Transition Tools
Two IPv4 to IPv6 transition tools are available.
TCP relay translator, FAITH
.Pq Xr faithd 8
and SIIT IPv6-to-v4 header translator implementation
.Pq Xr ptrconfig 8 .
.Xr ptrconfig 8
is not yet integrated into
.Fx .
.\"
.Ss IPsec and tunnelling
.Xr ipsec 4 ,
.Xr racoon 8 Pq Pa ports/security/racoon ,
.Xr setkey 8 .
.Pp
Dozen of existing tools are modified for IPsec support, like
.Xr ping 8 .
.\"
.Ss Utilities/Diagnosis
.Xr v6test 1
.Pq - ,
.Xr ping6 8 ,
.Xr traceroute6 8 .
.Pp
Dozen of existing utilities are modified for IPv6/IPsec support, like
.Xr ftp 1
and/or
.Xr telnet 1 .
.\"
.Ss Application Daemons
.Xr inetd 8
modified for IPv4/v6 support, or
IPv6-only
.Xr inet6d 8
.Pq -
is supplied.
.Pp
Dozen of existing daemons are modified for IPv6/IPsec support, like
.Xr ftpd 8
and/or
.Xr telnetd 8 .
.\"
.Sh DOCUMENTATION
Although some of documentations have not modified yet, program itself
may be heavily modified.
Following lists are not complete, but give you some idea what kind of
new software modules are available, or, modifications are made.
Please refer to each manual page for detail.
.\"
.Ss Installation and basic usage documentations
Please read the following files in the directories
.Pa /usr/share/doc/IPv6
and
.Pa /usr/share/examples/IPv6
to get a basic idea of (and installation methods for
.Nm .
You also can check out the IPv6 and IPsec chapters in the
.Fx
handbook.
Also check latest status of project at web page:
.Pa http://www.kame.net/ .
(Hope you can see a
.Dq Dancing Turtle
.Li :-) )
.\"
.Ss APIs introduced or modified
.Xr if_indextoname 3 ,
.Xr getipnodebyname 3 ,
.Xr gethostbyname 3 ,
.Xr rresvport_af 3 ,
.Xr hosts_ctl 3 ,
.Xr ipsec_get_policylen 3 ,
.Xr getnameinfo 3 ,
.Xr freeaddrinfo 3 ,
.Xr getaddrinfo 3 ,
.Xr pcap 3 ,
.Xr getipnodebyaddr 3 ,
.Xr resolver 3 ,
.Xr ipsec_strerror 3 ,
.Xr gai_strerror 3 ,
.Xr hosts_access 3 ,
.Xr request_set 3 ,
.Xr request_init 3 ,
.Xr freehostent 3 ,
.Xr if_nameindex 3 ,
.Xr if_freenameindex 3 ,
.Xr if_nametoindex 3 ,
.Xr ipsec_dump_policy 3 ,
.Xr ipsec_set_policy 3
.\"
.Ss Added/modified/renamed features and tools
Please consult the manpages referred above.
.\"
.Sh SEE ALSO
To understand
.Nm
protocol stack conformance, please refer to
.Pa /usr/share/doc/IPv6/IMPLEMENTATION .
.Pp
Bug reporting form, user mailing list, frequently asked questions list,
latest packages, related software, and more information can be found at
.Pa http://www.kame.net/ .
.\"
.Ss "Related project"
TAHI project who is providing verification technology for IPv6, is
heavily related with KAME project.
You can get current verification
status of KAME software at following TAHI project web page:
.Pa http://www.tahi.org/
.\"
.Sh HISTORY
The
.Nm
project started in April 1999.
.Nm
kit was mostly integrated into
.Fx
by
.An Youshinobu Inoue Aq shin@FreeBSD.org
in January 2000.
