freebsd/freebsd-src/share/man/man4/mt7921.4
.\"
.\" Copyright (c) 2023-2024 Bjoern A. Zeeb
.\" Copyright (c) 2026 The FreeBSD Foundation
.\"
.\" Portions of this documentation were written by Bj\xc3\xb6rn Zeeb
.\" under sponsorship from the FreeBSD Foundation.
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd July 27, 2026
.Dt MT7921 4
.Os
.Sh NAME
.Nm mt7921
.Nd MediaTek IEEE 802.11ax wireless network driver
.Sh SYNOPSIS
The driver will auto-load without any user interaction using
.Xr devmatch 8
if enabled in
.Xr rc.conf 5 .
.Pp
Only if auto-loading is explicitly disabled, place the following
lines in
.Xr rc.conf 5
to manually load the driver as a module at boot time:
.Bd -literal -offset indent
kld_list="${kld_list} if_mt7921"
.Ed
.Pp
It is not possible to load the driver from
.Xr loader 8 .
.Sh DESCRIPTION
The
.Nm
driver provides support for MediaTek MT7921 based wireless
network devices.
.Nm
is derived from MediaTek's Linux mt76 driver based on Linux version 7.0.
.Pp
This driver requires firmware to be loaded before it will work.
The package
.Pa wifi-firmware-mt76-kmod-mt7921
from the
.Pa ports/net/wifi-firmware-mt76-kmod
port needs to be installed before the driver is loaded.
Otherwise no
.Xr wlan 4
interface can be created using
.Xr ifconfig 8 .
One should use
.Xr fwget 8
to install the correct firmware package.
.Pp
The driver uses the
.Xr linuxkpi_wlan 4
and
.Xr linuxkpi 4
compat framework to bridge between the Linux and
native
.Fx
driver code as well as to the native
.Xr net80211 4
wireless stack.
.Sh HARDWARE
The
.Nm
driver supports PCIe devices with the following chipsets:
.Pp
.Bl -bullet -offset indent -compact
.It
MediaTek MT7920E
.It
MediaTek MT7921E (also known as AMD RZ608)
.It
MediaTek MT7922E (also known as AMD RZ616)
.El
.Pp
You may also see MT7961 in names for MT7920 and MT7921 devices.
.Sh SEE ALSO
.Xr linuxkpi 4 ,
.Xr linuxkpi_wlan 4 ,
.Xr wlan 4 ,
.Xr networking 7 ,
.Xr fwget 8 ,
.Xr ifconfig 8 ,
.Xr wpa_supplicant 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 16.0 .
.Sh BUGS
While
.Nm
supports 802.11a/b/g/n/ac/ax modes,
the compatibility code currently only supports 802.11a/b/g/n/ac modes.
Support for 802.11ax is to come.
