freebsd/freebsd-src/share/man/man4/mtw.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2024 Jesper Schmitz Mouridsen <jsm@freebsd.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd Feb 03, 2025
.Dt MTW 4
.Os
.Sh NAME
.Nm if_mtw
.Nd "Mediatek MT7601U"
.Ed
.Sh DESCRIPTION
This module provides support for Mediatek MT7601U with the firmware from net/wifi-firmware-mtw-kmod

.Sh HARDWARE
The
.Nm
driver supports  Mediatek MT7601U
based USB wireless network adapters including (but not all of them tested):
.Pp
.Bl -column -compact
.It
ASUS USB-N10 v2
.It
D-Link DWA-127 rev B1
.It
Edimax EW-7711UAn v2
.It
Foxconn WFU03
.It
Tenda U2
.It
Tenda W311MI v2
.It
TP-LINK TL-WN727N v4 (tested working)
.It
Yealink WF40
.El
.Sh SEE ALSO
.Xr usb 4
.Sh BUGS
The
.Nm
only works in station mode and monitor mode. The firmware does not always reinitialize when reloading the module, or when rebooting, without first unplugging the device.
.Sh History
The mtw driver first appeared in OpenBSD 7.1. The mtw driver was ported to FreeBSD in FreeBSD 15.0.
.Sh AUTHORS
.An -nosplit
The mtw driver was written by
.An James Hastings Aq Mt hastings@openbsd.org
ported to FreeBSD by
.An Jesper Schmitz Mouridsen Aq Mt jsm@FreeBSD.org
