freebsd/freebsd-src/share/man/man4/my.4
.\" Copyright (c) 2003 Hiten M. Pandya
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND ITS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR THE CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/my.4,v 1.3.2.1 2003/09/02 18:27:09 simon Exp $
.\"
.Dd May 16, 2003
.Dt MY 4
.Os
.Sh NAME
.Nm my
.Nd "Myson Technology Ethernet PCI driver"
.Sh SYNOPSIS
.Cd "device miibus"
.Cd "device my"
.Sh DESCRIPTION
The
.Nm
driver provides support for various NICs based on the Myson chipset.
The Myson chipset is a variant of the DEC Tulip NIC chipset.
Supported models include:
.Pp
.Bl -bullet -compact
.It
Myson MTD800 PCI Fast Ethernet chip
.It
Myson MTD803 PCI Fast Ethernet chip
.It
Myson MTD89X PCI Gigabit Ethernet chip
.El
.Pp
The driver will work with almost any MII-compliant PHY, thus failure to
positively identify the chip is not a fatal error.
.Sh SEE ALSO
.Xr de 4 ,
.Xr miibus 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 4.6 .
.Sh AUTHORS
The
.Nm
driver was written by Myson Technology Inc.
.Pp
This manual page was written by
.An Hiten M. Pandya Aq hmp@FreeBSD.org .
.Sh BUGS
The
.Nm
driver does not support Power Management Events (PME).
