freebsd/freebsd-src/share/man/man4/natmip.4
.\" $FreeBSD$
.\"
.Dd June 13, 2003
.Dt NATMIP 4
.Os
.Sh NAME
.Nm natmip
.Nd IP over ATM PVCs
.Sh SYNOPSIS
.Cd "device atm"
.Cd "options NATM"
.Sh DESCRIPTION
The NATM protocol stack includes support for IP over ATM. Without any
additional signalling stacks or other modules it is possible to build
a CLIP (classical IP over ATM) network based on PVCs.
.Pp
An ATM network card (en0 in this example) is configured for IP by something
like:
.Pp
.Dl # ifconfig en0 128.252.200.1 netmask 0xffffff00 up
.Pp
A PVC is added with the
.Dq route
utility:
.Pp
.Dl # route add -iface <remote IP address> -link en0:z.0.x.y
.Pp
where x and y are the hexadecimal byte encoding of the VCI to use,
and z is the byte encoding of the following flags:
.Pp
.Bl -tag -width "0x02" -offset indent -compact
.It 0x01
use AAL5.
.It 0x02
if using AAL5, use an LLC/SNAP header.
.El
.Pp
Thus, parameter 3 means AAL5 and LLC/SNAP encapsulation (this is the required
setting for interworking with other CLIP clients).
Note that BPF works only with LLC/SNAP encapsulation.
.Sh EXAMPLES
Suppose you have 3 hosts 128.252.200.1, 128.252.200.2 and
128.252.200.3 connected by ATM through PVCs:
.Pp
.Bl -item -offset indent -compact
.It
between 128.252.200.1 and 128.252.200.2: 0xc9
.It
between 128.252.200.1 and 128.252.200.3: 0xca
.It
between 128.252.200.2 and 128.252.200.3: 0xcb
.El
.Pp
To enable the links use the following commands:
.Pp
on host 128.252.200.1:
.Bd -literal -offset indent -compact
# ifconfig en0 128.252.200.1 netmask 0xffffff00 up
# route add -iface 128.252.200.2 -link en0:3.0.0.c9
# route add -iface 128.252.200.3 -link en0:3.0.0.ca
.Ed
.Pp
on host 128.252.200.2:
.Bd -literal -offset indent -compact
# ifconfig en0 128.252.200.2 netmask 0xffffff00 up
# route add -iface 128.252.200.1 -link en0:3.0.0.c9
# route add -iface 128.252.200.3 -link en0:3.0.0.cb
.Ed
.Pp
on host 128.252.200.3:
.Bd -literal -offset indent -compact
# ifconfig en0 128.252.200.3 netmask 0xffffff00 up
# route add -iface 128.252.200.1 -link en0:3.0.0.ca
# route add -iface 128.252.200.2 -link en0:3.0.0.cb
.Ed
.Pp
This can also be done in
.Xr rc.conf 5 :
.Pp
on host 128.252.200.1:
.Bd -literal -offset indent -compact
network_interfaces="lo0 en0"
ifconfig_en0="inet 128.252.200.1 netmask 255.255.255.0"
static_routes="host2 host3"
route_host2="-iface 128.252.200.2 -link en0:3.0.0.c9"
route_host3="-iface 128.252.200.3 -link en0:3.0.0.ca"
.Ed
.Pp
on host 128.252.200.2:
.Bd -literal -offset indent -compact
network_interfaces="lo0 en0"
ifconfig_en0="inet 128.252.200.2 netmask 255.255.255.0"
static_routes="host1 host3"
route_host1="-iface 128.252.200.1 -link en0:3.0.0.c9"
route_host3="-iface 128.252.200.3 -link en0:3.0.0.cb"
.Ed
.Pp
on host 128.252.200.3:
.Bd -literal -offset indent -compact
network_interfaces="lo0 en0"
ifconfig_en0="inet 128.252.200.3 netmask 255.255.255.0"
static_routes="host1 host2"
route_host1="-iface 128.252.200.1 -link en0:3.0.0.ca"
route_host2="-iface 128.252.200.2 -link en0:3.0.0.cb"
.Ed
.Sh SEE ALSO
.Xr en 4 ,
.Xr natm 4
.Sh AUTHORS
.An Chuck Cranor
of Washington University implemented the NATM protocol layer
along with the EN ATM driver in 1996 for
.Nx .
