freebsd/freebsd-src/share/man/man4/nsip.4
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)nsip.4	1.4 (Berkeley) 3/28/91
.\"
.Dd March 28, 1991
.Dt NSIP 4
.Os BSD 4.3
.Sh NAME
.Nm nsip
.Nd software network interface encapsulating ns packets in ip packets.
.Sh SYNOPSIS
.Cd options NSIP
.Fd #include <netns/ns_if.h>
.Sh DESCRIPTION
The
.Nm nsip
interface is a software mechanism which may be
used to transmit Xerox
.Tn NS Ns (tm)
packets through otherwise uncooperative
networks.
It functions by prepending an
.Tn IP
header, and resubmitting the packet
through the
.Tn UNIX
.Tn IP
machinery.
.Pp
The super-user can advise the operating system of a willing partner
by naming an
.Tn IP
address to be associated with an
.Tn NS
address.
Presently, only specific hosts pairs are allowed, and for each host
pair, an artificial point-to-point interface is constructed.
At some future date,
.Tn IP
broadcast addresses or hosts may be paired
with
.Tn NS
networks or hosts.
.Pp
Specifically, a socket option of
.Dv SO_NSIP_ROUTE
is set on a socket
of family
.Dv AF_NS ,
type
.Dv SOCK_DGRAM ,
passing the following structure:
.Bd -literal
struct nsip_req {
	struct sockaddr rq_ns;	/* must be ns format destination */
	struct sockaddr rq_ip;	/* must be ip format gateway */
	short rq_flags;
};
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It nsip%d: can't handle af%d.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ns 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 .
.Sh BUGS
It is absurd to have a separate pseudo-device for each pt-to-pt
link.
There is no way to change the
.Tn IP
address for an
.Tn NS
host once the
the encapsulation interface is set up.
The request should honor flags of
.Dv RTF_GATEWAY
to indicate
remote networks, and the absence of
.Dv RTF_UP
should be a clue
to remove that partner.
This was intended to postpone the necessity of rewriting reverse
.Tn ARP
for the 
.Xr en 4
device, and to allow passing
.Tn XNS
packets through an
Arpanet-Milnet gateway, to facilitate testing between some co-operating
universities.
