freebsd/freebsd-src/share/man/man4/nvme.4
.\"
.\" Copyright (c) 2012-2016 Intel Corporation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions, and the following disclaimer,
.\"    without modification.
.\" 2. Redistributions in binary form must reproduce at minimum a disclaimer
.\"    substantially similar to the "NO WARRANTY" disclaimer below
.\"    ("Disclaimer") and any redistribution must be conditioned upon
.\"    including a substantially similar Disclaimer requirement for further
.\"    binary redistribution.
.\"
.\" NO WARRANTY
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
.\" HOLDERS OR CONTRIBUTORS BE LIABLE FOR SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGES.
.\"
.\" nvme driver man page.
.\"
.\" Author: Jim Harris <jimharris@FreeBSD.org>
.\"
.Dd August 27, 2026
.Dt NVME 4
.Os
.Sh NAME
.Nm nvme
.Nd NVM Express core driver
.Sh SYNOPSIS
.Cd device nvme
.Cd options NVME_USE_NVD=0
.Cd options NVME_2X_RESET
.Pp
In
.Xr loader.conf 5 :
.Cd hw.nvme.per_cpu_io_queues= Ns Ar 0
.Cd hw.nvme.min_cpus_per_ioq= Ns Aq Ar X
.Cd hw.nvme.force_intx= Ns Ar 1
.Cd hw.nvme.hmb_max
.Cd hw.nvme.apst_enable= Ns Ar 1
.Cd hw.nvme.apst_data
.Cd hw.nvme.use_nvd= Ns Ar 0
.Cd nvme_load="YES"
.Pp
In
.Xr loader.conf 5
or
.Xr sysctl.conf 5 :
.Cd dev.nvme.0.num_cpus_per_ioq
.Cd dev.nvme.0.int_coal_time
.Cd dev.nvme.0.int_coal_threshold
.Cd dev.nvme.0.ioq0.num_entries
.Cd dev.nvme.0.ioq0.num_tr
.Cd dev.nvme.0.ioq0.num_prp_list
.Cd dev.nvme.0.ioq0.sq_head
.Cd dev.nvme.0.ioq0.sq_tail
.Cd dev.nvme.0.ioq0.cq_head
.Cd dev.nvme.0.ioq0.num_cmds
.Cd dev.nvme.0.ioq0.dump_debug
.Sh DESCRIPTION
The
.Nm
driver provides support for NVM Express (NVMe) controllers, such as:
.Pp
.Bl -bullet -compact
.It
Hardware initialization
.It
Per-CPU IO queue pairs
.It
API for registering NVMe namespace consumers such as
.Xr nvd 4
or
.Xr nda 4
.It
API for submitting NVM commands to namespaces
.It
Ioctls for controller and namespace configuration and management
.El
.Pp
The
.Nm
driver creates controller device nodes in the format
.Pa /dev/nvmeX
and namespace device nodes in
the format
.Pa /dev/nvmeXnsY .
Note that the NVM Express specification starts numbering namespaces at 1,
not 0, and this driver follows that convention.
.Pp
Most users will also want to enable
.Xr nvd 4
or
.Xr nda 4
to expose NVM Express namespaces as disk devices which can be
partitioned.
Note that in NVM Express terms, a namespace is roughly equivalent to a
SCSI LUN.
.Sh KERNEL CONFIGURATION
The following settings can be configured at kernel compile time, see
.Xr build 7 :
.Bl -tag -width indent
.It Cd options NVME_2X_RESET
Reset controller twice upon boot.
This should not be necessary.
.It Cd options NVME_USE_NVD=0
Use the
.Xr nda 4
driver to provide a disk device instead of the default
.Xr nvd 4 .
The
.Xr nvd 4
driver performs better with smaller transactions and few TRIM
commands.
It sends all commands directly to the drive immediately.
The
.Xr nda 4
driver performs better with larger transactions and also collapses
TRIM commands giving better performance.
It can queue commands to the drive; combine
.Dv BIO_DELETE
commands into a single trip; and
use the CAM I/O scheduler to bias one type of operation over another.
.Pp
This value can also be set at boot time with the
.Va hw.nvme.use_nvd=0
tunable.
.El
.Sh LOADER TUNABLES
The following settings can be configured in
.Xr loader.conf 5
or at the boot
.Xr loader 8
prompt during runtime:
.Pp
.Bl -tag -width indent
.It Va hw.nvme.per_cpu_io_queues=0
Force a single I/O queue pair shared by all CPUs.
By default,
.Nm
will create an I/O queue pair for each CPU, provided enough MSI-X vectors
and NVMe queue pairs can be allocated.
If not enough vectors or queue
pairs are available, nvme(4) will use a smaller number of queue pairs and
assign multiple CPUs per queue pair.
.It Va hw.nvme.min_cpus_per_ioq=X
Assign more than one CPU per I/O queue pair,
thereby reducing the number of MSI-X vectors consumed by the device.
.It Va hw.nvme.force_intx=1
Force legacy interrupts for all
.Nm
driver instances.
Note that use of INTx implies disabling of per-CPU I/O queue pairs.
.It Va hw.nvme.hmb_max
Control maximum amount of system RAM in bytes
to use as Host Memory Buffer for capable devices.
The default value is 5% of physical memory size per device.
.It Va hw.nvme.apst_enable=1
Enable Autonomous Power State Transition
.Pq APST .
.It Va hw.nvme.apst_data
Override default APST settings.
If unset, the default vendor-provided settings, if any, will be applied.
The string must contain up to 32 encoded integers, e.g.
.Dq 0x6418 0 0 0x3e820 .
Each value corresponds to a specific available power state starting
from the lowest, and defines the target state (bits 3..7) to
transition to, as well as the idle time in milliseconds (bits 8..31)
to wait before that transition.
Bits 0..2 must be zero.
.It Va hw.nvme.use_nvd=0
The
.Xr nvd 4
driver is used to provide a disk driver to the system by default.
The
.Xr nda 4
driver can also be used instead.
.Pp
This value may also be set in the kernel config file with
.Cd options NVME_USE_NVD=0 .
.It Va hw.nvme.verbose_cmd_dump=1
Enable verbose error messages.
When there is an error,
.Nm
prints only the most relevant information about the command by default.
.El
.Sh SYSCTL VARIABLES
The following controller-level sysctls are currently implemented:
.Bl -tag -width indent
.It Va dev.nvme.0.num_cpus_per_ioq
(R) Number of CPUs associated with each I/O queue pair.
.It Va dev.nvme.0.int_coal_time
(R/W) Interrupt coalescing timer period in microseconds.
Set to 0 to disable.
.It Va dev.nvme.0.int_coal_threshold
(R/W) Interrupt coalescing threshold in number of command completions.
Set to 0 to disable.
.El
.Pp
The following queue pair-level sysctls are currently implemented.
Admin queue sysctls take the format of dev.nvme.0.adminq and I/O queue sysctls
take the format of dev.nvme.0.ioq0.
.Bl -tag -width indent
.It Va dev.nvme.0.ioq0.num_entries
(R) Number of entries in this queue pair's command and completion queue.
.It Va dev.nvme.0.ioq0.num_tr
(R) Number of nvme_tracker structures currently allocated for this queue pair.
.It Va dev.nvme.0.ioq0.num_prp_list
(R) Number of nvme_prp_list structures currently allocated for this queue pair.
.It Va dev.nvme.0.ioq0.sq_head
(R) Current location of the submission queue head pointer as observed by
the driver.
The head pointer is incremented by the controller as it takes commands off
of the submission queue.
.It Va dev.nvme.0.ioq0.sq_tail
(R) Current location of the submission queue tail pointer as observed by
the driver.
The driver increments the tail pointer after writing a command
into the submission queue to signal that a new command is ready to be
processed.
.It Va dev.nvme.0.ioq0.cq_head
(R) Current location of the completion queue head pointer as observed by
the driver.
The driver increments the head pointer after finishing
with a completion entry that was posted by the controller.
.It Va dev.nvme.0.ioq0.num_cmds
(R) Number of commands that have been submitted on this queue pair.
.It Va dev.nvme.0.ioq0.dump_debug
(W) Writing 1 to this sysctl will dump the full contents of the submission
and completion queues to the console.
.El
.Pp
In addition to the typical pci attachment, the
.Nm
driver supports attaching to a
.Xr ahci 4
device.
Intel's Rapid Storage Technology (RST) hides the nvme device
behind the AHCI device due to limitations in Windows.
However, this effectively hides it from the
.Fx
kernel.
To work around this limitation,
.Fx
detects that the AHCI device supports RST and when it is enabled.
See
.Xr ahci 4
for more details.
.Sh DIAGNOSTICS
.Bl -diag
.It "nvme%d: System interrupt issues?"
The driver found a timed-out transaction had a pending completion record,
indicating an interrupt had not been delivered.
The system is either not configuring interrupts properly, or the system drops
them under load.
This message will appear at most once per boot per controller.
.El
.Sh SEE ALSO
.Xr nda 4 ,
.Xr nvd 4 ,
.Xr pci 4 ,
.Xr nvmecontrol 8 ,
.Xr disk 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 9.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was developed by Intel and originally written by
.An Jim Harris Aq Mt jimharris@FreeBSD.org ,
with contributions from
.An Joe Golio
at EMC.
.Pp
This man page was written by
.An Jim Harris Aq Mt jimharris@FreeBSD.org .
