freebsd/freebsd-src/share/man/man4/oldcard.4
.\"
.\" Copyright (c) 2001 M. Warner Losh
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$FreeBSD$
.\"
.Dd August 21, 2001
.Dt PCIC 4
.Os FreeBSD
.Sh NAME
.Nm pcic
.Nd pccard bridge driver
.Sh SYNOPSIS
.Cd device pcic
.Cd device card
.Sh DESCRIPTION
The
.Nm
driver controls the pccard subssytem.
The
.Nm
driver supports most
.Tn ExCA
devices attach to either
.Tn ISA
or
.Tn PCI
bus.
.Pp
The following
.Tn ISA
devices, or true clones, are supported in the current code.
.Bl -tag -width "Intel i82365SL Step A" -compact
.Pp
.It Intel i82365SL Step A
.It Intel i82365SL Step B
.It Intel i82365SL Step C
.Tn Intel's
original 16-bit pccard controller.
.It Intel i82365SL-DF
.Tn Intel's last version of this device.
3.3V support was added.
.It VLSI 82C146
An older VLSI part with some issues on some machines.
.It Cirrus Logic PD-6710
.It Cirrus Logic PD-6720
.It Cirrus Logic PD-6722
Cirrus Logic's pcic controller.
Compatible with the i82365sl STEP C with the addition of a different
3.3V control.
.It Ricoh RF5C296
.It Ricoh RF5C396
Ricoh's pccard bridge chips.
These are compatible with the i82365sl step C, but with yet another
different 3.3V control.
.It Vadem 365
.It Vadem 465
Compatible with i82365sl step c.
.It Vadem 468
.It Vadem 469
Like the earlier Vadem models, but with Vadem's own, incompatible, 3.3V
control system.
.It IBM PCIC
.Tn IBM
clone of the original i82365sl part, with its own id register value.
Has no 3.3V ability.
.Tn IBM KING
.Tn IBM
A strange clone of i82365sl.
This part has many restrictions not found in the i82365sl, plus some
strange power control.  It has not been tested in ages, but is
believed to work.
.El
.Pp
Many other vendors made parts in this arena, but most of them were
compatible with one of the above chipsets.
.Pp
The following PCI cardbus and pcmcia bridges are supported:
.Bl -tag -width "Intel i82365SL Step A" -compact
.Pp
.It Cirrus Logic PD6729
.It Cirrus Logic PD6730
These two might be broken at the moment.
.It Cirrus Logic PD6832
.It Cirrus Logic PD6833
.Pp
.It O2micro OZ6729
.It O2micro OZ6730
.It O2micro OZ6812
.It O2micro OZ6832
.It O2micro OZ6833
.It O2micro OZ6836
.It O2micro OZ6860
.It O2micro OZ6872
O2 Micro chips may be poorly supported because the author does not
have good access to machines with one of these bridges in it.
.Pp
.It Ricoh RL4C475
.It Ricoh RL4C476
.It Ricoh RL4C477
.It Ricoh RL4C478
.Pp
.It TI PCI-1031
.It TI PCI-1130
.It TI PCI-1131
.It TI PCI-1211
.It TI PCI-1220
.It TI PCI-1221
.It TI PCI-1225
.It TI PCI-1250
.It TI PCI-1251
.It TI PCI-1251B
.It TI PCI-1410
.It TI PCI-1420
.It TI PCI-1450
.It TI PCI-1451
.It TI PCI-4451
.Pp
.It Toshiba ToPIC95
.It Toshiba ToPIC97
.It Toshiba ToPIC100 
.Sh
.Sh FILES
.Bl -tag -width /dev/card0 -compact
.It Pa /dev/card0
Character device for the
.Nm
driver.
.El
.Sh TUNABLES
.Bl -tag -width 0123456789 -compact
.It hw.pcic.irq
Offerrides the IRQ to use for ISA interrupt routing.
.It hw.pcic.ignore_function_1
Needed for some, improperly manufacturered pci cards made by orinoco.
It disables function 1 completely.
Set to 0 to enable function 1.
Set to 1 to disable function 1.
.It hw.pcic.intr_path
Should pci pcic devices route interrupts via ISA or PCI.
A value of 1 means default via ISA.
A value of 2 means route via PCI.
.It hw.pcic.init_routing
Some machines can tolerate interrupt routing selection at the cardbus
bridge level.
Others fail when you mess with these registers.
Set to 1 to force the chipset to route via parallel pci interrupts (as 
well as a few other little things).
Set to 0, the default, forces the code to leave these registers as the 
code finds them.
.Sh HISTORY
Too long to detail in the man page.
.Sh AUTHORS
.An M. Warner Losh Aq imp@FreeBSD.ORG
.Sh BUGS
Too many to list.
