freebsd/freebsd-src/share/man/man4/plip.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd March 5, 1998
.Dt PLIP 4
.Os FreeBSD
.Sh NAME
.Nm plip
.Nd
Parallel port network interface
.Sh SYNOPSIS
.Cd "device plip at ppbus?"
.Sh DESCRIPTION
The
.Em plip
driver is the port of the
.Xr lp 4
driver to the
.Xr ppbus 4
system.
.Pp
One purpose of this port is to allow parallel port sharing with other
parallel devices. Parallel port bus allocation has been added to the original
.Xr lp 4
driver. Secondly, inb()/outb() calls have been replaced by ppbus function 
calls. plip is now arch-independent thanks to the ppbus interface. See
.Xr ppbus 4
for more info about the ppbus system.
.Pp
The ppbus is allocated when the parallel network interface comes up, then
released when the interface goes down. Consequently, the parallel port bus
is unavailable to other devices when the network interface is up. plip is
interrupt driven and needs to own the bus to receive parallel port interrupts.
.Pp
Please, ensure the
.Xr ppc 4
entry in you MACHINE file has the net interrupt level...
.Sh SEE ALSO
.Xr ppbus 4 ,
.Xr lp 4 ,
.Sh HISTORY
The
.Nm
manual page first appeared in
.Fx 3.0 .
.Sh AUTHOR
This
manual page was written by
.An Nicolas Souchu .
