freebsd/freebsd-src/share/man/man4/pst.4
.\"
.\" Copyright (c) 2001,2002 Søren Schmidt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 21, 2001
.Dt PST 4
.Os
.Sh NAME
.Nm pst
.Nd Device driver for Promise Supertrak SX6000
.Sh SYNOPSIS
Include this line in the kernel config file:
.Cd device pst
.Pp
.Sh DESCRIPTION
This driver is for the Promise Supertrak SX6000 ATA hardware RAID controller.
It supports (in hardware) RAID levels 0, 1, 0+1, 3, 5 and JBOD on up to 
6 ATA disk drives, including automatic rebuild and hotswap, and supports 
signalling disk status on LED's on Promise Superswap disk enclosures.
The Supertrak lines of controllers does not support non-disk devices.
.Pp
.Sh NOTES
The
.Nm
driver does not support manipulating the RAID from the OS, RAID's need
to be setup from the onboard BIOS. However hot swap, hot spare, and
automatic rebuilds are supported without reboot.
.Pp
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 4.7 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver and man page was written by
.An S\(/oren Schmidt
.Aq sos@FreeBSD.org .
