freebsd/freebsd-src/share/man/man4/pt.4
.Dd March 2, 1995
.Dt PT 4
.Os FreeBSD
.Sh NAME
.Nm pt
.Nd SCSI processor type driver
.Sh SYNOPSIS
.Cd device pt0 at scbus?
.Sh DESCRIPTION
The
.Nm
driver provides support for a 
.Tn SCSI
processor type device.  These are usually scanners and other
devices using the
.Tn SCSI
link as a communication interface with device
specific commands embedded in the data stream.
.Pp
A
.Tn SCSI
adapter must be separately configured into the system
before this driver can be used.
.Pp
This device only supports
.Xr read 2
and
.Xr write 2 ,
and the generic
.Tn SCSI
.Xr ioctl 2
calls.
The
.Sq Li at scbus?
is required in the config file for the configuration
system to know this is a SCSI device and generate the appropriate
tables.
.Pp
The
.Sq Li 0
in 
.Sq Li pt0
in the configuration is required.
This is a deficiency in 
.Xr config 8 .
.Sh IOCTLS
The 
.Nm
driver has no
.Fn ioctl
commands of its own but rather acts as a medium for the
generic 
.Xr scsi 4
commands. These are described in
.Aq Pa sys/scsiio.h .
All
.Xr scsi 4
debug ioctls work on 
.Nm
devices.
.Sh FILES
.Bl -tag -width /dev/ptQQQ -compact
.It Pa /dev/pt Ns Ar N
the
.No Ar N Ns th processor device.
.El
.Sh SEE ALSO
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver appeared in 
.Fx 2.1 .
