freebsd/freebsd-src/share/man/man4/pt.4
.Dd March 2, 1995
.Dt PT 4
.Os FreeBSD
.Sh NAME
.Nm pt
.Nd scsi processor type driver
.Sh SYNOPSIS
.Nm device pt0 at scbus?
.Sh DESCRIPTION
The
.Xr pt
driver provides support for a 
SCSI processor type device.  These are usually scanners and other
devices using the SCSI link as a communication interface with device
specific commands embedded in the data stream.
.Pp
A scsi adapter must be separately configured into the system
before this driver can be used.
.Pp
This device only supports
.Xr read 2
and
.Xr write 2 ,
and the general scsi ioctl calls.
.Sh IOCTLS
The 
.Nm
driver has no ioctls of it's own but rather acts as a medium for the
generic 
.Xr scsi 4
ioctls. These are described in
.Em sys/scsiio.h.
.Sh FILES
.Bl -tag -width /dev/pt -compact
.It Pa /dev/pt[0-255]
pt{x} is the  'xth' processor device.
.El
.Sh DIAGNOSTICS
The
.Em "at scbus?"
is required in the config file for the configuration
system to know this is a SCSI device and generate the appropriate
tables.
.Pp
The 0 in 
.Em pt0
in the configuration is required.
This is a bug in 
.Xr config 8 .
.Pp
All
.Xr scsi 4
debug ioctls work on 
.Nm
devices.
.Sh SEE ALSO
.Xr sd 4
.Xr st 4
.Xr cd 4
.Xr ch 4
.Xr su 4
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver appeared in FreeBSD 2.1
