freebsd/freebsd-src/share/man/man4/puc.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2002 John Hay.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 11, 2025
.Dt PUC 4
.Os
.Sh NAME
.Nm puc
.Nd PCI
.Dq Universal
Communications driver
.Sh SYNOPSIS
.Cd "device pci"
.Cd "device puc"
.Cd "device uart"
.Cd "device ppc"
.Sh DESCRIPTION
The
.Nm
driver acts as a shim to connect
PCI multi-port serial and parallel adapters to the
.Xr uart 4
and
.Xr ppc 4
driver.
.Sh HARDWARE
The
.Nm
driver supports the following
PCI/PCIe multi-port serial and parallel adapters:
.Pp
.Bl -bullet -compact
.It
Advantech 2-port PCI PCI-1602/1603 Rev A/B1
.It
Applied Micro Circuits PCI 8 Port UART
.It
Avlab Technology PCI IO 2S
.It
Avlab Low Profile PCI 4 Serial
.It
Boca Research PCI Turbo Serial 658/654
.It
Brainboxes:
.Bl -dash -compact
.It
Instashield PCIe IX-400, IX-200, IX-100
.It
Instashield PCI IS-400, IS-200
.It
PX Series PCIe RS232/RS422/RS485/LPT
.It
UC Series Universal PCI RS232/RS422/RS485/LPT
.It
UP Series PCI Dual RS232
.El
.It
Comtrol RocketPort 550 PCI 16/8/4 port
.It
Decision Computer PCCOM PCI 8/4/2 port
.It
Digi Neo PCIe 4 and 8 Port (with and without RJ45)
.It
Digi Neo PCI 4 and 8 Port
.It
Dolphin Peripherals PCI 4035/4014
.It
Exar:
.Bl -dash -compact
.It
XR17C/D152
.It
XR17C154
.It
XR17C158
.It
XR17V258IV
.It
XR17V352
.It
XR17V354
.It
XR17V358
.El
.It
Feasso PCI FPP-02 2S1P
.It
HP Diva Serial [GSP] Multiport UART:
.Bl -dash -compact
.It
Tosca Console
.It
Tosca Secondary
.It
Maestro SP2
.It
Superdome Console
.It
Keystone SP2
.It
Everest SP2
.El
.It
I-O DATA RSA-PCI2/R
.It
IBM SurePOS 300 Series (481033H) serial ports
.It
IC Book Labs:
.Bl -dash -compact
.It
Dreadnought x16 Pro/Lite
.It
Ironclad x8 Pro
.It
Gunboat x4 Pro/Lite/Low Profile
.It
Gunboat x2 Low Profile
.El
.It
Kuroutoshikou SERIAL4P-LPPCI2
.It
Lava Computers:
.Bl -dash -compact
.It
Dual Serial PCI
.It
Quattro-PCIe
.It
Quattro-PCI
.It
Octopus-550 PCI
.El
.It
Moxa Technologies:
.Bl -dash -compact
.It
Smartio CP-102E/PCIe
.It
Smartio CP-102EL/PCIe
.It
Smartio C104H/PCI
.It
Smartio CP-104UL/PCI
.It
Smartio CP-104JU/PCI
.It
Smartio CP-104EL/PCIe
.It
Smartio CP-104EL-A/PCIe
.It
CP-112UL PCI
.It
Industio CP-114
.It
Smartio CP-114EL/PCIe
.It
Smartio CP-118EL-A/PCIe
.It
C168H/PCI
.It
C168U/PCI
.It
CP-168EL/PCIe
.It
Smartio CP-168EL-A/PCIe
.El
.It
NetMos NM9815 Dual 1284 Printer port PCI
.It
NetMos NM9835 2/1 port UART + 1284 Printer PCI
.It
NetMos NM9845 4/6 port UART + 1284 Printer PCI
.It
NetMos NM9865 4/3/2 port UART + 1/2 port 1284 Printer PCI
.It
Oxford Semiconductor based boards:
.Bl -dash -compact
.It
OX16PCI952 UART (with and without Parallel port)
.It
OX16PCI954 UART
.It
OX9160/OX16PCI954 UARTs
.It
OX16PCI958 UART
.El
.It
Perle Ultraport4 Express PCIe Serial
.It
Perle Speed8/Speed4/Speed2 LE PCI Serial
.It
Quatech:
.Bl -dash -compact
.It
DSC-300/200/100 PCI
.It
DSCLP-300/200/100 PCI
.It
ESC-100/100D/100M PCI
.It
QSC-300/200/100 PCI
.It
QSCLP-100 PCI
.El
.It
SIIG Cyber Series of UART and parallel port boards:
.Bl -dash -compact
.It
Cyber 2S and 2SP1 PCI 16550
.It
Cyber 4 and 4S PCI 16C650 (10x family and 20x family)
.It
Cyber I/O PCI (10x family and 20x family)
.It
Cyber Parallel Dual PCI (10x family and 20x family)
.It
Cyber Serial Dual PCI (10x family and 20x family)
.It
Cyber 2S1P PCI (10x family and 20x family)
.It
PS8000 8S PCI 16C650 (20x family)
.It
Quartet Serial 850 PCI
.El
.It
Sun 1040 PCI Quad Serial
.It
Sunix MIO5xxxx 4/2/1 port UART and 1284 Printer
.It
Sunix SUN1889/1888 PCI dual port serial
.It
Sunix SER5xxxx 8/4/2 port serial
.It
Syba Tech Ltd PCI-4S2P-550-ECP
.It
Systembase SB16C1054/8 4/8 port serial
.It
Titan PCI-800H/PCI-200H
.It
VScom:
.Bl -dash -compact
.It
PCIex-800H
.It
PCI-200HV2
.It
200Li uPCI
.It
PCI-800L, PCI-200L, and PCI-100L
.It
PCI-800, PCI-400, and PCI-200
.El
.El
.Sh FILES
.Bl -tag -width "sys/dev/puc/pucdata.c"
.It Pa sys/dev/puc/pucdata.c
list of supported devices
.El
.Sh SEE ALSO
.Xr ppc 4 ,
.Xr uart 4
.Sh HISTORY
This driver took the idea from the
.Nx
.Nm
driver.
It uses a substantial amount of the same data.
