freebsd/freebsd-src/share/man/man4/ral.4
.\" Copyright (c) 2005, 2006
.\"     Damien Bergamini <damien.bergamini@free.fr>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\" $FreeBSD$
.\"
.Dd March 05, 2006
.Os
.Dt RAL 4
.Sh NAME
.Nm ral
.Nd "Ralink Technology IEEE 802.11 wireless network driver"
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device ral"
.Cd "device wlan"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_ral_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver supports PCI/CardBus wireless adapters based on the Ralink Technology
RT2500, RT2501, and RT2600 chipsets.
.Pp
The RT2500 chipset is the first generation of 802.11b/g adapters from Ralink.
It consists of two integrated chips, a RT2560 MAC/BBP and a RT2525 radio
transceiver.
.Pp
The RT2501 chipset is the second generation of 802.11b/g adapters from Ralink.
It consists of two integrated chips, a RT2561 MAC/BBP and a RT2527 radio
transceiver.
This chipset provides support for the IEEE 802.11e standard with multiple
hardware transmission queues and allows scatter/gather for efficient DMA
operations.
.Pp
The RT2600 chipset consists of two integrated chips, a RT2661 MAC/BBP and a
RT2529 radio transceiver.
This chipset uses the MIMO (multiple-input multiple-output) technology with
multiple antennas to extend the operating range of the adapter and to achieve
higher throughput.
MIMO will be the basis of the future IEEE 802.11n standard.
.Pp
The transmit speed is user-selectable or can be adapted automatically by the
driver depending on the received signal strength and on the number of hardware
transmission retries.
.Sh HARDWARE
The
.Nm
driver supports the following adapters:
.Pp
.Bl -column -compact ".Li Atlantis Land A02-PCM-W54" "CardBus" "RT2561S"
.It Em Card Ta Em Bus Ta Em MAC/BBP
.It Li "A-Link WL54H" Ta PCI Ta RT2560
.It Li "A-Link WL54PC" Ta CardBus Ta RT2560
.It Li "Amigo AWI-914W" Ta CardBus Ta RT2560
.It Li "Amigo AWI-922W" Ta mini-PCI Ta RT2560
.It Li "Amigo AWI-926W" Ta PCI Ta RT2560
.It Li "AMIT WL531C" Ta CardBus Ta RT2560
.It Li "AMIT WL531P" Ta PCI Ta RT2560
.It Li "AOpen AOI-831" Ta PCI Ta RT2560
.It Li "ASUS WL-107G" Ta CardBus Ta RT2560
.It Li "ASUS WL-130g" Ta PCI Ta RT2560
.It Li "Atlantis Land A02-PCI-W54" Ta PCI Ta RT2560
.It Li "Atlantis Land A02-PCM-W54" Ta CardBus Ta RT2560
.It Li "Belkin F5D7000 v3" Ta PCI Ta RT2560
.It Li "Belkin F5D7010 v2" Ta CardBus Ta RT2560
.It Li "Billionton MIWLGRL" Ta mini-PCI Ta RT2560
.It Li "Canyon CN-WF511" Ta PCI Ta RT2560
.It Li "Canyon CN-WF513" Ta CardBus Ta RT2560
.It Li "CC&C WL-2102" Ta CardBus Ta RT2560
.It Li "CNet CWC-854" Ta CardBus Ta RT2560
.It Li "CNet CWP-854" Ta PCI Ta RT2560
.It Li "Compex WL54G" Ta CardBus Ta RT2560
.It Li "Compex WLP54G" Ta PCI Ta RT2560
.It Li "Conceptronic C54RC" Ta CardBus Ta RT2560
.It Li "Conceptronic C54Ri" Ta PCI Ta RT2560
.It Li "Digitus DN-7001G-RA" Ta CardBus Ta RT2560
.It Li "Digitus DN-7006G-RA" Ta PCI Ta RT2560
.It Li "E-Tech WGPC02" Ta CardBus Ta RT2560
.It Li "E-Tech WGPI02" Ta PCI Ta RT2560
.It Li "Edimax EW-7108PCg" Ta CardBus Ta RT2560
.It Li "Edimax EW-7128g" Ta PCI Ta RT2560
.It Li "Eminent EM3036" Ta CardBus Ta RT2560
.It Li "Eminent EM3037" Ta PCI Ta RT2560
.It Li "Encore ENLWI-G-RLAM" Ta PCI Ta RT2560
.It Li "Encore ENPWI-G-RLAM" Ta CardBus Ta RT2560
.It Li "Fiberline WL-400P" Ta PCI Ta RT2560
.It Li "Fibreline WL-400X" Ta CardBus Ta RT2560
.It Li "Gigabyte GN-WIKG" Ta mini-PCI Ta RT2560
.It Li "Gigabyte GN-WMKG" Ta CardBus Ta RT2560
.It Li "Gigabyte GN-WPKG" Ta PCI Ta RT2560
.It Li "Hawking HWC54GR" Ta CardBus Ta RT2560
.It Li "Hawking HWP54GR" Ta PCI Ta RT2560
.It Li "iNexQ CR054g-009 (R03)" Ta PCI Ta RT2560
.It Li "JAHT WN-4054P" Ta CardBus Ta RT2560
.It Li "JAHT WN-4054PCI" Ta PCI Ta RT2560
.It Li "LevelOne WNC-0301 v2" Ta PCI Ta RT2560
.It Li "LevelOne WPC-0301 v2" Ta CardBus Ta RT2560
.It Li "Linksys WMP54G v4" Ta PCI Ta RT2560
.It Li "Micronet SP906GK" Ta PCI Ta RT2560
.It Li "Micronet SP908GK V3" Ta CardBus Ta RT2560
.It Li "Minitar MN54GCB-R" Ta CardBus Ta RT2560
.It Li "Minitar MN54GPC-R" Ta PCI Ta RT2560
.It Li "MSI CB54G2" Ta CardBus Ta RT2560
.It Li "MSI MP54G2" Ta mini-PCI Ta RT2560
.It Li "MSI PC54G2" Ta PCI Ta RT2560
.It Li "OvisLink EVO-W54PCI" Ta PCI Ta RT2560
.It Li "PheeNet HWL-PCIG/RA" Ta PCI Ta RT2560
.It Li "Pro-Nets CB80211G" Ta CardBus Ta RT2560
.It Li "Pro-Nets PC80211G" Ta PCI Ta RT2560
.It Li "Repotec RP-WB7108" Ta CardBus Ta RT2560
.It Li "Repotec RP-WP0854" Ta PCI Ta RT2560
.It Li "SATech SN-54C" Ta CardBus Ta RT2560
.It Li "SATech SN-54P" Ta PCI Ta RT2560
.It Li "Sitecom WL-112" Ta CardBus Ta RT2560
.It Li "Sitecom WL-115" Ta PCI Ta RT2560
.It Li "SparkLAN WL-685R" Ta CardBus Ta RT2560
.It Li "Surecom EP-9321-g" Ta PCI Ta RT2560
.It Li "Surecom EP-9321-g1" Ta PCI Ta RT2560
.It Li "Surecom EP-9428-g" Ta CardBus Ta RT2560
.It Li "Sweex LC500050" Ta CardBus Ta RT2560
.It Li "Sweex LC700030" Ta PCI Ta RT2560
.It Li "TekComm NE-9321-g" Ta PCI Ta RT2560
.It Li "TekComm NE-9428-g" Ta CardBus Ta RT2560
.It Li "Unex CR054g-R02" Ta PCI Ta RT2560
.It Li "Unex MR054g-R02" Ta CardBus Ta RT2560
.It Li "Zinwell ZWX-G160" Ta CardBus Ta RT2560
.It Li "Zinwell ZWX-G360" Ta mini-PCI Ta RT2560
.It Li "Zinwell ZWX-G361" Ta PCI Ta RT2560
.It Li "Zonet ZEW1500" Ta CardBus Ta RT2560
.It Li "Zonet ZEW1600" Ta PCI Ta RT2560
.El
.Pp
An up to date list can be found at
.Pa http://damien.bergamini.free.fr/ral/list.html .
.Sh EXAMPLES
Join an existing BSS network (i.e., connect to an access point):
.Pp
.Dl "ifconfig ral0 inet 192.168.0.20 netmask 0xffffff00"
.Pp
Join a specific BSS network with network name
.Dq Li my_net :
.Pp
.Dl "ifconfig ral0 inet 192.168.0.20 netmask 0xffffff00 ssid my_net"
.Pp
Join a specific BSS network with 40-bit WEP encryption:
.Bd -literal -offset indent
ifconfig ral0 inet 192.168.0.20 netmask 0xffffff00 ssid my_net \e
    wepmode on wepkey 0x1234567890 weptxkey 1
.Ed
.Pp
Join a specific BSS network with 104-bit WEP encryption:
.Bd -literal -offset indent
ifconfig ral0 inet 192.168.0.20 netmask 0xffffff00 ssid my_net \e
    wepmode on wepkey 0x01020304050607080910111213 weptxkey 1
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It "ral%d: could not load 8051 microcode"
An error occurred while attempting to upload the microcode to the onboard 8051
microcontroller unit.
.It "ral%d: timeout waiting for MCU to initialize"
The onboard 8051 microcontroller unit failed to initialize in time.
.It "ral%d: device timeout"
A frame dispatched to the hardware for transmission did not complete in time.
The driver will reset the hardware.
This should not happen.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cardbus 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr wlan 4 ,
.Xr ifconfig 8
.Rs
.%T "Ralink Technology"
.%O http://www.ralinktech.com/
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.7 .
.Sh CAVEATS
PCI
.Nm
adapters seem to require a PCI 2.2 compliant motherboard and will likely not
work with PCI 2.1 only motherboard.
.Pp
The
.Nm
driver does not implement frame aggregation.
.Sh AUTHORS
The
.Nm
driver was written by
.An Damien Bergamini Aq damien@FreeBSD.org .
