freebsd/freebsd-src/share/man/man4/rr232x.4
.\" Copyright (c) 2006 Scott Long
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd April 27, 2006
.Dt RR232X 4
.Os
.Sh NAME
.Nm rr232x
.Nd "HighPoint RocketRAID 232x device driver"
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device rr232x"
.Cd "device scbus"
.Cd "device da"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
rr232x_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for HighPoint's RocketRAID 232x series of RAID
controllers.
These devices support SATA disk drives and provide RAID 0, 1, and 5
functionality.
Hardware acceleration for RAID 5 is also provided.
Additionally, if multiple controllers are present, arrays may be built
out of drives that are attached to different controllers.
Online management is provided by utilities that are available for free
download from
.Pa http://www.highpoint-tech.com/ .
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Pp
.Bl -bullet -compact
.It
HighPoint RocketRAID 2320
.It
HighPoint RocketRAID 2322
.El
.Sh NOTES
The
.Nm
driver only works on the i386 and amd64 platforms.
Also, while the driver can be loaded as a module, it must be loaded prior
to boot.
Loading it after boot will result in the hardware not being detected.
.Sh SEE ALSO
.Xr cam 4 ,
.Xr loader.conf 5 ,
.Xr loader 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 6.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was provided by
.An "HighPoint Technologies, Inc" .
This manual page was written by
.An Scott Long Aq scottl@FreeBSD.org .
