freebsd/freebsd-src/share/man/man4/rtwn_pci.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2011 Adrian Chadd, Xenion Pty Ltd
.\" Copyright (c) 2016 Andriy Voskoboinyk <avos@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer,
.\"    without modification.
.\" 2. Redistributions in binary form must reproduce at minimum a disclaimer
.\"    similar to the "NO WARRANTY" disclaimer below ("Disclaimer") and any
.\"    redistribution must be conditioned upon including a substantially
.\"    similar Disclaimer requirement for further binary redistribution.
.\"
.\" NO WARRANTY
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF NONINFRINGEMENT, MERCHANTIBILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
.\" THE COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR SPECIAL, EXEMPLARY,
.\" OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGES.
.\"
.Dd November 10, 2024
.Dt RTWN_PCI 4
.Os
.Sh NAME
.Nm rtwn_pci
.Nd Realtek wireless rtwn network driver PCI/PCIe support
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device rtwn"
.Cd "device rtwn_pci"
.Cd "device pci"
.Cd "device wlan"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for PCIe wireless network devices to the
.Xr rtwn 4
driver.
.Pp
Both RTL8188CE and RTL8188EE are highly integrated 802.11n adapters
that combines a MAC, a 1T1R capable baseband and an RF in a single chip.
They are operate in the 2GHz spectrum only.
.Sh HARDWARE
The
.Nm
driver supports the following PCIe Wi-Fi devices:
.Pp
.Bl -bullet -offset indent -compact
.It
Realtek 802.11n wireless 8188  (RTL8188EE)
.It
Realtek 802.11n wireless 8192  (RTL8192CE)
.El
.Sh SEE ALSO
.Xr pci 4 ,
.Xr rtwn 4 ,
.Xr rtwn_usb 4 ,
.Xr rtwnfw 4
