freebsd/freebsd-src/share/man/man4/sched_core.4
.\" Copyright (c) 2006 Xin LI
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd June 30, 2006
.Os
.Dt SCHED_CORE 4
.Sh NAME
.Nm sched_core
.Nd CORE scheduler
.Sh SYNOPSIS
.Cd "options SCHED_CORE"
.Sh DESCRIPTION
The
.Nm
scheduler
is an experimental scheduler that provides a number of advanced scheduler
features not present in
.Xr sched_4bsd 4 ,
the default system scheduler, nor
.Xr sched_ule 4
where it is forked off.
These features address SMP and interactivity and include:
.Pp
.Bl -bullet -compact -offset indent
.It
Nice value of timesharing processes is respected.
Allocation of
time slice and interaction detection algorithm are based on
nice value.
.It
Per-CPU scheduling queue and load balancing.
.It
O(1) scheduling.
.It
Some CPU affinity code in wakeup path.
.It
Some preliminary support for Hyper Threading Technology.
.It
Support for POSIX SCHED_FIFO and SCHED_RR.
.El
.Pp
The following sysctls are relevant to the operation of
.Nm :
.Bl -tag -width indent
.It Va kern.sched.name
This read-only sysctl reports the name of the active scheduler.
.It Va kern.sched.ipiwakeup.enabled
(SMP specific) Whether to allow forwarding of wakeup to idle CPUs.
.It Va kern.sched.ipiwakeup.requested
(SMP specific) Requests for forwarding of wakeup to idle CPUs,
read-only.
.It Va kern.sched.ipiwakeup.requested
(SMP specific) Completed forwarding of wakeup to idle CPUs,
read-only.
.It Va kern.sched.ipiwakeup.usemask
(SMP specific) Whether to use the mask of idle CPUs.
.It Va kern.sched.ipiwakeup.useloop
(SMP specific) Whether to use loop to find idle CPUs.
.It Va kern.sched.ipiwakeup.onecpu
(SMP specific) Whether to only signal one CPU when doing wakeup.
.It Va kern.sched.ipiwakeup.htt
(SMP specific) Whether to take Hyper-Threading into account.
.El
.Pp
The
.Nm
scheduler
is not enabled by default as it is experimental.
.Sh SEE ALSO
.Xr sched_4bsd 4 ,
.Xr sched_ule 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
scheduler first appeared in
.Fx 7.0 .
.Sh AUTHORS
.An David Xu
.Aq davidxu@FreeBSD.org
