freebsd/freebsd-src/share/man/man4/snd_mss.4
.\" Copyright (c) 2005 Joel Dahl
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 28, 2005
.Dt SND_MSS 4
.Os
.Sh NAME
.Nm snd_mss
.Nd "Microsoft Sound System ISA PnP/non-PnP bridge device driver"
.Sh SYNOPSIS
.Cd "device sound"
.Cd "device snd_mss"
.Pp
Non-PnP cards require the following lines in
.Pa /boot/device.hints :
.Cd hint.pcm.0.at="isa"
.Cd hint.pcm.0.irq="10"
.Cd hint.pcm.0.drq="1"
.Cd hint.pcm.0.flags="0x0"
.Sh DESCRIPTION
The
.Nm
bridge driver allows the generic audio driver,
.Xr sound 4 ,
to attach to the supported audio devices.
.Sh HARDWARE
The
.Nm
driver supports the following audio devices:
.Pp
.Bl -bullet -compact
.It
AD1845
.It
AD1848
.It
Aztech 2320
.It
CMedia CMI8330
.It
Crystal Semiconductor CS4231
.It
Crystal Semiconductor CS4232
.It
Crystal Semiconductor CS4234
.It
Crystal Semiconductor CS4235
.It
Crystal Semiconductor CS4236
.It
Crystal Semiconductor CS4237
.It
ENSONIQ SoundscapeVIVO ENS4081
.It
NeoMagic 256AV (non-AC97)
.It
OPTi 924
.It
OPTi 925
.It
OPTi 930
.It
OPTi 931
.It
OPTi 933
.It
Yamaha OPL-SA2
.It
Yamaha OPL-SA3
.El
.Sh SEE ALSO
.Xr sound 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 2.2.6 .
.Sh AUTHORS
This manual page was written by
.An Joel Dahl Aq joel@FreeBSD.org .
