freebsd/freebsd-src/share/man/man4/snd_emu10kx.4
.\"
.\" Copyright (c) 2003,2006 Yuriy Tsibizov,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: snd_emu10kx.4,v 1.19 2006/06/07 11:18:57 chibis Exp $
.\" $FreeBSD$
.\"
.Dd July 15, 2006
.Dt SND_EMU10KX 4
.Os
.Sh NAME
.Nm snd_emu10kx
.Nd Creative SoundBlaster Live! and Audigy sound cards device driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device sound"
.Cd "device snd_emu10kx"
.Pp
For additional options:
.Cd "options EMU10KX_MULTICHANNEL"
.Cd "options EMU10KX_DEBUG"
.Ed
.Pp
Alternatively, to load the driver as a module at boot time, place the
following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
snd_emu10kx_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
bridge driver allows the generic audio driver
.Xr sound 4
to attach to the Creative sound cards based on EMU10K1, CA0100, CA0101, CA0102
and CA0108 DSPs.
.Pp
The
.Nm
sound cards have a PCM part, which is accessible through one to five
.Xr pcm 4
devices (see
.Sx MULTICHANNEL PLAYBACK
for details), and MPU401-compatible MIDI I/O controller, which is accessible
through the midi device.
Wave table synthesizer is not supported.
.Sh HARDWARE
The
.Nm
driver supports the following sound cards:
.Pp
.Bl -bullet -compact
.It
Creative Sound Blaster Live!\& (EMU10K1 Chipset).
Both PCM and MIDI interfaces are available.
.It
Creative Sound Blaster Audigy (CA0100 and CA0101 Chipset).
PCM and two MIDI interfaces available.
.It
Creative Sound Blaster Audigy 2 and Creative Sound Blaster Audigy 4 (CA0102
Chipset).
PCM support is limited to 48kHz/16 bit stereo (192kHz/24 bit part
of this chipset is not supported).
.It
Creative Sound Blaster Audigy 2 Value (CA0108 Chipset).
PCM support is limited
to 48kHz/16 bit stereo (192kHz/24 bit part of this chipset is not supported).
There is no MIDI support for this card.
.El
.Pp
The
.Nm
driver does
.Em not
support the following sound cards (although they are named
similar to some supported ones):
.Pp
.Bl -bullet -compact
.It
Creative Sound Blaster Live!\& 24-Bit, identified by
.Fx
as
.Qq Li "emu10k1x Soundblaster Live! 5.1" .
.It
Creative Sound Blaster Audigy LS / ES, identified by
.Fx
as
.Qq Li "CA0106-DAT Audigy LS" .
.It
All other cards with -DAT chipsets.
.El
.Sh MULTICHANNEL PLAYBACK
It is possible to build this driver with multichannel playback capabilities.
If you enable the
.Dv EMU10KX_MULTICHANNEL
option in your kernel configuration (or
build it as a module) you will get up to five DSP devices, one for each sound
card output.
Only
.Dq FRONT
output can play and record sound from external
sources (like line or S/PDIF inputs).
.Sh OSS MIXER CONTROLS
These are controls available through the standard OSS programming interface.
You can use
.Xr mixer 8
to change them.
.Pp
On EMU10K1-based cards the OSS mixer directly controls the AC97 codec on card.
On newer cards the OSS mixer controls some parameters of the AC97 codec and
some DSP-based mixer controls.
.Bl -inset
.It Qq vol
mixer control is overall sound volume.
.It Qq pcm
mixer control is PCM playback volume.
It controls only front output
volume in multichannel mode and all output volume in single channel mode.
.It Qq rec
mixer control acts very different on EMU10K1 and other cards.
On EMU10K1 cards it controls the AC97 codec recording level.
On non-EMU10K1 cards
it controls the amount of AC97 "stereo mix" entering the DSP.
AC97 recording level and AC97 recording source are fixed
on CA0100, CA0101, CA0102 and CA0108 cards.
AC97 recording level are always set to
maximum and recording source is always
.Dq Li "stereo mix" .
.El
.Pp
Other OSS mixer controls do not work.
.Sh PRIVATE DEVICE CONTROLS
You can control most of EMU10Kx operation and configuration parameters through
.Va dev.emu10kx. Ns Aq Ar X
sysctls.
These
.Xr sysctl 8
values are temporary and should not be relied
upon.
.Sh DRIVER CONFIGURATION
.Ss Kernel Configuration Options
The following kernel configuration options control the
.Nm
driver.
.Bl -tag -width ".Dv EMU10KX_MULTICHANNEL"
.It Dv EMU10KX_MULTICHANNEL
This option enables
.Sx MULTICHANNEL PLAYBACK
for all instances of the
.Nm
driver.
.It Dv EMU10KX_DEBUG
This option enables additional debug messages.
.El
.Sh FILES
.Bl -tag -width ".Pa /dev/emu10kx?" -compact
.It Pa /dev/emu10kx?
.Nm
management interface
.El
.Sh SEE ALSO
.Xr sound 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 7.0 .
.Sh AUTHORS
.An -nosplit
The PCM part of the driver is based on the
.Xr snd_emu10k1 4
SB Live!\& driver by
.An "Cameron Grant" .
The MIDI interface is based on the
.Xr snd_emu10k1 4
MIDI interface code by
.An "Mathew Kanner" .
The
.Nm
device driver and this manual page were written by
.An Yuriy Tsibizov .
.Sh BUGS
8kHz/8bit/mono recording does not work.
8kHz recording was removed from the driver capabilities.
.Pp
The driver does not detect lost S/PDIF signal and produces noise when S/PDIF
is not connected and S/PDIF volume is not zero.
.Pp
The PCM driver cannot detect the presence of Live!Drive or AudigyDrive
breakout boxes
and tries to use them (and list their connectors in the mixer).
.Pp
The MIDI driver cannot detect the presence of Live!Drive or AudigyDrive
breakout boxes and tries to enable the IR receiver on them anyway.
