freebsd/freebsd-src/share/man/man4/snd_emu10k1.4
.\" Copyright (c) 2004 Atte Peltomaki
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd August 27, 2004
.Dt SND_EMU10K1 4
.Os
.Sh NAME
.Nm snd_emu10k1
.Nd "SoundBlaster Live! and Audigy PCI bridge device driver"
.Sh SYNOPSIS
.Cd "device sound"
.Cd "device snd_emu10k1"
.Sh DESCRIPTION
The
.Nm
bridge driver allows the generic audio driver
.Xr sound 4
to attach to the SoundBlaster Live! and Audigy audio cards.
.Pp
Digital output is supported by default.
.Sh HARDWARE
The
.Nm
driver supports the following sound cards:
.Pp
.Bl -bullet -compact
.It
Creative SoundBlaster Live! (EMU10K1 Chipset)
.It
Creative SoundBlaster Audigy (EMU10K2 Chipset)
.El
.Sh SEE ALSO
.Xr sound 4
.Sh HISTORY
The
.Nm
manual page first appeared in
.Fx 5.3 .
.Sh AUTHORS
.An "David O'Brien" Aq obrien@FreeBSD.org
.An "Orlando Bassotto" Aq orlando.bassotto@ieo-research.it
.An "Cameron Grant" Aq cg@FreeBSD.org
.Sh BUGS
Fancy features like DD5.1 output are not supported.
