freebsd/freebsd-src/share/man/man4/snd_dummy.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2024 The FreeBSD Foundation
.\"
.\" Portions of this software were developed by Christos Margiolis
.\" <christos@FreeBSD.org> under sponsorship from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 22, 2025
.Dt SND_DUMMY 4
.Os
.Sh NAME
.Nm snd_dummy
.Nd Dummy audio driver
.Sh SYNOPSIS
To load the driver at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
snd_dummy_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver implements a virtual testing device, meaning it does not correspond to a
physical sound card.
It is intended for testing, so that test programs do not need to rely on
hardware being present in the machine in order to run.
.Pp
The driver attaches as a regular
.Xr sound 4
device, with two channels (one playback and one recording), as well as a mixer.
.Pp
Playback works by discarding all input, and recording by returning silence
(zeros).
.Sh FILES
.Bl -tag -width "/dev/dsp.dummy" -compact
.It Pa /dev/dsp.dummy
Alias to the device's
.Pa /dev/dsp%d
file created by
.Xr sound 4 .
This makes it easy for tests to open the dummy device when there are more
devices present in the system.
.El
.Sh SEE ALSO
.Xr sound 4 ,
.Xr loader.conf 5 ,
.Xr loader 8
.Sh AUTHORS
The
.Nm
driver was implemented by
.An Christos Margiolis Aq Mt christos@FreeBSD.org
under sponsorship from the
.Fx
Foundation.
.Sh CAVEATS
Because the driver automatically attaches once the module is loaded, it can
only be attached once.
