freebsd/freebsd-src/share/man/man4/snp.4
.Dd Februar 17, 1995
.Dt SNP(4)
.Os
.Sh NAME

 snp  - tty snoop interface.

.Sh SYNOPSIS
#include <sys/snoop.h>

.Sh DESCRIPTION
 /dev/snp? are snoop devices which allow user to attach to any tty
and watch activities on it. Device can be used by root only.
 To connect device to tty use special iocontrol SNPSTTY.Argument to
it is a structure 'snptty'. 
              struct snptty {
                     int st_type;
                     int st_unit;
              }

st_type - type of tty to attach. Currently supported are :
       ST_PTY - pseudo-tty devices.
       ST_VTY - virtual ttys (syscons).
       ST_SIO - serial ttys.

st_unit - number of tty unit.
By specifying ever st_type or st_unit -1 user can detach snp 
device from tty.

 SNPGTTY  - iocontrol returns current tty attached.
 FIONREAD - iocontrol returns ever positive value equal to number of
            characters in read buffer. Also special values defined:
             SNP_OFLOW    - device overflow occured,device automatically
                            detached.
             SNP_TTYCLOSE - tty still has not been attached.       
             SNP_DETACH   - snp device has been detached by user or
                            tty device has been closed and detached
                            automatically.
  
.Sh SEE ALSO

watch(8), pty(4), sio(4)
.Sh BUGS

While in line mode,user input can't be seen.
Has no ability to write to attached tty device.

.Sh HISTORY
FreeBSD 2.1 by Ugen J.S.Antsilevich <ugen@NetVision.net.il>
