freebsd/freebsd-src/share/man/man4/terasic_de4led.4
.\"-
.\" Copyright (c) 2015 SRI International
.\" All rights reserved.
.\"
.\" This software was developed by SRI International and the University of
.\" Cambridge Computer Laboratory under DARPA/AFRL contract (FA8750-10-C-0237)
.\" ("CTSRD"), as part of the DARPA CRASH research programme.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 23, 2015
.Dt TERASIC_DE4LED 4
.Os
.Sh NAME
.Nm terasic_de4led
.Nd driver for the LEDs on the Terasic DE4.
.Sh SYNOPSIS
.Cd "device terasic_de4led"
.Pp
In
.Pa /boot/device.hints :
.Cd hint.terasic_de4led.0.at="nexus0"
.Cd hint.terasic_de4led.0.maddr=0x7f006000
.Cd hint.terasic_de4led.0.msize=1
.Pp
In DTS file:
.Cd "led@7f006000 {"
.Cd "	compatible =" Qo sri-cambridge,de4led Qc ;
.Cd "	reg = <0x7f006000 0x1>;"
.Cd "};"
.Sh DESCRIPTION
The
.Nm
device driver implements FreeBSD LED interfaces for the Terasic DE4
8-element LED, which may be written to as described in the FreeBSD
.Xr led 4
man page.
Device nodes appear in
.Pa /dev/led ,
with names using the scheme
.Pa de4led_0 ,
.Pa de4led_1 ,
and so on.
.El
.Sh SEE ALSO
.Xr led 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 10.0 .
.Sh AUTHORS
The
.Nm
device driver and this manual page were
developed by SRI International and the University of Cambridge Computer
Laboratory under DARPA/AFRL contract
.Pq FA8750-10-C-0237
.Pq Do CTSRD Dc ,
as part of the DARPA CRASH research programme.
This device driver was written by
.An Robert N. M. Watson .
