freebsd/freebsd-src/share/man/man4/ucycom.4
.\"-
.\" Copyright (c) 2004 Dag-Erling Coïdan Smørgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/ucycom.4,v 1.4.2.1.6.1 2010/02/10 00:26:20 kensmith Exp $
.\"
.Dd November 22, 2006
.Dt UCYCOM 4
.Os
.Sh NAME
.Nm ucycom
.Nd device driver for Cypress CY7C63743 and CY7C64013 USB to RS232 bridges
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device ucycom"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
ucycom_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the Cypress CY7C63743 and CY7C64013 bridge
chips.
These chips were designed to provide a low-cost transition path to USB
for existing RS232 devices, and have fairly limited capabilities.
.Pp
The
.Nm
driver behaves like a
.Xr tty 4 .
.Sh HARDWARE
The
.Nm
driver currently supports the following devices which incorporate
Cypress USB to RS232 bridge chips:
.Pp
.Bl -bullet -compact
.It
DeLorme Earthmate USB GPS receiver
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 5.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver and this manual page were written by
.An Dag-Erling Sm\(/orgrav Aq des@FreeBSD.org .
