freebsd/freebsd-src/share/man/man4/udbp.4
.\" Copyright (c) 1999
.\"	Nick Hibma <hibma@skylink.it>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY NICK HIBMA AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL NICK HIBMA OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$FreeBSD$
.\"
.Dd April 30, 2000
.Dt UDBP 4
.Os FreeBSD
.Sh NAME
.Nm udbp
.Nd USB Double Bulk Pipe driver
.Sh SYNOPSIS
.Cd "device udbp"
.Sh DESCRIPTION
The
.Nm
driver provides support for host-to-host cables that contain at least two
bulk pipes, one for each direction, like for example the EzLink cable and
the NetChip 1080 chip.
.Pp
It requires netgraph to be avalable. This can be done either by adding
.Cd "options NETGRAPH"
to your kernel configuration file, or alternatively loading
.Nm netgraph
as a module either from
.Pa /boot/loader.conf
or from the command line, before the udbp module.
.Sh EXAMPLE
.Dl options NETGRAPH
.Dl device udbp
.Pp
Add the
.Nm udbp
driver to the kernel.
.Pp
.Dl kldload netgraph
.Dl kldload udbp
.Pp
Load the
.Nm netgraph
module and then the
.Nm udbp
driver.
.Pp
.Dl ngctl mkpeer udbp0: iface data inet
.Dl ifconfig ng0 10.0.0.1 10.0.0.2
.Pp
Create a new network interface node node and connect it's inet hook to the data
hook of the
.Nm udbp
node. Ifconfig configures the resulting network interface ng0 with a local
IP address of 10.0.0.1 and a remote 10.0.0.2. On the remote host the two
IP addresses should of course be reversed.
.Pp
.Sh SEE ALSO
.Xr netgraph 4 ,
.Xr ohci 4 ,
.Xr uhci 4 ,
.Xr usb 4 ,
.Xr ngctl 8 ,
.Xr ng_iface 8 ,
.Sh HISTORY
The
.Nm udbp
driver first appeared in
.Fx 5.0 .
.Sh AUTHORS
The
.Nm udbp
driver was written by
.An Doug Ambrisko Aq ambrisko@whistle.com ,
.An Julian Elischer Aq julian@whistle.com
and
.An Nick Hibma Aq n_hibma@freebsd.org .
.Pp
This manual page was written by
.An Nick Hibma Aq hibma@skylink.it .
