freebsd/freebsd-src/share/man/man4/ufintek.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2025 Diane Bruce
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November, 2025
.Dt UFINTEK 4
.Os
.Sh NAME
.Nm ufintek
.Nd Fintek F81232 USB to serial UART driver
.Sh SYNOPSIS
.Cd "device usb"
.Cd "device ucom"
.Cd "device ufintek"
.Pp
In
.Xr rc.conf 5 :
.Cd kld_list="ufintek"
.Pp
In
.Xr sysctl.conf 5 :
.Cd hw.usb.ufintek.debug=1
.Sh DESCRIPTION
The
.Nm
driver provides support for the F81232 serial adapter from FINTEK.
If the appropriate hardware is detected,
the driver will be loaded automatically by
.Xr devmatch 8 .
To load the driver manually, add it to the
.Ic kld_list
in
.Xr rc.conf 5 ,
or use
.Xr kldload 8
at runtime.
The device is accessed through the
.Xr ucom 4
driver which makes it behave like a
.Xr tty 4 .
.Pp
Call out through this interface with applications like
.Xr cu 1
or
.Xr tip 1 .
.Sh HARDWARE
The
.Nm
driver supports the following USB to serial UART controllers:
.Pp
.Bl -bullet -compact
.It
FT82332
.El
.Sh SYSCTL VARIABLES
These settings can be entered in the
.Xr loader 8
prompt, set in
.Xr loader.conf 5 ,
.Xr sysctl.conf 5 ,
or changed at runtime with
.Xr sysctl 8 :
.Bl -tag -width "hw.usb.uftdi.debug"
.It Va hw.usb.uftdi.debug
Enable debugging messages, default
.Ql 0
.Ql 1
.El
.Sh FILES
.Bl -tag -width "/dev/ttyU*.init" -compact
.It Pa /dev/ttyU*
for callin ports
.It Pa /dev/ttyU*.init
.It Pa /dev/ttyU*.lock
corresponding callin initial-state and lock-state devices
.Pp
.It Pa /dev/cuaU*
for callout ports
.It Pa /dev/cuaU*.init
.It Pa /dev/cuaU*.lock
corresponding callout initial-state and lock-state devices
.El
.Sh SEE ALSO
.Xr cu 1 ,
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver appeared in
.Fx 16.0
.Sh BUGS
This driver is limited to 9600 baud.

