freebsd/freebsd-src/share/man/man4/ufoma.4
.\" Copyright (c) 2006 Takanori Watanabe.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd January 10, 2006
.Dt UFOMA 4
.Os
.Sh NAME
.Nm ufoma
.Nd USB mobile phone support
.Sh SYNOPSIS
.Cd "device ufoma"
.Cd "device ucom"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB mobile phone terminal in the subset of 
Mobile Computing Promotion Consortium USB Implementation Guideline,
which is adopted by FOMA, the NTT DoCoMo 3G system, terminal.
These are partly like CDC ACM model based modem, which is supported
by
.Xr umodem 4 .
But this recognizes specific usb descriptor that describes its role and 
interface structure, and it will negotiate its role when the device is open.

They support a regular AT command set.
The commands can either be multiplexed with the data stream
or handled through separate pipes.
In the latter case the AT
commands have to be given on a device separate from the data device.
.Pp
The device is accessed through the
.Xr ucom 4
driver which makes it behave like a
.Xr tty 4 .

.Sh SYSCTLS
This device often have a few interface sets and these interfaces
have its role, sometimes multiplexed.
These roles are identified with following sysctl MIB.
.Bl -tag -width indent
.It Va dev.ucom.%d.supportmode
The modes which is supprted by the interface.
.It Va dev.ucom.%d.currentmode
Current mode of the interface.
.It Va dev.ucom.%d.openmode
Mode to transit when the device is open next.
.El
The mode is as follows.
.Bl -tag -width indent
.It modem
Accepts AT commands and go and pass packet communication data.
.It handsfree
Accepts AT commands but it does not pass data.
.It obex
Accepts OBEX frame which is used to exchange telephone book, etc.
.It vendor1
.It vendor2
Vendor specific data may passed.
.It deactivated
When a interface is recognized to the system and not used, the interface
will set to this mode. 
.It unlinked
When a interface is not yet negotiated, the interface is in this mode.
.El 
.Sh HARDWARE
Devices supported by the
.Nm
driver include:
.Pp
.Bl -bullet -compact
.It
SHARP FOMA SH902i
.It
KYOCERA PHS AH-K3001V (a.k.a Kyopon)
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr umodem 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Fx 7-CURRENT, partly from
.Xr umodem 4
code.
.Sh BUGS
Interfaces with multiplexed commands and data and interfaces with
commands only are supported.
