freebsd/freebsd-src/share/man/man4/ugold.4
.\"
.\" SPDX-License-Identifier: ISC
.\"
.\"	$OpenBSD: ugold.4,v 1.1 2013/09/06 08:39:39 mpi Exp $
.\"
.\" Copyright (c) 2013 Takayoshi SASANO <sasano@openbsd.org>
.\" Copyright (c) 2013 Martin Pieuchot <mpi@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd September 21, 2026
.Dt UGOLD 4
.Os
.Sh NAME
.Nm ugold
.Nd TEMPer gold HID thermometer
.Sh SYNOPSIS
.Cd device usb
.Cd device hid
.Cd device ugold
.Pp
In
.Xr loader.conf 5 :
.Cd ugold_load="YES"
.Sh DESCRIPTION
The
.Nm
driver provides support for pcsensors TEMPer gold devices.
.Pp
The driver possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface.
.Sh HARDWARE
The
.Nm
driver supports the following HID thermometers:
.Pp
.Bl -bullet -compact
.It
RDing TEMPer1V1.2
.El
.Sh SEE ALSO
.Xr usb 4 ,
.Xr sysctl 8
