freebsd/freebsd-src/share/man/man4/umass.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 1999
.\"	Nick Hibma <n_hibma@FreeBSD.org>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 28, 2025
.Dt UMASS 4
.Os
.Sh NAME
.Nm umass
.Nd USB Mass Storage Devices driver
.Sh SYNOPSIS
.Cd "device da"
.Cd "device scbus"
.Cd "device pass"
.Cd "device usb"
.Cd "device umass"
.Pp
In
.Xr loader.conf 5 :
.Cd umass_load
.Sh DESCRIPTION
The
.Nm
driver provides support for Mass Storage devices that attach to the USB
interface.
.Pp
If the appropriate hardware is detected,
the driver will be loaded automatically by
.Xr devmatch 8 .
To load the driver manually at boot time, use the
.Cm umass_load
command at the
.Xr loader 8
prompt, or add it to
.Xr loader.conf 5 .
.Pp
To use the driver in a custom kernel,
.Xr usb 4
and at least one of
.Xr uhci 4 ,
.Xr ohci 4 ,
.Xr ehci 4 ,
or
.Xr xhci 4
must be configured in the kernel.
Additionally, since
.Nm
uses the SCSI subsystem and sometimes acts as a SCSI device, it
requires
.Xr da 4
and
.Xr scbus 4
to be included in the kernel.
.Sh HARDWARE
The
.Nm
driver supports USB Mass Storage devices such as:
.Pp
.Bl -bullet -compact
.It
USB thumb drives
.It
USB hard disk drives
.It
USB floppy drives
.El
.Pp
The
.Nm
driver tries its best to avoid issues with the drives, not all issues
can be handled automatically, so quirks may be necessary.
See the
.Em USB Mass Sotrage quirks
section of
.Xr usb_quirk 4
for quirks for the drives.
The
.Cd add_dev_quirk_vplh
and
.Cd add_quirk
commands of
.Xr usbconfig 8
can manage these dynamically.
Quirks can be specified via tuables, as described in
.Xr usb_quirk 4 .
.Sh EXAMPLES
Rescan all slots on a multi-slot flash reader,
where the slots map to separate LUNs on a single SCSI ID:
.Bd -literal -offset indent
camcontrol rescan 0:0:0
camcontrol rescan 0:0:1
camcontrol rescan 0:0:2
camcontrol rescan 0:0:3
.Ed
.Pp
Typically only the first slot will be enabled at boot time.
This assumes that
the flash reader is the first SCSI bus in the system and has 4 slots.
.Sh SEE ALSO
.Xr cfumass 4 ,
.Xr ehci 4 ,
.Xr ohci 4 ,
.Xr uhci 4 ,
.Xr usb 4 ,
.Xr usb_quirk 4 ,
.Xr xhci 4 ,
.Xr camcontrol 8 ,
.Xr usbconfig 8 .
.Sh HISTORY
The
.Nm
driver appeared in
.Fx 4.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An MAEKAWA Masahide Aq Mt bishop@rr.iij4u.or.jp
and
.An Nick Hibma Aq Mt n_hibma@FreeBSD.org .
.Pp
This manual page was written by
.An Nick Hibma Aq Mt n_hibma@FreeBSD.org .
