freebsd/freebsd-src/share/man/man4/umct.4
.\"
.\" Copyright (c) 2004 Scott Long
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/umct.4,v 1.7.12.1 2010/02/10 00:26:20 kensmith Exp $
.\"
.Dd November 22, 2006
.Dt UMCT 4
.Os
.Sh NAME
.Nm umct
.Nd Magic Control Technology USB-RS232 converter driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device umct"
.Cd "device ucom"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
umct_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for USB to RS-232 converters based on the Magic
Control Technology USB-232 design.
These devices support most of the
standard RS-232 features including baud rates ranging from 300 to 115200
bits per second.
However, neither hardware nor software flow control
seems to be supported.
.Pp
Access to devices under this driver is via the
.Xr ucom 4
framework and device nodes.
.Sh HARDWARE
The
.Nm
driver supports the following adapters:
.Pp
.Bl -bullet -compact
.It
Belkin F5U109
.It
Belkin F5U409
.It
D-Link DU-H3SP USB BAY Hub
.It
Magic Control Technology USB-232
.It
Sitecom USB-232
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Fx 5.2 .
It is loosely based on the
.Xr ubsa 4
driver by
.An Alexander Kabaev Aq kan@FreeBSD.org
with documentation from
.An Wolfgang Grandeggar Aq wolfgang@cec.ch .
.Sh AUTHORS
The
.Nm
driver was written by
.An Scott Long Aq scottl@FreeBSD.org .
