freebsd/freebsd-src/share/man/man4/ums.4
.\" Copyright (c) 1999
.\"	Nick Hibma <hibma@skylink.it>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY NICK HIBMA AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL NICK HIBMA OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$FreeBSD$
.\"
.Dd April 11, 1999
.Dt UMS 4 i386
.Os FreeBSD
.Sh NAME
.Nm ums
.Nd USB mouse driver
.Sh SYNOPSIS
.Cd "device ums0"
.Sh DESCRIPTION
The
.Nm
driver provides support for mice that attach to the USB port. Supported are
mice with any number of buttons and mice with a wheel.
.Nm usb
and one of
.Nm uhci
or
.Nm ohci
must be configured in the kernel as well.
.Pp
The /dev/ums device presents the mouse as a
.Nm sysmouse
type device, and can be used through
.Nm moused
(see example below).
.Sh FILES
.Bl -tag -width /dev/ums0 -compact
.It Pa /dev/ums0
blocking device node
.Sh EXAMPLE
.Dl device ums0
.Pp
Add the
.Nm ums
driver to the kernel.
.Sh SEE ALSO
.Xr uhci 4 ,
.Xr ohci 4 ,
.Xr usb 4 ,
.Xr moused 8 ,
.Xr sysmouse 4
.\".Sh HISTORY
.Sh AUTHOR
The
.Nm ums
driver was written by
.An Lennart Augustsson Aq augustss@cs.chalmers.se
for NetBSD and was adapted for FreeBSD by
.An MAEKAWA Masahide Aq bishop@rr.iij4u.or.jp .
.Pp
This manual page was written by
.An Nick Hibma Aq hibma@skylink.it .
