freebsd/freebsd-src/share/man/man4/virtio_scsi.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2012 Bryan Venteicher
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 29, 2026
.Dt VIRTIO_SCSI 4
.Os
.Sh NAME
.Nm virtio_scsi
.Nd VirtIO SCSI driver
.Sh SYNOPSIS
.Cd device virtio_scsi
.Pp
In
.Xr loader.conf 5 :
.Cd hw.vtscsi.bus_reset_disable
.Cd virtio_scsi_load="YES"
.Pp
In
.Xr loader.conf 5
or
.Xr sysctl.conf 5 :
.Cd hw.vtscsi.%d.debug_level
.Sh HARDWARE
The
.Nm
device driver provides support for VirtIO SCSI devices.
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Bl -tag -width "xxxxxx"
.It Va hw.vtscsi.bus_reset_disable
In the initial QEMU release with VirtIO SCSI support, in-flight
operations were not aborted when stopping the device, rendering
bus reset ineffective.
This tunable disables attempts to issue reset bus commands.
The default value is 1.
.El
.Sh SYSCTL VARIABLES
The following variables can be entered at the
.Xr loader 8
prompt, set in
.Xr loader.conf 5 ,
.Xr sysctl.conf 5 ,
or changed at runtime with
.Xr sysctl 8 :
.Bl -tag -width indent
.It Va hw.vtscsi.%d.debug_level
Enable debugging prints.
The following bits have the described effects:
.Bl -tag -width indent -offset indent
.It 0x01
Enable informational prints.
.It 0x02
Enable prints for driver errors.
.It 0x04
Enable tracing prints.
.El
.El
.Sh SEE ALSO
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 10.0 .
.Sh AUTHORS
.An Bryan Venteicher Aq Mt bryanv@FreeBSD.org .
