freebsd/freebsd-src/share/man/man4/watchdog.4

.\" Copyright (c) 2003  Sean M. Kelly <smkelly@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/watchdog.4,v 1.1 2003/06/26 09:50:51 smkelly Exp $
.\"
.Dd June 25, 2003
.Dt WATCHDOG 4
.Os
.Sh NAME
.Nm watchdog
.Nd Software watchdog
.Sh SYNOPSIS
.Cd options WATCHDOG
.Sh DESCRIPTION
.Nm
is a set of checks and routines which allow the implementation of a software
watchdog solution.
.Pp
The user interface for
.Nm
is implemented via a trio of sysctl OIDs.
When
.Li debug.watchdog.enabled
is set to a positive value,
.Nm
timeout checks are performed.
In order to keep the watchdog from triggering,
.Li debug.watchdog.reset
must be accessed,
by reading or writing,
within every
.Li debug.watchdog.timeout
seconds.
Failure to keep the
.Nm
updated will result in the kernel outputting interrupt counts,
backtraces,
and then attempting to enter
.Xr ddb 9 .
.Sh SEE ALSO
.Xr sysctl 8 ,
.Xr watchdogd 8
.Sh HISTORY
The
.Nm
code first appeared in
.Fx 5.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
code and manual page were written by
.An Sean Kelly Aq smkelly@FreeBSD.org .
Some contributions were made by
.An Jeff Roberson Aq jeff@FreeBSD.org .
