freebsd/freebsd-src/share/man/man4/watchdog.4
.\" Copyright (c) 2004 Poul-Henning Kamp <phk@FreeBSD.org>
.\" Copyright (c) 2003, 2004 Sean M. Kelly <smkelly@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd June 25, 2003
.Dt watchdog 4
.Os
.Sh NAME
.Nm watchdog
.Nd Hardware and Software watchdog
.Sh SYNOPSIS
.Cd options CPU_ELAN
.Cd options CPU_GEODE
.Cd options SW_WATCHDOG
.Pp
.In sys/watchdog.h
.Bd -literal

u_int u = WD_ACTIVE | WD_8SEC;
int fd = open("/dev/" _PATH_WATCHDOG, O_RDWR);

ioctl(fd, WDIOCPATPAT, &u);
.Ed
.Sh DESCRIPTION
.Nm
is a facility for controlling hardware and software watchdog facilities.
.Pp
The interface is through a device named "/dev/"
.Dv _PATH_WATCHDOG
which
responds to a single ioctl call,
.Dv WDIOCPATPAT .
.Pp
The ioctl call takes an argument which consists of a timeout value
specified as an integer power of two nanoseconds.
.Pp
The
.Dv WD_ACTIVE
flag signals that the watchdog will be kept from 
timing out from userland, for instance by the
.Xr watchdogd 8
daemon.
.Pp
To disable the watchdogs, use an argument of zero.
.Pp
The ioctl call will return success if just one of the available
watchdog implementations support the request.
If the ioctl fails, for instance if no watchdog supports the timeout
length, all watchdogs are disabled and must be explicitly reenabled.
.Sh SEE ALSO
.Xr watchdogd 8 ,
.Xr watchdog 9
.Sh HISTORY
The
.Nm
code first appeared in
.Fx 5.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm watchdog
facility were written by
.An Poul-Henning Kamp Aq phk@FreeBSD.org .
.Pp
The
.Nm SW_WATCHDOG
code and manual page were written by
.An Sean Kelly Aq smkelly@FreeBSD.org .
Some contributions were made by
.An Jeff Roberson Aq jeff@FreeBSD.org .
