freebsd/freebsd-src/share/man/man4/wdatwd.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2022 Tetsuya Uemura <t_uemura@macome.co.jp>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 18, 2022
.Dt WDATWD 4
.Os
.Sh NAME
.Nm wdatwd
.Nd device driver for the ACPI WDAT based watchdog interrupt timer
.Sh SYNOPSIS
.Cd device wdatwd
.Pp
In
.Xr loader.conf 5 :
.Cd wdatwd_load="YES"
.Sh DESCRIPTION
The
.Nm
driver provides
.Xr watchdog 4
support for the watchdog interrupt timer in ACPI WDAT (Watchdog Action Table).
.Pp
Since WDAT itself is an abstraction for the real hardware such as ICH WDT, it
must be noted that only one driver can be used at a time, either the real
hardware specific driver or this driver.
.Sh SYSCTL VARIABLES
The following read-only
.Xr sysctl 8
variables are available:
.Bl -tag -width indent
.It Va dev.wdatwd.%d.running
The status of the watchdog timer. 0 if not running, or 1 if running.
.It Va dev.wdatwd.%d.timeout
The current value of the watchdog timeout in millisecond.
This can be 0 on some systems, and the zero value means that the default
timeout is used.
.It Va dev.wdatwd.%d.timeout_configurable
Whether the timeout is configurable or not.
It is 0 if configurable or any positive value if not.
.It Va dev.wdatwd.%d.timeout_default
The default value of the watchdog timeout in millisecond if any.
.El
.Sh SEE ALSO
.Xr ichwd 4 ,
.Xr watchdog 4 ,
.Xr watchdog 8 ,
.Xr watchdogd 8 ,
.Xr watchdog 9
.Rs
.%T Hardware Watchdog Timers Design Specification
.%R Requirements for Hardware Watchdog Timers Supported by Microsoft(R) Windows Vista(R) and Microsoft Windows Server(R) 2008 Operating Systems
.%A Microsoft Corporation
.%U http://msdn.microsoft.com/en-us/windows/hardware/gg463320.aspx
.%D 2006
.Re
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Tetsuya Uemura Aq Mt t_uemura@macome.co.jp
of MACOME, Corporation.
