freebsd/freebsd-src/share/man/man4/worm.4
.Dd March 2, 1995
.Dt PT 4
.Os FreeBSD
.Sh NAME
.Nm worm
.Nd scsi Write-Once driver
.Sh SYNOPSIS
.Nm device worm0 at scbus?
.Sh DESCRIPTION
The
.Xr worm
driver provides preliminary support for a 
SCSI Write-Once type device.
.Pp
It is unlikely that this driver works yet.  Jordan will test
it for us.
.Pp
A scsi adapter must be separately configured into the system
before this driver can be used.
.Pp
This device only supports
.Xr read 2
and
.Xr write 2 ,
and the general scsi ioctl calls.  There are no partitions yet; the entire
drive is treated as a single raw device.  There are no block devices yet
so you can't mount a file system with this.  That will have to wait for
the partition code to be cleaned up.
.Sh IOCTLS
The 
.Nm
driver has no ioctls of it's own but rather acts as a medium for the
generic 
.Xr scsi 4
ioctls. These are described in
.Em sys/scsiio.h.
.Sh FILES
.Bl -tag -width /dev/worm -compact
.It Pa /dev/worm[0-255]
worm{x} is the  'xth' Write-Once device.
.El
.Sh DIAGNOSTICS
.Pp
It is unlikely that this driver actually works.
.Pp
There will be no partition code until Bruce finishes his slice work.
.Pp
There will be no block devices until the partition code is done.
.Pp
There will be no kernel "devconf" code until that is treated cleanly
across the SCSI system.
.Pp
The
.Em "at scbus?"
is required in the config file for the configuration
system to know this is a SCSI device and generate the appropriate
tables.
.Pp
The 0 in 
.Em worm0
in the configuration is required.
This is a bug in 
.Xr config 8 .
.Pp
All
.Xr scsi 4
debug ioctls work on 
.Nm
devices.
.Sh SEE ALSO
.Xr sd 4
.Xr st 4
.Xr cd 4
.Xr ch 4
.Xr su 4
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver appeared in FreeBSD 2.1
