freebsd/freebsd-src/share/man/man4/wsp.4
.\" Copyright (c) 2014 Hans Petter Selasky <hselasky at freebsd dot org>.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 9, 2021
.Dt WSP 4
.Os
.Sh NAME
.Nm wsp
.Nd Wellspring touchpad driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines into
your kernel configuration file:
.Bd -ragged -offset indent
.Cd "device wsp"
.Cd "device hid"
.Cd "device usb"
.Ed
.Pp
Alternatively, to load the driver as a module at boot time,
place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
wsp_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the Apple Internal Trackpad
device found in many Apple laptops.
.Pp
The driver simulates a three-button mouse using multi-finger tap
detection.
A single-finger press generates a left button click.
A two-finger tap maps to the right button; whereas a three-finger tap
gets treated as a middle button click.
.Pp
.Nm
supports dynamic reconfiguration using
.Xr sysctl 8
through nodes under
.Nm hw.usb.wsp .
Pointer sensitivity can be controlled using the sysctl tunable
.Nm hw.usb.wsp.scale_factor .
Tap to left-click can be controlled using the sysctl tunable
.Nm hw.usb.wsp.enable_single_tap_clicks
with 0 disabling single tap clicks and 1 enabling them (default).
Movement on the trackpad following a partially-released click can be
controlled using the sysctl tunable
.Nm hw.usb.wsp.enable_single_tap_movement ,
with 0 to disable the movement on the trackpad until a full release
or 1 to allow the continued movement (default).
.Nm hw.usb.wsp.max_finger_area
defines the maximum area on the trackpad which is registered as a
finger (lower for greater palm detection).
.Nm max_scroll_finger_distance
defines the maximum distance between two fingers where z-axis
movements are registered.
.Nm hw.usb.wsp.max_double_tap_distance
defines the maximum distance between two finger clicks or taps which may
register as a double-click.
.Nm hw.usb.wsp.scr_hor_threshold
defines the minimum required horizontal movement to register as a forward
/back button click.
Z-Axis sensitivity can be controlled using the sysctl tunable
.Nm hw.usb.wsp.z_factor .
Z-Axis inversion can be controlled using the sysctl tunable
.Nm hw.usb.wsp.z_invert ,
set to 0 to disable (default) or 1 to enable inversion.
.Pp
.Nm
may use evdev data (if enabled during kernel compilation) for gesture support
using the
.Xr sysctl 8
value
.Nm kern.evdev.rcpt_mask .
On most MacBooks, setting this value to 3 enables gestures, while 12
disables them.
.Sh FILES
.Nm
creates a blocking pseudo-device file,
.Pa /dev/wsp0 ,
which presents the mouse as a
.Em sysmouse
or
.Em mousesystems
type device--see
.Xr moused 8
for an explanation of these mouse
types.
.Sh SEE ALSO
.Xr sysmouse 4 ,
.Xr usb 4 ,
.Xr loader.conf 5 ,
.Xr xorg.conf 5 Pq Pa ports/x11/xorg ,
.Xr moused 8 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Huang Wen Hui Aq Mt huanghwh@gmail.com .
