freebsd/freebsd-src/sbin/atacontrol/atacontrol.8
.\"
.\" Copyright (c) 2000,2001 Søren Schmidt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd December 8, 2000
.Dt ATACONTROL 8
.Os FreeBSD
.Sh NAME
.Nm atacontrol
.Nd
ATA device driver control program
.Sh SYNOPSIS
.Nm 
.Aq Ar command
.Op channel [args]

.Nm
.Ic attach
.Op channel
.Nm
.Ic detach
.Op channel
.Nm
.Ic reinit
.Op channel
.Nm
.Ic mode
.Op channel
.Op mastermode slavemode
.Nm
.Ic info
.Op channel

.Sh DESCRIPTION
.Nm
is a control program that provides the user access and control to the
.Fx 
ATA subsystem.
.Pp
.Nm
can cause severe system crashes and loss of data if used improperly, please
exercise caution when using this command!.
.Pp
.Nm
supports the following commands:
.Pp
.Bl -tag -width 8n
.It Ic attach 
Attach an ATA channel, devices on the channel are probed and attached as
is done on boot.
.Pp
.It Ic detach
Detach an ATA channel, devices on the channel are removed from the kernel,
and all outstanding tranfers etc are returned back to the system marked
as failed.
.Pp
.It Ic reinit
Reinitialize an ATA channel. Both devices on the channel are reset and
initialized to the parameters the ATA driver has stored internally.
Devices that has gone bad and no longer responds to the probe, or devices
that has physically been removed are removed from the kernel. Likewise
are devices that show up during a reset, probed and attached.
.Pp
.It Ic mode 
Without the two mode arguments the current transfer modes of both
devices are printed. If the mode arguments are given, the ATA driver
is asked to change the transfer modes to those given. The ATA driver
will reject modes that is not supported by the hardware.
Modes are given like PIO3, udma2, udma100, case does not matter.
.Pp
.It Ic info
Show info on the device on the channel, currently only the device
name and manufacture/version strings are shown.
.Pp
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 5.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An S\(/oren Schmidt
.Aq sos@FreeBSD.org .
.Pp
This manual page was written by
.An S\(/oren Schmidt
.Aq sos@FreeBSD.org .
