freebsd/freebsd-src/usr.sbin/devinfo/devinfo.8
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2002 Hiten Pandya
.\" Copyright (c) 2002 Robert N. M. Watson
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2026
.Dt DEVINFO 8
.Os
.Sh NAME
.Nm devinfo
.Nd print information about system device configuration
.Sh SYNOPSIS
.Nm
.Op Fl rv
.Nm
.Fl p Ar dev Op Fl v
.Nm
.Fl u Op Fl v
.Sh DESCRIPTION
The
.Nm
utility, without any arguments, shows the hierarchy of devices available
in the system, starting from the
.Dq nexus
device.
.Pp
The following options are accepted:
.Bl -tag -width indent
.It Fl p Ar dev
Display the path of
.Ar dev
back to the root of the device tree.
.Ar dev
can either be a device name,
the absolute path of an ACPI handle
.Po must begin with a
.Dq \e
.Pc ,
or a PCI selector
.Po
either
.Sy pci Ns Fa domain Ns : Ns Fa bus Ns : Ns Fa slot Ns : Ns Fa function
or
.Sy pci Ns Fa bus Ns : Ns Fa slot Ns : Ns Fa function
.Pc .
.Pp
If
.Fl v
is specified,
each device is output on a separate line including the device name and
additional verbose information;
otherwise, a space-separated list of device names is output.
.It Fl r
Causes hardware resource information
.Pq such as IRQ, I/O ports, I/O memory addresses
to be also listed, under each device that has reserved those resources.
.It Fl u
Displays the same information as with
.Fl r
but sorts by resource type rather than by device, allowing to review the
set of system resources by usage and available resources.
I.e., it lists all
the IRQ consumers together.
.It Fl v
Display all devices in the driver tree, not just those that are attached or
busy.
Without this flag, only those devices that have attached are reported.
This flag also displays verbose information about each device.
.El
.Sh SEE ALSO
.Xr systat 1 ,
.Xr devinfo 3 ,
.Xr devctl 8 ,
.Xr iostat 8 ,
.Xr pciconf 8 ,
.Xr vmstat 8 ,
.Xr devclass 9 ,
.Xr device 9
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.0 .
.Sh AUTHORS
.An Mike Smith Aq Mt msmith@FreeBSD.org
