freebsd/freebsd-src/eBones/man/tcom.8
.\" from: tcom.8,v 4.2 89/05/03 14:34:53 jtkohl Exp $
.\" $Id: tcom.8,v 1.2 1994/07/19 19:28:04 g89r4222 Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <Copyright.MIT>.
.\"
.TH TCOM 8  "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
tcom \- control operation of server tftp daemon
.SH SYNOPSIS
tcom
.SH DESCRIPTION
.I Tcom
is a program to control the execution of the server trivial file transfer
daemon.  It sends user commands to the daemon by writing them into a
shared file and signalling the daemon; it watches the daemon's log to
obtain the results of the commands.  The following commands are supported:
.TP 20
help
display a list of commands
.TP
input trace on|off
turn tracing of input packets on or off
.TP
output trace on|off
turn tracing of output packets on or off
.TP
trace on|off
turn all packet tracing on or off
.TP
times
display server parent and children process times
.TP
uptime
display daemon up time
.TP
exit
force daemon to shut down and exit
.SH FILES
.TP 20
/tftpd/lock
lock file containing daemon's PID
.TP
/tftpd/command
command file to daemon
.TP
/tftpd/slog
daemon's log file
.SH "SEE ALSO"
tftpd (8)
.SH BUGS
Two tcom's running at the same time will result in chaos.  Also,
watching the daemon's log file uses a lot of CPU time.
