freebsd/freebsd-src/eBones/man/tftpd.8
.\" from: tftpd.8,v 4.1 89/01/23 11:36:12 jtkohl Exp $
.\" $Id: tftpd.8,v 1.2 1994/07/19 19:28:08 g89r4222 Exp $
.\" Copyright 1989 by the Massachusetts Institute of Technology.
.\"
.\" For copying and distribution information,
.\" please see the file <Copyright.MIT>.
.\"
.TH TFTPD 8  "Kerberos Version 4.0" "MIT Project Athena"
.SH NAME
tftpd \- server tftp daemon
.SH SYNOPSIS
.B /etc/tftpd
.SH DESCRIPTION
.I Tftpd
is a daemon which runs the trivial file transfer protocol server for the
MIT Internet software.  It listens for incoming connections, and forks a
child to perform each requested transfer.  It uses the directory
.IR /tftpd ;
the file
.I lock
in that directory is used to prevent two daemons from becoming
active simultaneously; it also contains the daemon's process ID,
which is used by the tftp command program
.IR tcom (8)
to control the daemon's operation.
.SH FILES
.br
.TP 20n
/tftpd/lock
interlock, PID storage
.TP
/dev/net
the network device
.i0
.dt
.SH "SEE ALSO"
tftp (1), tcom (8)
.br
\fIInternet Protocol Handbook\fR
