freebsd/freebsd-src/usr.sbin/lptcontrol/lptcontrol.8
.\"
.\" lptcontrol - a utility for manipulating the lpt driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\" $Id: lptcontrol.1,v 1.3 1994/05/22 12:31:54 csgr Exp $
.TH lptcontrol 1 "March 12, 1994" "" "FreeBSD"

.SH NAME
lptcontrol - a utility for manipulating the lpt printer driver.
.SH SYNOPSIS
.na
.B lptcontrol
.RB [options]
.SH DESCRIPTION
The
.B lptcontrol
command is used to set either the interrupt-driven or polling mode
of individual lpt devices.  When a printer is switched between
interrupt-driven and polled mode, this change will only take effect
the next time the device is opened.
.SH OPTIONS
.TP
The following command line options are supported.
.TP
.B \-i
Turns on interrupt-driven mode.
.TP
.B \-p
Turns on polled mode.
.TP
.BI "\-f\ " file
Sets the mode of the printer device specified by
.I file.
The default value for 
.I file
is
.I /dev/lpt0
.TP
One of 
.B \-i
or
.B \-p
must be specified.
.PP
.SH FILES
/dev/lpt?
.PP
.SH BUGS
If the port to be controlled does not have a printer connected and
on-line, then lptcontrol will not be able to open the port in question
for performing ioctl's and will fail.
.sp
Sure to be others.
.SH "SEE ALSO"
.BR lpt (4) ,
.BR /sys/i386/conf/GENERICAH
.SH AUTHOR
Geoffrey M. Rehmet
