freebsd/freebsd-src/usr.sbin/lptcontrol/lptcontrol.8
.\"
.\" lptcontrol - a utility for manipulating the lpt driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\" $Id: lptcontrol.8,v 1.7 1998/03/23 08:23:49 charnier Exp $
.Dd September 3, 1994
.Dt LPTCONTROL 8
.Os FreeBSD 2
.Sh NAME
.Nm \&lptcontrol 
.Nd a utility for manipulating the lpt printer driver
.Sh SYNOPSIS
.Nm \&lptcontrol
.Cm -i
|
.Cm -p
|
.Cm -e
.Op Fl d Ar device
.Sh DESCRIPTION
The
.Nm
command is used to set either the interrupt-driven, extended or polling mode
of individual 
.Xr lpt 4
devices.  When a printer is switched from
a mode to another, this change will only take effect
the next time the device is opened.
.Pp
Extended mode is anything the parallel port interface can support. For an
ECP/ISA parallel port, it may be FIFO+DMA or ECP.
.Sh OPTIONS
.TP
The following command line options are supported:
.Bl -tag -width indent 
.It Fl i
Turn on interrupt-driven mode.
.It Fl p
Turn on polled mode.
.It Fl e
Turn on extended mode.
.It Fl d Ar dev
Set the mode of the printer device specified by
.Em dev .
The default value for 
.Em dev
is
.Em /dev/lpt0
.El
.Pp
One of 
.Fl i
,
.Fl p
or
.Fl e
must be specified.
.Pp
.Sh FILES
.Bl -tag -width /sys/i386/conf/GENERIC -compact
.It Pa /dev/lpt?
Printer devices.
.It Pa /dev/lpctl?
Printer control devices.
.It Pa /sys/i386/conf/GENERIC
Kernel configuration file.
.El
.Sh BUGS
Sure to be some.
.Sh "SEE ALSO"
.Xr lpt 4 
.Sh AUTHORS
.An Geoffrey M. Rehmet
.Sh HISTORY
.Nm Lptcontrol
first appeared in
.Fx 1.1.5
