freebsd/freebsd-src/usr.sbin/adduser/addgroup.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: addgroup.8,v 1.5 1997/02/22 16:01:15 peter Exp $

.Dd October 30, 1996
.Dt ADDGROUP 8
.Os FreeBSD 2.2
.Sh NAME
.Nm addgroup
.Nd add a group or add users to a group
.Sh SYNOPSIS
.Nm 
.Op Fl g Ar gid 
.Ar group 
.Op Ar user Ns , Ns Ar user,...
.Sh DESCRIPTION
The
.Nm 
command adds a group to the
.Xr group 5
database.
The optional
.Ar user
is added to the group membership list.
The
.Ar user
argument may be a comma separated list of user names.
If 
.Ar group
already exists 
.Nm
add
.Ar user
to the
.Ar group .
.Sh OPTIONS
.Bl -tag -width Ds
.It Sy -g gid
Create new group with group id
.Ar gid
if possible or the next higher id that is available. Default gid is 1000. 
This option only applies to new groups. 
.El
.Sh EXAMPLES
.Pp
$ addgroup -g 5000 cracau
.Pp
Add group `cracau' with group identification 5000 or higher.
.Pp
$ addgroup foo blech,bar
.Pp
Add user `blech' and user `bar' to group `foo'. Create group
`foo' if it does not exist.
.Sh SEE ALSO
.Xr group 5 ,
.Xr adduser 8 ,
.Xr rmgroup 8 ,
.Xr rmuser 8
.Sh HISTORY
The
.Nm
command appeared in
.Fx 2.2 .
