freebsd/freebsd-src/usr.sbin/adduser/adduser.8
.\"
.\" (c) Copyright 1995 Wolfram Schneider. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"   This product includes software developed by Wolfram Schneider
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" /usr/sbin/adduser - add new user(s)
.\"
.\" Bugs: sure (my english!)
.\"   Email: Wolfram Schneider <wosch@cs.tu-berlin.de>
.\"
.\" $Id: adduser.8,v 1.4 1995/01/08 17:40:20 w Exp w $
.\"

.Dd Jan, 9, 1995
.Dt ADDUSER 8
.Os FreeBSD 2.1
.Sh NAME
.Nm adduser
.Nd command for adding new users

.Sh DESCRIPTION
.Nm Adduser 
is a simple program for adding new users. Adduser check
passwd, group and shell database. It create passwd/group entry,
HOME-directory, dotfiles and send new user a welcome message.

.Sh RESTRICTION
.Bl -tag -width Ds -compact
.It Sy username
Login name. Only lowercase characters or digits.
.It Sy fullname
Firstname an surname. 
.Ql Pa \:
not allowed.
.It Sy shell
Only valid shells from shell database. 
.It Sy uid
Automatic generated.
.It Sy gid
Automatic generated. Gid and uid are equal (if possible). Groupname
is the same as username.
.El

.Sh CONFIGURATION
.Bl -tag -width Ds -compact
.It Sy 1.
Read intern variables.
.It Sy 2.
Read config file (/etc/adduser.conf)
.It Sy 3.
Parse command line options
.El

.Sh OPTIONS
.Bl -tag -width Ds
.It Fl help
Print options and exit.
.It Fl silent
Few warnings, question, bugreports. 
.It Fl verbose
Many warning, question. Recommended for noivice users.
.It Fl debug
Debuging.
.It Fl noconfig
Do not read config file.
.It Fl home Ar partition
Default home partition where all users located.
.It Fl shell Ar shell 
Default shell for new users.
.It Fl dotdir Ar directory
Copy files from .Ar directory into the HOME-directory of new users.
.Ql Pa dot.foo
files renamed to 
.Ql Pa .foo
Don't copy files if
.Ar directory 
equal with 
.Ar no
.It Fl message Ar file
Send new users a welcome message.
Don't send message if
.Ar file 
equal with
.Ar no
.It Fl create_conf
Create new config and message file and exit. 

.Sh FORMATS
.Bl -tag -width Ds -compact
.Ql Pa #
is a commemt.  

.P
.It Sy config file
.Nm Adduser
read and write this file. 
See /etc/adduser.conf for more details.
.It Sy message file
Eval variables in this file. See /etc/adduser.message for more
details.
.El

.Sh FILES
.Bl -tag -width /etc/master.passwdxx -compact
.It Pa /etc/master.passwd
user database
.It Pa /etc/group
group database
.It Pa /etc/shells
shell database
.It Pa /etc/adduser.conf
config file for adduser
.It Pa /etc/adduser.message
message file for adduser
.It Pa /usr/share/skel
skeletal login directory
.It Pa /var/log/adduser
logfile for adduser
.El

.Sh SEE ALSO
.Xr chpass 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr aliases 5 ,
.Xr passwd 5 ,
.Xr group 5 ,
.Xr shells 5 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8

.\" .Sh BUGS

.Sh HISTORY
The
.Nm
command appeared in FreeBSD 2.1

.\" .Sh AUTHOR
.\" Wolfram Schneider, Berlin
