freebsd/freebsd-src/usr.sbin/adduser/adduser.8

.\"  Copyright (c) 1994 GB Data Systems
.\"  All rights reserved.
.\"  Redistribution and use in source and binary forms, with or without
.\"  modification, are permitted provided that the following conditions
.\"  are met:
.\"  1. Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\"  2. Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"  3. The name of the Author may not be used to endorse or promote products 
.\"     derived from this software without specific prior written permission.
.\"  THIS SOFTWARE IS PROVIDED BY GB DATA AND CONTRIBUTORS ``AS IS'' AND
.\"  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\"  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\"  ARE DISCLAIMED.  IN NO EVENT SHALL GB DATA OR CONTRIBUTORS BE LIABLE
.\"  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\"  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\"  OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\"  HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\"  LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\"  OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF    
.\"  SUCH DAMAGE.

.\" $Id: adduser.1,v 1.3 1994/12/28 17:27:21 gclarkii Exp $

.Dd December 28, 1994
.Dt ADDUSER 1
.Os FreeBSD 

.Sh NAME
.Nm adduser

.Sh SYNOPSIS
.Nm

.Sh DESCRIPTION
.Nm
is a Perl script for adding users under a BSD system.  It has the ability to
keep track of the current userid and increment this automaticly.  It can
also use a default group id.
.Ss SETUP
In the normal course of usage there is no setup needed.  If you wish to use
auto-increment mode, you must do two things.

.Bl -enum -compact  
.It 
Change the variable in 
.Pa /etc/adduser.conf
to allow for the auto-increment
.It 
Change the file 
.Pa /etc/userids
to show the current id number.
.El

To use the default group id, just change the variable in 
.Pa /etc/adduser.conf 
to reflect the group that you wish as a default.

.Sh FILES
.Pa /etc/adduser.conf
.Pa /etc/userids
.Pa /usr/share/skel/*

.Sh SEE ALSO
.Xr adduser 8
.Xr perl 1

.Sh HISTORY
The adduser command appeared in FreeBSD 2.0C (12-94).



