freebsd/freebsd-src/usr.sbin/bsdconfig/bsdconfig.8
.\" Copyright (c) 2012 Ron McDowell
.\" Copyright (c) 2012-2013 Devin Teske
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\"            docsinstall
.\"            password
.\"            diskmgmt
.\"            usermgmt
.\"              useradd
.\"              useredit
.\"              userdel
.\"            groupmgmt
.\"              groupadd
.\"              groupedit
.\"              groupdel
.\"            console
.\"              syscons_font
.\"              syscons_keymap
.\"              syscons_repeat
.\"              syscons_saver
.\"              syscons_screenmap
.\"              syscons_ttys
.\"            timezone
.\"            mouse
.\"              mouse_enable
.\"              mouse_type
.\"              mouse_port
.\"              mouse_flags
.\"              mouse_disable
.\"            networking
.\"              defaultrouter
.\"              hostname
.\"              nameservers
.\"              netdev
.\"            security
.\"            ttys
.\"            [dot]
.\" 
.\" $FreeBSD$
.\"
.Dd Jan 5, 2013
.Dt BSDCONFIG 8
.Os
.Sh NAME
.Nm bsdconfig
.Nd system configuration utility
.Sh SYNOPSIS
.Nm
.Op Fl h
.Nm
.Ar command
.Op Fl h
.Nm
.Op OPTIONS
.Op command Op OPTIONS
.Sh DESCRIPTION
.Nm
is used to set up many system configuration settings, both for new systems, as
well as changing configuration settings of existing systems.
.Pp
.Nm
takes a command as an argument. If invoked with no arguments, it will bring up
a master menu listing the available commands.
.Pp
The following options are available:
.Bl -tag -width indent+
.It Fl f Ar file
Load
.Ar file
as script and then exit.
If multiple occurrences, program will only exit after last occurrence.
If
.Ar file
is a single dash
.Pq Sq Fl ,
.Nm
reads from standard input.
.It Fl h
Print usage statement and exit.
.It Fl S
Secure X11 mode
.Pq implies Fl X .
As root, always prompt-for and validate
.Xr sudo 8
username/password before starting.
.It Fl X
Use
.Xr Xdialog 1
in place of
.Xr dialog 1 .
.El
.Sh COMMANDS
The following commands
.Pq sorted alphabetically
are currently included in the base
.Nm
program, with more to be added soon.  Other commands can be added, as detailed
below in the
.Cm ADDING COMMANDS
section, and once added, will appear in the master menu as well as in the
.Cm -h
listing.
.Bl -tag -width ".Cm syscons_screenmap"
.It Cm console
Utilities to customize the behavior of the system console.
.It Cm defaultrouter
Shortcut to the Default Router/Gateway menu under networking.
.It Cm diskmgmt
Manage disk partitions and/or labels. Executes
.Xr sade 8 .
.It Cm docsinstall
Executes the
.Cm bsdinstall docsinstall
sub-utility to allow installation/re-installation of the FreeBSD Documentation
set(s).
.It Cm dot
Generate a graphviz
.Xr dot 1
language file
.Pq printed on stdout
visualizing the
.Nm
menu, include, and shortcut structure and relationships.  See
.Dq bsdconfig dot -h
for more details.
.It Cm groupadd
Shortcut to the Add Groups menu under groupmgmt.
.It Cm groupdel
Shortcut to the Delete Groups menu under groupmgmt.
.It Cm groupedit
Shortcut to the Edit/View Groups menu under groupmgmt.
.It Cm groupmgmt
Utilities to Add/Change/View/Delete Group Accounts.
.It Cm hostname
Shortcut to the Hostname/Domain menu under networking.
.It Cm mouse
Utilities for configuring, exploring, and enabling console mouse support.
.It Cm mouse_disable
Shortcut to the Disable menu under mouse.
.It Cm mouse_enable
Shortcut to the Enable menu under mouse.
.It Cm mouse_flags
Shortcut to the Flags menu under mouse.
.It Cm mouse_port
Shortcut to the Port menu under mouse.
.It Cm mouse_type
Shortcut to the Type menu under mouse.
.It Cm nameservers
Shortcut to the DNS Nameservers menu under networking.
.It Cm netdev
Shortcut to the Network Interfaces menu under networking.
.It Cm networking
Utilities to set/change Hostname/Domain, Network Interfaces, Default
Router/Gateway, and DNS Nameservers.
.It Cm password
Set the system administrator
.Pq root
password.
.It Cm security
Configure various system security settings.
.It Cm syscons_font
Shortcut to the Font menu under console.
.It Cm syscons_keymap
Shortcut to the Keymap menu under console.
.It Cm syscons_repeat
Shortcut to the Repeat menu under console.
.It Cm syscons_saver
Shortcut to the Saver menu under console.
.It Cm syscons_screenmap
Shortcut to the Screenmap menu under console.
.It Cm syscons_ttys
Shortcut to the Ttys menu under console.
.It Cm timezone
Set the regional timezone of the local machine.
.It Cm useradd
Shortcut to the Add Users menu under usermgmt.
.It Cm userdel
Shortcut to the Delete Users menu under usermgmt.
.It Cm useredit
Shortcut to the Edit/View Users menu under usermgmt.
.It Cm usermgmt
Utilities to Add/Edit/View/Delete User Accounts.
.El
.Sh INTERNATIONALIZATION
i18n features are built into
.Nm
and language-specific translation files will be added as they become available.
In the absence of language-specific translation files, the default
.Pq en_US.ISO8859-1
files will be used.
.Sh ADDING COMMANDS
To be documented later. Document menu_selection="command|*" syntax of INDEX
files.
.Sh ENVIRONMENT VARIABLES
The following environment variables affect the execution of
.Nm :
.Bl -tag -width ".Ev LC_ALL"
.It Ev LANG
If LANG is set, messages and index information will be read from files named
messages.$LANG and INDEX.$LANG and fall back to files named messages and INDEX if
messages.$LANG and INDEX.$LANG do not exist.  LANG takes precedence over LC_ALL.
.It Ev LC_ALL
If LC_ALL is set, messages and index information will be read from files named
messages.$LC_ALL and INDEX.$LC_ALL and fall back to files named messages and INDEX if
messages.$LC_ALL and INDEX.$LC_ALL do not exist.
.El
.Sh FILES
/usr/share/examples/bsdconfig/bsdconfigrc can be copied to $HOME/.bsdconfigrc and
customized as needed.
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr host-setup 8 ,
.Xr sade 8
.Sh HISTORY
.Nm
first appeared in
.Fx 10.0 .
.Sh AUTHORS
.An Ron McDowell Aq rcm@FuzzWad.ORG
.An Devin Teske Aq devinteske@hotmail.com
.Sh BUGS
Undoubtedly.
