freebsd/freebsd-src/sbin/swapon/swapon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)swapon.8	8.1 (Berkeley) 6/5/93
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt SWAPON 8
.Os
.Sh NAME
.Nm swapon , swapoff
.Nd "specify devices for paging and swapping"
.Sh SYNOPSIS
.Nm swap[on|off]
.Fl a
.Nm swap[on|off]
.Ar special_file ...
.Nm swapctl
.Fl lshk
.Nm swapctl
.Fl AU
.Nm swapctl
.Fl a
.Ar special_file ...
.Nm swapctl
.Fl d
.Ar special_file ...
.Sh DESCRIPTION
The
.Nm swap[on,off,ctl]
utilties are used to control swap devices in the system.  At boot time all
swap entries in 
.Pa /etc/fstab
are added automatically when the system goes multi-user.
Swap devices are interleaved and kernels are typically configured
to handle a maximum of 4 swap devices.  There is no priority mechanism.
.Pp
The
.Nm swapon
utility adds the specified swap devices to the system.  If the
.Fl a
option is used, all swap devices in
.Pa /etc/fstab
will be added, unless their ``noauto'' option is also set.
.Pp
The
.Nm swapoff
utility removes the specified swap devices from the system.  If the
.Fl a
option is used, all swap devices in
.Pa /etc/fstab
will be removed, unless their ``noauto'' option is also set.
Note that
.Nm swapoff
will fail and refuse to remove a swap device if there is insufficient
VM (memory + remaining swap devices) to run the system.
.Nm Swapoff
must move swapped pages out of the device being removed which could
lead to high system loads for a period of time, depending on how
much data has been swapped out to that device.
.Pp
The
.Nm swapctl
utility exists primarily for those familiar with other BSDs and may be
used to add, remove, or list swap.  Note that the
.Fl a
option is used diferently in
.Nm swapctl
and indicates that a specific list of devices should be added.
The 
.Fl d
option indicates that a specific list should be removed.  The
.Fl A
and 
.Fl D
options to
.Nm swapctl
operate on all swap entries in
.Pa /etc/fstab
which do not have their ``noauto'' option set.
.Pp
Swap information can be generated using the
.Nm swapinfo
program,
.Nm pstat
.Fl s ,
or
.Nm swapctl
.Fl lshk .
The
.Nm swapctl
utility has the following options for listing swap:
.Bl -tag -width indent
.It Fl l
List the devices making up system swap.
.It Fl s
Print a summary line for system swap.
.It Fl h
Output values in megabytes.
.It Fl k
Output values in kilobytes.
.Pp
The BLOCKSIZE environment variable is used if not specifically
overridden.  512 byte blocks are used by default.
.El
.Sh SEE ALSO
.Xr swapon 2 ,
.Xr fstab 5 ,
.Xr init 8 ,
.Xr mdconfig 8 ,
.Xr pstat 8 ,
.Xr rc 8
.Sh FILES
.Bl -tag -width "/dev/{ad,da}?s?b" -compact
.It Pa /dev/{ad,da}?s?b
standard paging devices
.It Pa /dev/md?
memory disk devices
.It Pa /etc/fstab
ASCII file system description table
.El
.Sh HISTORY
The
.Nm swapon
utility appeared in
.Bx 4.0 .
The
.Nm swapoff
utility appeared in
.Fx 5.0 .
