freebsd/freebsd-src/share/man/man8/makedev.8
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)makedev.8	6.3 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt MAKEDEV 8
.Os BSD 4.2
.Sh NAME
.Nm makedev
.Nd make system special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar device ...
.Sh DESCRIPTION
.Nm MAKEDEV
is a shell script normally used to install
special files.  It resides in the 
.Pa /dev
directory, as this is the normal location of special files.
Arguments to 
.Nm MAKEDEV
are usually of the form
.Ar device-name Ns Sy \&?
where
.Ar device-name
is one of the supported devices listed in section 4 of the
manual and
.Dq Sy \&?
is a logical unit number (0-9).  A few
special arguments create assorted collections of devices and are
listed below.
.Bl -tag -width Ds
.It Sy std
Create the
.Em standard
devices for the system; for example the standard
.Tn UNIX
devices
.Pa /dev/console and /dev/tty;
the standard hardware dependent devices,
for example in the VAX family
the
.Tn VAX-11/780
console floppy device,
.Pa /dev/floppy ,
and
.Tn VAX-11/750
and
.Tn VAX-11/730
console cassette device(s),
.Pa /dev/tu?
devices would be made for the appropriate system.
.It Sy local
Create those devices specific to the local site.  This
request causes the shell file 
.Pa /dev/MAKEDEV.local
to be executed.  Site specific commands, such as those
used to setup dialup lines as
.Pa ttyd?
should be included
in this file.
.El
.Pp
Since all devices are created using 
.Xr mknod 8 ,
this shell script is useful only to the super-user.
.Sh DIAGNOSTICS
Either self-explanatory, or generated by one of the programs
called from the script.  Use
.Ql sh -x MAKEDEV
in case of
trouble.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
