freebsd/freebsd-src/usr.sbin/gettable/gettable.8
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)gettable.8	6.5 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt GETTABLE 8
.Os BSD 4.2
.Sh NAME
.Nm gettable
.Nd get
.Tn NIC
format host tables from a host 
.Sh SYNOPSIS
.Nm gettable
.Op Fl v
.Ar host
.Op Ar outfile
.Sh DESCRIPTION
.Nm Gettable
is a simple program used to obtain the
.Tn NIC
standard
host tables from a
.Dq nicname
server.  The indicated
.Ar host
is queried for the tables.  The tables, if retrieved,
are placed in the file
.Ar outfile
or by default,
.Pa hosts.txt .
.Pp
Available option:
.Bl -tag -width Ds
.It Fl v
Get just the version number instead of the complete host table
and put the output in the file
.Ar outfile
or by default,
.Pa hosts.ver .
.El
.Pp
.Nm Gettable
operates by opening a
.Tn TCP
connection to the port indicated
in the service specification for ``nicname''.  A request
is then made for
.Dq ALL
names and the resultant information
is placed in the output file.
.Pp
.Nm Gettable
is best used in conjunction with the
.Xr htable 8
program which converts the
.Tn NIC
standard file format to
that used by the network library lookup routines.
.Sh SEE ALSO
.Xr intro 3 ,
.Xr htable 8 ,
.Xr named 8
.Sh BUGS
If the name-domain system provided network name mapping well as host
name mapping,
.Nm gettable
would no longer be needed.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
