freebsd/freebsd-src/share/man/man9/BUS_SETUP_INTR.9
.\" Copyright (c) 2000 Jeroen Ruigrok van der Werven
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd April 2, 2000
.Dt BUS_SETUP_INTR 9
.Os FreeBSD
.Sh NAME
.Nm BUS_SETUP_INTR ,
.Nm bus_setup_intr ,
.Nm BUS_TEARDOWN_INTR ,
.Nm bus_teardown_intr
.Nd create, attach and teardown an interrupt handler
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn BUS_SETUP_INTR "device_t dev" "device_t child" "struct resource *irq" "int flags" "driver_intr_t *intr" "void *arg" "void **cookiep"
.Ft int
.Fn bus_setup_intr "device_t dev" "struct resource *r" "int flags" "driver_intr_t handler" "void *arg" "void **cookiep"
.Ft int
.Fn BUS_TEARDOWN_INTR "device_t dev" "device_t child" "struct resource *irq" "void **cookiep"
.Ft int
.Fn bus_teardown_intr "device_t dev" "struct resource *r" "void *cookiep"
.Sh DESCRIPTION
The method
.Nm
will create and attach an interrupt handler to an interrupt
previously allocated by the resource manager's
.Xr BUS_ALLOC_RESOURCE 9
method.
The
.Fa flags
are found in
.Aq Pa sys/bus.h ,
and give the broad category of interrupt.
The
.Fa flags
also tell the interrupt handlers the about certain
device driver characteristics.
.Dv INTR_FAST
means the handler is for a timing-critical function.
Extra care is take to speed up these handlers.
Use of this implies
.Dv INTR_EXCL .
.Dv INTR_EXCL
marks the handler as being
an exclusive handler for this interrupt.
.Dv INTR_MPSAFE
tells the scheduler that the interrupt handler
is well behaved in a preemptive environment
(``SMP safe''),
and does not need
to be protected by the ``Giant Lock'' mutex.
.Dv INTR_ENTROPY
marks the interrupt as being a good source of entropy -
this may be used by the entropy device
.Pa /dev/random .
The handler
.Fa intr
will be called with the value
.Fa arg
as its only argument.
.Pp
The interrupt handler will be detached by
.Fn BUS_TEARDOWN_INTR .
The cookie needs to be passed to
.Fn BUS_TEARDOWN_INTR
in order to tear down the correct interrupt handler.
.Sh RETURN VALUES
Zero is returned on success,
otherwise an appropriate error is returned.
.Sh SEE ALSO
.Xr random 4 ,
.Xr device 9 ,
.Xr driver 9
.Sh AUTHORS
.An -nosplit
This man page was written by
.An Jeroen Ruigrok van der Werven
.Aq asmodai@FreeBSD.org
based on the manpages for BUS_CREATE_INTR and BUS_CONNECT_INTR written by
.An Doug Rabson
.Aq dfr@FreeBSD.org .
