freebsd/freebsd-src/share/man/man9/BUS_CREATE_INTR.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/BUS_CREATE_INTR.9,v 1.1.2.2 1999/08/29 16:47:11 peter Exp $
.\"
.Dd June 16, 1998
.Os
.Dt BUS_CREATE_INTR 9
.Os FreeBSD
.Sh NAME
.Nm BUS_CREATE_INTR
.Nd create an interrupt handler
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft void *
.Fn BUS_CREATE_INTR "device_t dev" "device_t child" "int irq" "driver_intr_t *intr" "void *arg"
.Sh DESCRIPTION
.Pp
The method
.Xr BUS_CREATE_INTR 9
creates an interrupt handler for the child device.  The handler
.Fa intr
will be called with the value
.Fa arg
as its only argument.
The handle returned can be used in a call to
.Xr BUS_CONNECT_INTR 9
to activate the handler.
.Sh RETURN VALUES
An opaque handle which can be used to activate the interrupt is
returned if the call is successful, otherwise NULL is returned.
.Sh SEE ALSO
.Xr BUS_CONNECT_INTR 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh BUGS
This interface is probably inadequate and is subject to change.
.Sh AUTHORS
This man page was written by
.An Doug Rabson .
