freebsd/freebsd-src/share/man/man9/BUS_CHILD_LOCATION.9
.\"
.\" Copyright (c) 2021 Netflix, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 22, 2021
.Dt BUS_CHILD_LOCATION 9
.Os
.Sh NAME
.Nm BUS_CHILD_LOCATION
.Nd "obtain the location of a child on the bus."
.Sh SYNOPSIS
.In sys/param.h
.In sys/bus.h
.In sys/sbuf.h
.Ft void
.Fn BUS_CHILD_LOCATION "device_t dev" "device_t child" "struct sbuf *sb"
.Sh DESCRIPTION
The
.Fn BUS_CHILD_LOCATION
method returns the location of the
.Dv child
device.
This location is a series of key=value pairs.
The string must be formatted as a space-separated list of key=value pairs.
Names may only contain alphanumeric characters, underscores ('_') and hyphens ('-').
Values can contain any non-whitespace characters.
Values containing whitespace can be quoted with double quotes ('"').
Double quotes and backslashes in quoted values can be escaped with backslashes ('\').
.Pp
The location is defined as a series of characteristics of the
.Dv child
device that can be used to locate that device independent of what drivers are
attached.
Typically, these are slot numbers, bus addresses, or some topology formation.
Where possible, buses are encouraged to provide locations that are stable from
boot to boot and when other devices are added or removed.
A location is not dependent on the kind of device at that location.
.Sh SEE ALSO
.Xr bus 9 ,
.Xr device 9
