freebsd/freebsd-src/share/man/man9/CONDSPLASSERT.9
.\" Copyright (c) 2000 Jeroen Ruigrok van der Werven,
.\"                    Jonathan M. Bresler
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 19 2000
.Os
.Dt CONDSPLASSERT 9
.Sh NAME
.Nm CONDSPLASSERT
.Nd conditional kernel spl level verification macro
.Sh SYNOPSIS
.Fd options INVARIANTS
.Fd options INVARIANT_SUPPORT
.Fn CONDSPLASSERT "condition, char *level, char *msg"
.Sh DESCRIPTION
In a kernel compiled with both "options INVARIANTS"
and "options INVARIANT_SUPPORT",
the 
.Fn CONDSPLASSERT
macro compares the current spl level of the kernel with the spl
.Ar level
specified in the macro
.Fn CONDSPLASSERT
if the specified condition is met.
If the specified
.Ar level
is not active
.Fn CONDSPLASSERT
calls the 
.Fn KASSERT
macro with the
.Ar msg,
terminating the running system.
.Pp
In a kernel that does not have both "options INVARIANTS"
and "options INVARIANT_SUPPORT",
the 
.Fn CONDSPLASSERT
macro is defined to be a no-op.  
.Pp
The behaviour of
.Fn CONDSPLASSERT
is tunable by means of the
.Xr sysctl 8
knob kern.splassertmode.
When set to 0 the
.Fn CONDSPLASSERT
macro is defined to be a no-op.
When set to 1 the
.Fn CONDSPLASSERT
macro is defined to log information to the console.
When set to 2 the
.Fn CONDSPLASSERT
macro is defined to
.Xr panic 9 .
.Sh EXAMPLE
The kernel function
.Fn swp_pager_meta_build
must be called
.Fn splvm
and has to match a certain object type:
.Bd -literal -offset indent
CONDSPLASSERT(object->type == OBJT_SWAP, vm,
              "swp_pager_meta_build");
if (object->type != OBJT_SWAP) {
        object->type = OBJT_SWAP;
        object->un_pager.swp.swp_bcount = 0;
.Ed
.Pp
.Sh SEE ALSO
.Xr config 8 ,
.Xr KASSERT 9 ,
.Xr panic 9 ,
.Xr SPLASSERT 9
.Sh AUTHORS
This man page was written by
.An Jeroen Ruigrok van der Werven
.Aq asmodai@freebsd.org ,
based on the
.Xr SPLASSERT 9 
manpage by Jonathan M. Bresler
.Aq jmb@freebsd.org .
