freebsd/freebsd-src/share/man/man9/devfs_remove_dev.9
.\"
.\" Copyright (c) 1997 Julian Elischer
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary may not claim other authorship to
.\"    the exclusion of the copyright holder.
.\" 3. Redistributors of binary releases must be willing if asked, to 
.\"    admit the true authorship and source of this software.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" -translation to english:
.\" - You can't claim it's yours without admitting to the bits I wrote.
.\" - You don't need to say anything in binary releases unless asked.
.\" $Id: devfs_remove_dev.9,v 1.7 1996/05/13 14:59:15 julian Exp $
.\"
.Dd December 25, 1997
.Os FreeBSD
.Dt DEVFS_REMOVE_DEV 9
.Sh NAME
.Nm devfs_remove_dev
.Nd  remove all references to a devfs device node and delete the node.
.Sh SYNOPSIS
.Fd #include <sys/devfsext.h>
.Ft void 
.Fn devfs_remove_dev "void * token"
.Sh DESCRIPTION
The function
.Nm
takes a token from a previous call to
.Fn devfs_add_devswf
or
.Fn devfs_link
as argument, and removes any trace of that device from device filesystems.
.Sh SEE ALSO
.Xr devfs_add_devswf 9
.Xr devfs_link 9
.Sh HISTORY
The function
.Nm
appeared in
.Fx 2.2 .
.Sh AUTHORS
DEVFS was written by
.if n Julian Elischer.
