freebsd/freebsd-src/share/man/man9/device_get_children.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\" Copyright (c) 2025 Dag-Erling Smørgrav <des@FreeBSD.org>
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 28, 2025
.Dt DEVICE_GET_CHILDREN 9
.Os
.Sh NAME
.Nm device_get_children ,
.Nm device_has_children
.Nd examine devices connected to a device
.Sh SYNOPSIS
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn device_get_children "device_t dev" "device_t **devlistp" "int *devcountp"
.Ft bool
.Fn device_has_children "device_t dev"
.Sh DESCRIPTION
The
.Nm device_get_children
function retrieves a list of all device instances currently connected
to
.Fa dev .
It returns the list in
.Fa *devlistp
and the count in
.Fa *devcountp .
The memory allocated for the list should be freed using
.Fn free "*devlistp" "M_TEMP" .
.Fa devlistp
and
.Fa devcountp
are not changed when an error is returned.
.Pp
As a special case, if
.Fa devlistp
is null, no memory is allocated but the count is still returned in
.Fa *devcountp .
.Pp
The
.Nm device_has_children
function returns
.Dv true
if
.Fa dev
has at least one child and
.Dv false
if it has none.
.Sh RETURN VALUES
The
.Nm device_get_children
function returns zero on success and an appropriate error otherwise.
The
.Nm device_has_children
function returns true if the specified device has at least one child
and false otherwise.
.Sh SEE ALSO
.Xr devclass 9 ,
.Xr device 9
.Sh AUTHORS
.An -nosplit
This manual page was written by
.An Doug Rabson Aq Mt dfr@FreeBSD.org
and
.An Dag-Erling Sm\(/orgrav Aq Mt des@FreeBSD.org .
