freebsd/freebsd-src/share/man/man9/devsw.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 9, 2001
.Dt DEVSW 9
.Os
.Sh NAME
.Nm devsw
.Nd returns the
.Vt cdevsw
structure
.Sh SYNOPSIS
.In sys/conf.h
.Ft "struct cdevsw *"
.Fn devsw "dev_t dev"
.Sh DESCRIPTION
The
.Fn devsw
function returns a pointer to the
.Vt cdevsw
structure associated
with this character device ID.
If
.Fa dev->si_cdevsw
is set it is
returned; otherwise, the
.Xr major 9
offset into the
.Va cdevsw
array is returned.
.Pp
Its argument is:
.Bl -tag -width ".Fa dev"
.It Fa dev
The device whose
.Vt cdevsw
entry should be returned.
.El
.Sh RETURN VALUES
A pointer to a
.Vt cdevsw
structure.
.Sh SEE ALSO
.Xr major 9 ,
.Xr minor 9 ,
.Xr umajor 9 ,
.Xr uminor 9
.Sh AUTHORS
This man page was written by
.An Chad David Aq davidc@acns.ab.ca .
