freebsd/freebsd-src/share/man/man9/kern_reboot.9
.\"	$NetBSD: boot.9,v 1.2 1996/09/24 07:01:26 ghudson Exp $
.\"
.\" SPDX-License-Identifier: BSD-4-Clause
.\"
.\" Copyright (c) 1997
.\" 	Mike Pritchard.  All rights reserved.
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Copyright (c) 2021,2023 The FreeBSD Foundation
.\"
.\" Portions of this documentation were written by Mitchell Horne
.\" under sponsorship from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 20, 2023
.Dt REBOOT 9
.Os
.Sh NAME
.Nm kern_reboot
.Nd reboot, halt, or power off the system
.Sh SYNOPSIS
.In sys/types.h
.In sys/systm.h
.In sys/reboot.h
.Vt extern int rebooting;
.Ft void
.Fn kern_reboot "int howto"
.In sys/eventhandler.h
.Fn EVENTHANDLER_REGISTER "shutdown_pre_sync" "shutdown_fn" "private" "priority"
.Fn EVENTHANDLER_REGISTER "shutdown_post_sync" "shutdown_fn" "private" "priority"
.Fn EVENTHANDLER_REGISTER "shutdown_final" "shutdown_fn" "private" "priority"
.Sh DESCRIPTION
The
.Fn kern_reboot
function handles final system shutdown, and either halts, reboots,
or powers down the system.
The exact action to be taken is determined by the flags passed in
.Fa howto .
.Pp
The relevant flags are:
.Bl -tag -compact -offset indent -width "RB_POWERCYCLE"
.It Dv RB_HALT
Halt the system in-place rather than restarting.
.It Dv RB_POWEROFF
Power down the system rather than restarting.
.It Dv RB_POWERCYCLE
Request a power-cycle in addition to restarting.
.It Dv RB_NOSYNC
Do not sync filesystems during shutdown.
.It Dv RB_DUMP
Dump kernel memory during shutdown.
.El
.Pp
The
.Fa howto
field, and its full list of flags are described in additional detail by
.Xr reboot 2 .
.Pp
.Fn kern_reboot
performs the following actions:
.Bl -enum -offset indent
.It
Set the
.Va rebooting
variable to
.Dv 1 ,
indicating that the reboot process has begun and cannot be stopped.
.It
Set the
.Va kdb_active
variable to
.Dv 0 ,
indicating that execution has left the kernel debugger, if it was previously
active.
.It
Unless the
.Dv RB_NOSYNC
flag is set in
.Fa howto ,
sync and unmount the system's disks by calling
.Xr vfs_unmountall 9 .
.It
If rebooting after a panic
.Po
.Dv RB_DUMP
is set in
.Fa howto ,
but
.Dv RB_HALT
is not set
.Pc ,
initiate a system crash dump via
.Fn doadump .
.It
Print a message indicating that the system is about to be halted
or rebooted, and a report of the total system uptime.
.It
Execute all registered shutdown hooks.
.It
As a last resort, if none of the shutdown hooks handled the reboot, call the
machine-dependent
.Fn cpu_reset
function.
In the unlikely case that this is not supported,
.Fn kern_reboot
will loop forever at the end of the function.
This requires a manual reset of the system.
.El
.Pp
.Fn kern_reboot
may be called from a typical kernel execution context, when the system is
running normally.
It may also be called as the final step of a kernel panic, or from the kernel
debugger.
Therefore, the code in this function is subject to restrictions described by
the
.Sx EXECUTION CONTEXT
section of the
.Xr panic 9
man page.
.Sh RETURN VALUES
The
.Fn kern_reboot
function does not return.
.Sh SEE ALSO
.Xr reboot 2 ,
.Xr EVENTHANDLER 9 ,
.Xr panic 9 ,
.Xr vfs_unmountall 9
