freebsd/freebsd-src/share/man/man9/kstack_contains.9
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2023 Joseph Koshy <jkoshy@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 2, 2023
.Dt KSTACK_CONTAINS 9
.Os
.Sh NAME
.Nm kstack_contains
.Nd determine if an address range lies within the kernel stack for a thread
.Sh SYNOPSIS
.In machine/stack.h
.Ft bool
.Fn kstack_contains "struct thread *td" "vm_offset_t va" "size_t len"
.Sh DESCRIPTION
This function can be used to determine whether a given address range
falls within the kernel stack for the thread pointed to by
.Fa td .
.Sh RETURN VALUES
The function
.Fn kstack_contains
returns
.Dv true
if the range of addresses
.Bo
.Fa va Ns .. Ns (
.Fa va Ns + Ns
.Fa len Ns - Ns 1 )
.Bc
(both addresses inclusive) lies within the kernel stack for the thread
pointed to by argument
.Fa td ,
or returns
.Dv false
otherwise.
.Sh ERRORS
This function does not return an error.
.Sh SEE ALSO
.Xr kproc 9 ,
.Xr kthread 9
