freebsd/freebsd-src/share/man/man9/lockstatus.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 9, 2001
.Dt LOCKSTATUS 9
.Os
.Sh NAME
.Nm lockstatus
.Nd "returns the lock status"
.Sh SYNOPSIS
.In sys/types.h
.In sys/lockmgr.h
.Ft int
.Fn lockstatus "struct lock *lkp" "struct thread *td"
.Sh DESCRIPTION
The
.Fn lockstatus
function returns the status of the lock in relation to the
.Vt thread
passed to it.
.Pp
Its arguments are:
.Bl -tag -width ".Fa lkp"
.It Fa lkp
The lock to return the status of.
.It Fa td
The thread to check any exclusive locks against.
If
.Fa td
is
.Dv NULL
and an exclusive lock is held,
.Dv LK_EXCLUSIVE
is returned.
.El
.Sh RETURN VALUES
.Bl -tag -width ".Dv LK_EXCLUSIVE"
.It Dv LK_EXCLUSIVE
An exclusive lock is held by the thread
.Fa td
passed in.
.It Dv LK_EXCLOTHER
An exclusive lock is held by someone other then the thread
.Fa td
passed in.
.It Dv LK_SHARED
A shared lock is held.
.It 0
The lock is not held by anyone.
.El
.Sh SEE ALSO
.Xr lockcount 9 ,
.Xr lockdestroy 9 ,
.Xr lockmgr 9 ,
.Xr lockmgr_printinfo 9
.Sh AUTHORS
This man page was written by
.An Chad David Aq davidc@acns.ab.ca .
