freebsd/freebsd-src/share/man/man9/mac_bsdextended.9
.\" Copyright (c) 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\" 
.\" This software was developed for the FreeBSD Project by Chris
.\" Costello at Safeport Network Services and NAI Labs, the Security
.\" Research Division of Network Associates, Inc. under DARPA/SPAWAR
.\" contract N66001-01-C-8035 ("CBOSS"), as part of the DARPA CHATS
.\" research program.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The names of the authors may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.\" $FreeBSD$
.Dd OCTOBER 16, 2002
.Os
.Dt MAC_BSDEXTENDED 9
.Sh NAME
.\" .Cd options MAC_BSDEXTENDED
.Nm mac_bsdextended
.Nd mandatory rules regarding users and system objects
.Sh SYNOPSIS
.Li kldload mac_bsdextended
.Sh DESCRIPTION
The
.Nm
interface provides an interface for the system administrator
to impose mandatory rules regarding users and some system objects.
Rules are uploaded to the module
(typically using
.Xr libugidfw 3 )
where they are stored internally
and used to determine whether to allow or deny specific accesses
(see
.Xr ugidfw 8 ) .
.Sh IMPLEMENTATION NOTES
While the traditional
.Xr mac 9
entry points are implemented,
policy labels are not used;
instead, access control decisions are made by iterating through the internal
list of rules until a rule
which denies the particular access
is found,
or the end of the list is reached.
.Sh SEE ALSO
.Xr libugidfw 3 ,
.Xr ugidfw 8 ,
.Xr mac 9
.Sh HISTORY
The
.Nm
interface was first introduced in
.Fx 5.0 .
.Sh AUTHORS
This software was contributed to the
.Fx
Project by NAI Labs, the Security Research Division of Network Associates
Inc. under DARPA/SPAWAR contract N66001-01-C-8035 ("CBOSS"),
as part of the DARPA CHATS research program.
