freebsd/freebsd-src/share/man/man9/pfind.9
.\" Copyright (c) 2001 Evan Sarmiento.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 3, 2025
.Dt PFIND 9
.Os
.Sh NAME
.Nm pfind ,
.Nm pfind_any ,
.Nm pfind_any_locked
.Nd locate a process by number
.Sh SYNOPSIS
.In sys/param.h
.In sys/proc.h
.Ft "struct proc *"
.Fn pfind "pid_t pid"
.Ft "struct proc *"
.Fn pfind_any "pid_t pid"
.Ft "struct proc *"
.Fn pfind_any_locked "pid_t pid"
.Sh DESCRIPTION
The
.Fn pfind
function walks the list of processes in the system, looking for the one with a
process ID of
.Fa pid .
If the process exists, and is not in the zombie state, a pointer to the process
structure will be returned.
.Pp
.Fn pfind_any
takes a
.Fa pid
as its argument.
.Fn pfind_any
searches the
.Va allproc
list and returns the first process with a matching PID, whose state may be
.Dv PRS_ZOMBIE .
.Pp
.Fn pfind_any_locked
is similar to
.Fn pfind_any ,
but it does not lock the process hash bucket for the given
.Vt pid .
Instead, it asserts the corresponding process hash bucket is already locked.
.Pp
All three functions
.Fn pfind ,
.Fn pfind_any ,
and
.Fn pfind_any_locked
lock the
.Vt proc
structure before returning.
.Sh RETURN VALUES
.Fn pfind ,
.Fn pfind_any ,
and
.Fn pfind_any_locked
return pointer to a
.Vt proc
structure on success or
.Dv NULL
on failure.
.Sh SEE ALSO
.Xr pget 9 ,
.Xr pgfind 9
.Sh AUTHORS
This manual page was written by
.An Evan Sarmiento Aq Mt kaworu@sektor7.ath.cx .
