freebsd/freebsd-src/share/man/man9/pmap_change_wiring.9
.\"
.\" Copyright (c) 2003 Bruce M Simpson <bms@spc.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/pmap_change_wiring.9,v 1.3.28.1 2009/04/15 03:14:26 kensmith Exp $
.\"
.Dd July 21, 2003
.Dt PMAP_CHANGE_WIRING 9
.Os
.Sh NAME
.Nm pmap_change_wiring
.Nd change physical wiring for a map or virtual address pair
.Sh SYNOPSIS
.In sys/param.h
.In vm/vm.h
.In vm/pmap.h
.Ft void
.Fn pmap_change_wiring "pmap_t pmap" "vm_offset_t va" "boolean_t wired"
.Sh DESCRIPTION
The
.Fn pmap_change_wiring
function changes the wiring attribute for the page at virtual address
.Fa va
in the physical map
.Fa pmap .
A wired page gets its name from being
.Dq wired
into the system page tables so that it will not be paged out.
.Pp
The mapping must already exist in the
.Fa pmap .
If
.Fa wired
is
.Dv TRUE ,
the map's wired page count will be incremented; if
.Dv FALSE ,
it will be decremented.
.Pp
It is typically called by the
.Fn vm_fault_unwire
function.
.Sh SEE ALSO
.Xr pmap 9
.Sh AUTHORS
This manual page was written by
.An Bruce M Simpson Aq bms@spc.org .
