freebsd/freebsd-src/share/man/man9/resettodr.9
.\"	$NetBSD: resettodr.9,v 1.1 1995/11/25 21:24:51 perry Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/resettodr.9,v 1.7.26.1 2008/10/02 02:57:24 kensmith Exp $
.\"
.Dd November 13, 1995
.Dt RESETTODR 9
.Os
.Sh NAME
.Nm resettodr
.Nd set battery-backed clock from system time
.Sh SYNOPSIS
.In sys/types.h
.In sys/systm.h
.Ft void
.Fn resettodr "void"
.Sh DESCRIPTION
The
.Fn resettodr
function sets the system's battery-backed clock based on the contents
of the system
.Va time
variable.
.Sh SEE ALSO
.Xr inittodr 9 ,
.Xr time 9
.Sh BUGS
On many systems,
.Fn resettodr
has to convert from
.Va time
to a time expressed in terms of year, month, day, hours, minutes,
and seconds.
Many of the implementations could share code, but do not.
