freebsd/freebsd-src/share/man/man9/resource_int_value.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2001 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 1, 2001
.Dt RESOURCE_INT_VALUE 9
.Os FreeBSD
.Sh NAME
.Nm resource_int_value
.Nd get a value from the hints mechanism.
.Sh SYNOPSIS
.Fd #include <sys/bus.h>
.Ft int
.Fn resource_int_value "const char *name" "int unit" "const char *resname" "int *result"
.Pp
.Ft int
.Fn resource_long_value "const char *name" "int unit" "const char *resname" "long *result"
.Pp
.Ft int
.Fn resource_string_value "const char *name" "int unit" "const char *resname" "char **result"
.Sh DESCRIPTION
.Pp
Fetches a value from the hints mechanism.
.Pp
Its arguments are as follows:
.Bl -item
.It
.Fa name
Name of the device to get the value on.
.It
.Fa unit
Unit number to get the device.
-1 is special and is used for wildcard entries.
.Fa field
is the name of the field.
.Fa value
is a pointer to the value.
.Sh RETURN VALUES
0 on sucess, non-zero on failure.
.\".Sh EXAMPLES
.Sh SEE ALSO
.Xr driver 9 ,
.Xr device 9 ,
.Sh AUTHORS
.An -nosplit
This man page was written by
.An Warner Losh Aq imp@FreeBSD.org .
