freebsd/freebsd-src/share/man/man9/resource_query_string.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2001 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 1, 2001
.Dt RESOURCE_QUERY_STRING 9
.Os FreeBSD
.Sh NAME
.Nm resource_query_string
.Nd queries the hints database for matches
.Sh SYNOPSIS
.Fd #include <sys/bus.h>
.Ft int
.Fn resource_query_string "int num" "const char *field" "const char *what"
.Pp
.Ft char *
.Fn resource_query_name "int num"
.Sh DESCRIPTION
.Pp
Queries strings in the hints database that match the
.Fa what
field.
.Pp
.Fn resouce_query_string 
is called to see enumerate all possible strings.
It returns the next one after num that is available,
or -1 if nothing further is available.
.Fn resource_query_name 
is passed the return of 
.Fn resource_query_string 
and returns its value.
.Bl -item
.It
.Fa num
Index to get.
Set initially to -1 for the first call,
and to the previous return value of
.Fn resource_query_string
on subsequent calls.
.It
.Fa field
is the name of the field.
.Pp
.Fa what
is the string to look for.
.Sh RETURN VALUES
-1 on failure, otherwise it is the index to pass
resource_query_name().
.Sh EXAMPLES
The following example will return all the hints that say they are
at gerbil0.
An example hint would be:
.Bd -literal
hint.habitat.0.at="gerbil0"
hint.ewheel.0.at="gerbil0"
hint.fred.0.at="nexus"
.Ed
.Pp
The following code
.Bd -literal
	int i = -1;
	while ((i = resource_query_string(i, "at", "gerbil0")) != -1) {
		printf("Found %s%d at gerbil0\n", resource_query_name(i),
		    resource_query_unit(i));
	}
.Ed
would produce two lines:
.Bd -literal
Found habitat0 at gerbil0
Found ewheel0 at gerbil0
.Ed
.Sh SEE ALSO
.Xr driver 9 ,
.Xr device 9 ,
.Xr resource_int_value 9 .
.Sh AUTHORS
.An -nosplit
This man page was written by
.An Warner Losh Aq imp@FreeBSD.org .
