freebsd/freebsd-src/share/man/man9/ucred.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 9, 2001
.Dt UCRED 9
.Os
.Sh NAME
.Nm ucred ,
.Nm crget ,
.Nm crhold ,
.Nm crfree ,
.Nm crcopy ,
.Nm crdup
.Nd "functions related to user credentials"
.Sh SYNOPSIS
.In sys/param.h
.In sys/ucred.h
.Ft "struct ucred *"
.Fn crget void
.Ft void
.Fn crhold "struct ucred *cr"
.Ft void
.Fn crfree "struct ucred *cr"
.Ft "struct ucred *"
.Fn crcopy "struct ucred *cr"
.Ft "struct ucred *"
.Fn crdup "struct ucred *cr"
.Sh DESCRIPTION
The
.Nm
family of functions is used to manage user credential structures
.Pq Vt "struct ucred"
within the kernel.
.Pp
The
.Fn crget
function allocates memory
for a new structure, sets its reference count to 1, and
initializes its lock.
.Pp
The
.Fn crhold
function increases the reference count on the credential.
.Pp
The
.Fn crfree
function decreases the reference count on the credential.
If the count drops to 0, the storage for the structure is freed.
.Pp
The
.Fn crcopy
function calls
.Fn crdup
to create a new structure, and copies the old credentials,
if the reference count is greater than 1;
otherwise, the original is returned.
.Pp
The
.Fn crdup
function allocates memory for a new structure,
copies the contents of the original structure
into it, references the
.Va cr_uidinfo
and
.Va cr_ruidinfo
fields, sets the reference count
to 1, and then returns the new structure.
.Sh RETURN VALUES
The functions that return values all return a pointer to a
.Vt ucred
structure.
In the case of
.Fn crcopy ,
the return value may be the same structure you passed to it.
.Sh SEE ALSO
.Xr uihold 9
.Sh AUTHORS
This man page was written by
.An Chad David Aq davidc@acns.ab.ca .
