freebsd/freebsd-src/share/man/man9/ucred.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd March 3, 2002
.Dt UCRED 9
.Os
.Sh NAME
.Nm ucred ,
.Nm crget ,
.Nm crhold ,
.Nm crfree ,
.Nm crshared ,
.Nm crcopy ,
.Nm crdup ,
.Nm cru2x ,
.NM cred_update_thread
.Nd "functions related to user credentials"
.Sh SYNOPSIS
.In sys/param.h
.In sys/ucred.h
.Ft "struct ucred *"
.Fn crget void
.Ft "struct ucred *"
.Fn crhold "struct ucred *cr"
.Ft void
.Fn crfree "struct ucred *cr"
.Ft int
.Fn crshared "struct ucred *cr"
.Ft void
.Fn crcopy "struct ucred *dest" "struct ucred *src"
.Ft "struct ucred *"
.Fn crdup "struct ucred *cr"
.Ft void
.Fn cru2x "struct ucred *cr" "struct xucred *xcr"
.Ft void
.Fn cred_update_thread "struct thread *td"
.Sh DESCRIPTION
The
.Nm
family of functions is used to manage user credential structures
.Pq Vt "struct ucred"
within the kernel.
.Pp
The
.Fn crget
function allocates memory
for a new structure, sets its reference count to 1, and
initializes its lock.
.Pp
The
.Fn crhold
function increases the reference count on the credential.
.Pp
The
.Fn crfree
function decreases the reference count on the credential.
If the count drops to 0, the storage for the structure is freed.
.Pp
The
.Fn crshared
function returns true if the credential is shared.
A credential is considered to be shared if its reference
count is greater than one.
.Pp
The
.Fn crcopy
function copies the contents of the source (template)
credential into the destination template.
The
.Vt uidinfo
structure within the destination is referenced
by calling
.Xr uihold 9 .
.Pp
The
.Fn crdup
function allocates memory for a new structure and copies the
contents of
.Fa cr
into it.
The actual copying is performed by
.Fn crcopy .
.Pp
The
.Fn cru2x
function converts a
.Vt ucred
structure to an
.Vt xucred
structure.
That is,
it copies data from
.Fa cr
to
.Fa xcr ;
it ignores fields in the former that are not present in the latter
(e.g.,
.Va cr_uidinfo ) ,
and appropriately sets fields in the latter that are not present in
the former
(e.g.,
.Va cr_version ) .
.Pp
The
.Fn cred_update_thread
function sets the credentials of
.Fa td
to that of its process, freeing its old credential if required.
.Sh RETURN VALUES
.Fn crget ,
.Fn crhold
and
.Fn crdup
all return a pointer to a
.Vt ucred
structure.
.Pp
.Fn crshared
returns 0 if the credential has a reference count greater than 1;
otherwise, 1 is returned.
.Sh SEE ALSO
.Xr uihold 9
.Sh AUTHORS
This man page was written by
.An Chad David Aq davidc@acns.ab.ca .
