freebsd/freebsd-src/share/man/man9/VFS_CHECKEXP.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: VFS_FHTOVP.9,v 1.4 1998/08/03 17:29:44 bde Exp $
.\" $FreeBSD$
.\"
.Dd July 24, 1996
.Os
.Dt VFS_CHECKEXP 9
.Sh NAME
.Nm VFS_CHECKEXP
.Nd check if vnode is exported to a client
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/mount.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fn VFS_CHECKEXP "struct mount *mp" "struct mbuf  *nam" "int *exflagsp" "struct ucred **credanonp"
.Sh DESCRIPTION
This is used by the NFS server to check if a vnode is exported to a client.
.Pp
Its arguments are:
.Bl -tag -width credanonp
.It Ar mp
The mount point to be checked.
.It Ar nam
An mbuf containing the network address of the client.
.It Ar exflagsp
Return parameter for the export flags for this client.
.It Ar credanonp
Return parameter for the anonymous credentials for this client.
.El
.Pp
This should be called on a file system's mount structure to determine if it 
is exported to a client whos address is contained in 
.Fa nam .
.Pp
It is generally called before
.Xr VFS_FHTOVP 9
to validate that a client has access to the filesystem.
.Pp
The filesystem should call
.Xr vfs_export_lookup 9
with the address of an appropriate
.Dv netexport 
structure and the address of the client,
.Fa nam ,
to verify that the client can access this filesystem.
.Pp
.Sh RETURN VALUES
The export flags and anonymous credentials specific to the client
will be returned in
.Fa *exflagsp
and
.Fa *credanonp .
.Sh SEE ALSO
.Xr VFS 9 ,
.Xr VFS_FHTOVP 9 ,
.Xr VFS_VPTOFH 9 ,
.Xr vnode 9
.Sh AUTHORS
This man page was written by
.An Doug Rabson ,
for 
.Xr VFS_FHTOVP 9
and modified for 
.Xr VFS_CHECKEXP 9
by
.An Alfred Perlstein .
