freebsd/freebsd-src/share/man/man9/VFS_SYNC.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/VFS_SYNC.9,v 1.12 2003/10/23 06:24:55 hmp Exp $
.\"
.Dd July 24, 1996
.Os
.Dt VFS_SYNC 9
.Sh NAME
.Nm VFS_SYNC
.Nd flush unwritten data
.Sh SYNOPSIS
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_SYNC "struct mount *mp" "int waitfor" "struct ucred *cred" "struct thread *td"
.Sh DESCRIPTION
This writes out all unwritten data in a file system.
.Pp
Its arguments are:
.Bl -tag -width waitfor
.It Fa mp
The file system.
.It Fa waitfor
Whether the function should wait for I/O to complete.
Possible values are:
.Bl -tag -width MNT_NOWAIT
.It Dv MNT_WAIT
synchronously wait for I/O to complete
.It Dv MNT_NOWAIT
start all I/O, but do not wait for it
.It Dv MNT_LAZY
push data not written by file system syncer
.El
.It Fa cred
The caller's credentials.
.It Fa td
The calling thread.
.El
.Pp
This would normally call
.Xr VOP_FSYNC 9
for all the vnodes in the file system.
.Sh SEE ALSO
.Xr fsync 2 ,
.Xr sync 2 ,
.Xr VFS 9 ,
.Xr vnode 9 ,
.Xr VOP_FSYNC 9
.Sh AUTHORS
This manual page was written by
.An Doug Rabson .
