freebsd/freebsd-src/share/man/man9/vfs_mountedon.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 21, 2001
.Dt VFS_MOUNTEDON 9
.Os
.Sh NAME
.Nm vfs_mountedon
.Nd "check if the vnode belongs to a mounted filesystem"
.Sh SYNOPSIS
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn vfs_mountedon "struct vnode *vp"
.Sh DESCRIPTION
.Fn vfs_mountedon
inspects the mount structure in
.Fa vp
to determine if it points to a valid mount point.
If the mount is valid the vnode is considered to be busy.
.Pp
A common use of
.Fn vfs_mountedon
it to call it on device vnodes to determine if they are already associated with
a filesystem.
This is done to prevent multiple mounts on the same device.
.Sh RETURN VALUES
.Dv EBUSY
is returned if the vnode has a valid mount point; otherwise, 0 is returned.
.Sh PSEUDOCODE
.Bd -literal
	int
	ffs_mountfs(devvp, mp, td, malloctype)
		register struct vnode *devvp;
		struct mount *mp;
		struct thread *td;
		struct malloc_type *malloctype;
	{
		...

		error = vfs_mountedon(devvp);
		if (error)  
			return (error);

		...
	}
.Ed
.Sh AUTHORS
This man page was written by
.An Chad David Aq davidc@acns.ab.ca .
