freebsd/freebsd-src/share/man/man9/VFS_QUOTACTL.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 29, 2021
.Dt VFS_QUOTACTL 9
.Os
.Sh NAME
.Nm VFS_QUOTACTL
.Nd manipulate file system quotas
.Sh SYNOPSIS
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_QUOTACTL "struct mount *mp" "int cmds" "uid_t uid" "void *arg" "bool *mp_busy"
.Sh DESCRIPTION
Implement file system quotas.
.Pp
The
.Fa mp_busy
argument is an input/output parameter.
.Fn VFS_QUOTACTL
must be called with
.Fa mp
marked busy through
.Xr vfs_busy 9
and
.Fa *mp_busy
set to true.
The filesystem implementation of
.Fn VFS_QUOTACTL
may then unbusy
.Fa mp
using
.Xr vfs_unbusy 9
prior to performing quota file I/O.
In this case the implementation must set
.Fa *mp_busy
to false to indicate that the caller must not unbusy
.Fa mp
upon completion of
.Fn VFS_QUOTACTL .
.Pp
See
.Xr quotactl 2
for a description of the remaining arguments.
.Sh SEE ALSO
.Xr quotactl 2 ,
.Xr vnode 9
.Sh AUTHORS
This manual page was written by
.An Doug Rabson .
