freebsd/freebsd-src/share/man/man9/vfs_unbusy.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 8, 2001
.Dt VFS_UNBUSY 9
.Os
.Sh NAME
.Nm vfs_unbusy
.Nd "Unbusy a mount point.
.Sh SYNOPSIS
.Ft void
.Fo vfs_unbusy
.Fa "struct mount *mp"
.Fa "struct proc *p"
.Fc
.Sh DESCRIPTION
The
.Nm
function unbusys (unlocks) a mount point by unlocking
mp->mnt_lock.  The lock is typically aquired by calling
vfs_busy() prior to this call.
.Pp
Its arguments are:
.Bl -tag -width uap
.It Ar mp
The mount point to unbusy (unlock).
.It Ar p
The process responsible for this call.
.El
.Sh LOCKS
.Ar mnt_lock
must be locked in
.Ar mp
prior to calling
this function, and it will be unlocked upon return.
.Sh SEE ALSO
.Xr vfs_busy 9
.Sh AUTHORS
This man page was written by Chad David.
