freebsd/freebsd-src/share/man/man9/vm_page_protect.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/vm_page_protect.9,v 1.2 2001/08/08 10:04:08 ru Exp $
.\"
.Dd July 14, 2001
.Dt VM_PAGE_PROTECT 9
.Os
.Sh NAME
.Nm vm_page_protect
.Nd "lower a page's protection"
.Sh SYNOPSIS
.In sys/param.h
.In vm/vm.h
.In vm/vm_page.h
.Ft void
.Fn vm_page_protect "vm_page_t mem" "int prot"
.Sh DESCRIPTION
The
.Fn vm_page_protect
function lowers a page's protection.
The protection is never raised by this function; therefore, if the page is
already at
.Dv VM_PROT_NONE ,
the function does nothing.
.Pp
Its arguments are:
.Bl -tag -width ".Fa prot"
.It Fa mem
The page whose protection is lowered.
.It Fa prot
The protection the page should be reduced to.
If
.Dv VM_PROT_NONE
is specified, then the
.Dv PG_WRITABLE
and
.Dv PG_MAPPED
flags are cleared and the pmap_page's protection is set to
.Dv VM_PROT_NONE .
If
.Dv VM_PROT_READ
is specified, then the
.Dv PG_WRITABLE
flag is cleared and the pmap_page's protection is set to
.Dv VM_PROT_READ .
.El
.Pp
Higher protection requests are ignored.
.Sh AUTHORS
This man page was written by
.An Chad David Aq davidc@acns.ab.ca .
