freebsd/freebsd-src/share/man/man9/vm_page_lookup.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/vm_page_lookup.9,v 1.2.16.1 2008/10/02 02:57:24 kensmith Exp $
.\"
.Dd July 13, 2001
.Dt VM_PAGE_LOOKUP 9
.Os
.Sh NAME
.Nm vm_page_lookup
.Nd "lookup a vm page"
.Sh SYNOPSIS
.In sys/param.h
.In vm/vm.h
.In vm/vm_page.h
.Ft vm_page_t
.Fn vm_page_lookup "vm_object_t object" "vm_pindex_t pindex"
.Sh DESCRIPTION
The
.Fn vm_page_lookup
function searches for a VM page given its VM object and index.
If the page is not found,
.Dv NULL
is returned.
Its arguments are:
.Bl -tag -width ".Fa object"
.It Fa object
The VM object to search on.
.It Fa pindex
The page index to search on.
.El
.Sh RETURN VALUES
A
.Vt vm_page_t
is returned if successful; otherwise,
.Dv NULL
is returned.
.Sh AUTHORS
This manual page was written by
.An Chad David Aq davidc@acns.ab.ca .
