freebsd/freebsd-src/share/man/man9/vn_isdisk.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 9, 2001
.Dt VN_ISDISK 9
.Os
.Sh NAME
.Nm vn_isdisk
.Nd "Checks if the vnode represents a disk"
.Sh SYNOPSIS
.Fd #include <sys/vnode.h>
.Ft int
.Fo vn_isdisk
.Fa "struct vnode *vp"
.Fa "int *errp"
.Fc
.Sh DESCRIPTION
The
.Nm
function checks to see if the vnode represents a disk.
In order for the vnode to be a disk it must be a character
device, v_rdev must be valid, and the cdevsw entrys flags
must have D_DISK set.
.Pp
Its arguments are:
.Bl -tag errp
.It Ar vp
The vnode to check.
.It Ar errp
A integer pointer to store the error number in if the call fails. 
.El
.Sh RETURN VALUES
If the vnode represents a disk one is returned; otherwise, zero
is returned and
.Ar errp
will contain the error number.
.Sh AUTHORS
This man page was written by Chad David.
