freebsd/freebsd-src/share/man/man9/VOP_REVOKE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2002 Brian Fundakowski Feldman
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd February 5, 2002
.Os
.Dt VOP_REVOKE 9
.Sh NAME
.Nm VOP_REVOKE
revokes access to a device and its aliases
.Sh SYNOPSIS
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn VOP_INACTIVE "struct vnode *vp" "int flags"
.Sh DESCRIPTION
.Nm VOP_REVOKE
will administratively revoke access to the device specified by
.Ar vp ,
as well as any aliases created via
.Xr make_dev_alias 9 .
Further file operations on any of these devices by processes which have them open will nominally fail.
The
.Ar flags
must be set to
.Dv REVOKEALL
to signify that all access will be revoked; any other value is invalid.
.Sh LOCKS
The
.Ar vp
will be unlocked on entry, and will remain unlocked upon return.
.Sh SEE ALSO
.Xr make_dev_alias 9 ,
.Xr vnode 9
.Sh AUTHORS
This man page was written by
.An Brian Fundakowski Feldman .
