freebsd/freebsd-src/share/man/man9/VOP_SETEXTATTR.9
.\"-
.\" Copyright (c) 1999 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"       $FreeBSD: src/share/man/man9/VOP_SETEXTATTR.9,v 1.1 2000/01/05 04:59:01 rwatson Exp $
.\"
.Dd December 23, 1999
.Os
.Dt VOP_SETEXTATTR 9
.Sh NAME
.Nm VOP_SETEXTATTR
.Nd Set named extended attribute for a vnode
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Fd #include <sys/extattr.h>
.Ft int
.Fn VOP_SETEXTATTR "struct vnode *vp" "char *name" "struct uio *uio" "struct ucred *cred" "struct proc *p"
.Sh DESCRIPTION
This vnode call may be used to set specific named extended attribute for a
file or directory.
.Pp
Its arguments are:
.Bl -tag -width type
.It Ar vp
the vnode of the file or directory
.It Ar name
pointer to a null-terminated character string containing the attribute name
.It Ar uio
the location of the data to be read or written
.It Ar cred
the user credentials to use in authorizing the request
.It Ar p
the process setting the extended attribute
.El
.Pp
The uio structure is used in a manner similar to the argument of the same
name in 
.Xr VOP_WRITE .
However, as extended attributes provide a strict "name=value" semantic,
non-zero offsets will be rejected.
.Pp
The
.Fa uio
pointer may be NULL to indicate that the specified extended attribute
should be deleted.
.Pp
The
.Fa cred
pointer may be NULL to indicate that access control checks are not to be
performed, of possible.  This cred setting might be used to allow the 
kernel to authorize extended attribute changes that the active process might
not be permitted to make.
.Pp
Extended attribute semantics may vary by file system implementing the call.
More information on extended attributes may be found in
.Xr extattr 9 .
.Sh LOCKS
The vnode will be locked on entry and should remain locked on return.
.Sh RETURN VALUES
If the extended attribute is successfully set, then zero is returned.
Otherwise, an appropriate error code is returned.
.Sh ERRORS
.Bl -tag -width Er
.It Bq Er EACCES
Permission denied
.It Bq Er ENXIO
The request was not valid in this file system for the specified vnode and
attribute name.
.It Bq Er ENOMEM
Insufficient memory available to fulfill request
.It Bq Er EFAULT
The uio structure refers to an invalid userspace address
.It Bq Er EINVAL
The name or uio argument is invalid
.It Bq Er EOPNOTSUPP
The file system does not support VOP_GETEXTATTR
.It Bq Er ENOSPC
The file system is out of space
.It Bq Er EROFS
The file system is read-only
.El
.Sh SEE ALSO
.Xr extattr 9 ,
.Xr vnode 9 ,
.Xr VOP_GETEXTATTR 9
.Sh AUTHORS
This man page was written by
.An Robert Watson .
