freebsd/freebsd-src/share/man/man9/VOP_VALLOC.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: VOP_VALLOC.9,v 1.1 1997/03/03 18:00:52 dfr Exp $
.\"
.Dd July 24, 1996
.Os
.Dt VOP_VALLOC 9
.Sh NAME
.Nm VOP_VALLOC ,
.Nm VOP_VFREE
.Nd Allocate a new inode in the filesystem.
.Sh SYNOPSIS
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fn VOP_VALLOC "struct vnode *pvp" "int mode" "struct ucred *cred" "struct vnode **vpp"
.Ft int
.Fn VOP_VFREE "struct vnode *pvp" "ino_t ino" "int mode"
.Sh DESCRIPTION
.Pp
The arguments are:
.Bl -tag -width mdoe
.It Ar pvp
The parent directory of the new vnode.
.It Ar mode
The mode and type of the new vnode.
.It Ar cred
The credentials of the caller.
.It Ar vpp
Return parameter for the new vnode.
.El
.Pp
These calls are used internally by the UFS filesystem to allocate and
free filesystem resources.
.Sh SEE ALSO
.Xr vnode 9
.Sh AUTHORS
This man page was written by Doug Rabson.
