freebsd/freebsd-src/share/man/man9/VOP_LEASE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/VOP_LEASE.9,v 1.10 2003/10/23 03:14:21 hmp Exp $
.\"
.Dd September 24, 1999
.Os
.Dt VOP_LEASE 9
.Sh NAME
.Nm VOP_LEASE
.Nd "validate a vnode for a particular set of credentials and operation type"
.Sh SYNOPSIS
.In sys/param.h
.In sys/mount.h
.Ft int
.Fn VOP_LEASE "struct vnode *vp" "struct thread *td" "struct ucred *cred" "int type"
.Sh DESCRIPTION
This entry point is currently not implemented.
The idea is to
validate a vnode for a particular set of user credentials and operation type.
The two operation types supported are
.Dv LEASE_READ
and
.Dv LEASE_WRITE .
.Sh RETURN VALUES
The function currently returns 0 in all cases.
.Sh ERRORS
.Sh SEE ALSO
.Xr VOP_READ 9 ,
.Xr VOP_WRITE 9
.Sh LOCKS
The vnode must be exclusively locked on entry, and should remain exclusively
locked on return.
.Sh AUTHORS
This manual page was written by
.An Matt Dillon .
