freebsd/freebsd-src/share/man/man9/watchdog.9
.\"
.\" Copyright (c) 2004 Poul-Henning Kamp <phk@FreeBSD.org
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd February 28, 2004
.Dt watchdog 9
.Os
.Sh NAME
.Nm watchdog
.Nd "Software and hardware watchdog facility"
.Sh SYNOPSIS
.In sys/watchdog.h
.Ft "void"
.Fn watchdog_fn "void *private" "u_int cmd" "int *error"
.Bl -literal
EVENTHANDLER_REGISTER(watchdog_list, watchdog_fn, private, 0);
.El
.Sh DESCRIPTION
To implement a watchdog in software or hardware, only a single
function needs to be written and registered on the global
watchdog_list.
.Pp
The function must examine the cmd argument and act on it as
follows:
.Pp
If cmd is zero, the watchdog must be disabled and the error
argument left untouched.
.Pp
Else the watchdog should be reset and configured to a timeout of
(1<<(cmd & WD_INTERVAL))
nanoseconds or larger and the error argument be set to zero.
.Pp
If the watchdog can not be configured to the proposed timeout, it
must be disabled and the error argument left untouched.
.Pp
There is no specification of what the watchdog should do when it
times out, but a hardware reset or similar "drastic but certain"
behaviour is recommended.
.Sh SEE ALSO
.Xr watchdog 4
.Sh AUTHORS
.An -nosplit
The watchdog facility and this manual page was written 
.An Poul-Henning Kamp Aq phk@FreeBSD.org .
