freebsd/freebsd-src/usr.sbin/pkg_install/updating/pkg_updating.1
.\"
.\" FreeBSD updating - Scan the installed ports and show all UPDATING entries
.\"	that affect one of the installed ports. Alternative a list of portnames
.\" could be passed to pkg_updating
.\"
.\" "THE BEER-WARE LICENSE" (Revision 42):
.\" <beat@chruetertee.ch> wrote this file. As long as you retain this notice you
.\" can do whatever you want with this stuff. If we meet some day, and you think
.\" this stuff is worth it, you can buy me a beer in return.          Beat Gätzi
.\"
.\" $FreeBSD$
.\"
.Dd November 9, 2012
.Dt PKG_UPDATING 1
.Os
.Sh NAME
.Nm pkg_updating
.Nd a utility for displaying UPDATING entries of software packages
.Sh SYNOPSIS
.Nm
.Op Fl h
.Op Fl d Ar date
.Op Fl f Ar file
.Op Ar pkg-name ...
.Nm
.Sh DESCRIPTION
The
.Nm
command scans the installed ports and show all UPDATING entries that affect one
of the installed ports. Alternative a list of pkg-names could be passed.
.Sh OPTIONS
The following command line options are supported:
.Bl -tag -width indent
.It Ar pkg-name ...
UPDATING entries for the named packages are displayed.
.It Fl d , -date Ar date
Only entries newer than
.Ar date
are shown. Use a YYYYMMDD date format.
.It Fl f , -file Ar file
Defines a alternative location of the UPDATING
.Ar file .
.It Fl h , -help
Print help message.
.El
.Sh ENVIRONMENT
.Bl -tag -width PKG_DBDIR
.It Ev PKG_DBDIR
Specifies an alternative location for the installed package database.
.It Ev PORTSDIR
Location of the ports tree.
.El
.Sh FILES
.Bl -tag -width /var/db/pkg -compact
.It Pa /var/db/pkg
Default location of the installed package database.
.It Pa /usr/ports
The default ports directory and default location of the UPDATING file.
.El
.Sh EXAMPLES
Shows all entries of all installed ports:
.Dl % pkg_updating
.Pp
Shows all entries of all installed ports since 2007-01-01:
.Dl % pkg_updating -d 20070101
.Pp
Shows all entries for all apache and mysql ports:
.Dl % pkg_updating apache mysql
.Pp
Shows all apache entries since 2006-01-01:
.Dl % pkg_updating -d 20060101 apache
.Pp
Defines that the UPDATING file is in /tmp and shows all entries of all
installed ports:
.Dl % pkg_updating -f /tmp/UPDATING
.Pp
Fetch UPDATING file from ftp mirror and show all entries of all
installed ports:
.Dl % pkg_updating -f ftp://ftp.freebsd.org/pub/FreeBSD/ports/packages/UPDATING
.Sh ENVRIOMENT
.Bl -tag -width indent
.It Ev PKG_OLD_NOWARN
If set
.Nm
will not warn about its use in the presence of pkgng databases.
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_version 1
.Sh AUTHORS
.An Beat G\(:atzi Aq beat@chruetertee.ch
.Sh CONTRIBUTORS
.An Martin Tournoij Aq carpetsmoker@xs4all.nl
.Sh BUGS
Sure to be some.
