freebsd/freebsd-src/usr.sbin/watch/watch.8
.\"
.\" @(#)watch.8		1.1 (FreeBSD) 2/17/95
.\"
.Dd February 17, 1995
.Dt WATCH 8
.Os
.Sh NAME
.Nm watch
.Nd snoop on another tty line
.Sh SYNOPSYS
.Nm watch
.Op Fl ciot
.Ar tty
.\"  watch [-ciot] [<tty name>]
.Sh DESCRIPTION
.Nm Watch
allows the superuser to examine all data coming through a specified tty.
.Nm Watch
writes to standard output.
.Pp
The options are as follows:
.Bl -tag -width "-l nul  "
.It Fl c
Reconnect on close.  If the tty observed by
.Nm watch
is closed,  automatically reattach to the same tty.
If this option is not specified,
.Nm watch
will request a new tty if running in interactive mode or exit if running
without a controlling tty.
.It Fl i
Force interactive mode.
Interactive mode is a default if
.Nm watch
is started from a tty.
If output is redirected to a file, interactive mode can still be requested
by specifying this option.
.It Fl o
Reconnect on overflow.
The behaviour of
.Nm watch
if the observed tty overflows is similar to the behavior if the observed tty
is closed.
For more info see
.Xr snp 4 .
.It Fl t
Print the date and time when observation of a given tty is started.
.It Ar tty
Tty may be specified as a remote pseudo tty device, a virtual console, or
a serial line.
Names may be preceded by "/dev/".
.Sh OPERATION
While running in interactive mode, all user input is discarded except for:
.Pp
.Bl -tag -width "XXXX" -compact
.It Sy "<control-C>"
Exit
.Nm watch .
.It Sy "<control-W>"
Clear screen.
.It Sy "<control-X>"
Change attached tty.
.Sh RESTRICTIONS
Only the superuser can run
.Nm watch .
.Sh SEE ALSO
.Xr snp 4 ,
.Xr pty 4 ,
.Xr sio 4 .
.Sh BUGS
No terminal emulation is performed.
All user output is reproduced as-is.
.Sh AUTHOR
Ugen J.S. Antsilevich <ugen@NetVision.net.il> 
.Sh HISTORY
.Nm Watch
first appeared in FreeBSD 2.1
